var DATA__OLD_TECH_TIME='2025-01-12T01:52:04.606Z'
var DATA__OLD_TECH=[
  {
    "id": "n0",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Телепортация\nСложность: 6\nЭффект: :телепортация",
    "name": "Телепортация",
    "req": [
      "n39"
    ],
    "next": [],
    "title": null,
    "x": 334.33,
    "y": 1359,
    "lvl": 15,
    "subtree": "Физика пространства"
  },
  {
    "id": "n1",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Стазис\nСложность: 5, экзотическая материя (1)\nЭффект: +3 свободных куба",
    "name": "Стазис",
    "req": [
      "n68",
      "n44"
    ],
    "next": [
      "n124"
    ],
    "title": null,
    "x": -245.17,
    "y": 1083,
    "lvl": 12,
    "subtree": "Физика пространства"
  },
  {
    "id": "n2",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Ограниченный ИИ\nСложность: 4\nЭффект: +2 свободных куба",
    "name": "Ограниченный ИИ",
    "req": [
      "n75"
    ],
    "next": [
      "n79",
      "n125"
    ],
    "title": null,
    "x": 632.95,
    "y": 715,
    "lvl": 8,
    "subtree": "Компьютеры"
  },
  {
    "id": "n3",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Самообслуживание цивилизации\nСложность: 6\nЭффект: Общество +5, Наука +1",
    "name": "Самообслуживание цивилизации",
    "req": [
      "n71"
    ],
    "next": [
      "n55"
    ],
    "title": "Для того, чтобы существовать и работать, этой цивилизации люди не нужны.",
    "x": 1205.49,
    "y": 1267,
    "lvl": 14,
    "subtree": "Импланты"
  },
  {
    "id": "n4",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Энергия гиперпространства\nСложность: 4, экзотматерия (1)\nЭффект: Наука +5",
    "name": "Энергия гиперпространства",
    "req": [
      "n9"
    ],
    "next": [
      "n44"
    ],
    "title": null,
    "x": 44.58,
    "y": 899,
    "lvl": 10,
    "subtree": "Физика пространства"
  },
  {
    "id": "n5",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Гиперволны\nСложность: 5\nЭффект: Наука +5",
    "name": "Гиперволны",
    "req": [
      "n128"
    ],
    "next": [
      "n39",
      "n105"
    ],
    "title": null,
    "x": 44.58,
    "y": 1175,
    "lvl": 13,
    "subtree": "Физика пространства"
  },
  {
    "id": "n6",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Синтезатор стазокерамики\nСложность: 4\nЭффект: Стазокерамика +1",
    "name": "Синтезатор стазокерамики",
    "req": [
      "n9"
    ],
    "next": [
      "n68"
    ],
    "title": null,
    "x": -245.17,
    "y": 899,
    "lvl": 10,
    "subtree": "Физика пространства"
  },
  {
    "id": "n7",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Машинная телепатия\nСложность: 5\nЭффект: Шпионаж +5, Контршпионаж +5",
    "name": "Машинная телепатия",
    "req": [
      "n8"
    ],
    "next": [
      "n74",
      "n59"
    ],
    "title": null,
    "x": 1205.49,
    "y": 991,
    "lvl": 11,
    "subtree": "Импланты"
  },
  {
    "id": "n8",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Расшифровка структуры мозга\nСложность: 4, осуждение (4)\nЭффект: Наука +4, Хром +2",
    "name": "Расшифровка структуры мозга",
    "req": [
      "n80"
    ],
    "next": [
      "n7",
      "n72"
    ],
    "title": null,
    "x": 1205.49,
    "y": 899,
    "lvl": 10,
    "subtree": "Импланты"
  },
  {
    "id": "n9",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Аномальные топологии\nСложность: 4, аномалия (1)\nЭффект:  +6 кубов к ветке\n\"Физика пространства\", Скорость FTL +2",
    "name": "Аномальные топологии",
    "req": [
      "n81"
    ],
    "next": [
      "n6",
      "n4"
    ],
    "title": null,
    "x": 44.58,
    "y": 807,
    "lvl": 9,
    "subtree": "Физика пространства"
  },
  {
    "id": "n10",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Планковская слизь\nСложность: 400\nЭффект: победа",
    "name": "Планковская слизь",
    "req": [
      "n103"
    ],
    "next": [],
    "title": "\"Световой конус Власти… Волна реструктуризации пространства на уровне планковских длин.\nЕдинственный способ ее остановить - единовременно свернуть в Сингулярность уже преобразованное пространство. \nНа начальном этапе для этого достаточно энергии одной батарейки. \nЧерез месяц - энергии сверхновой. Через год для этого потребуется... аннигиляция всей массы Галактики\"",
    "x": 44.58,
    "y": 1451,
    "lvl": 16,
    "subtree": "Физика пространства"
  },
  {
    "id": "n11",
    "type": "fatarrow",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Лазер\nСложность: 1, базовое\nЭффект: Атака 2",
    "name": "Лазер",
    "req": [],
    "next": [],
    "title": null,
    "x": -245.17,
    "y": 72,
    "lvl": 1,
    "subtree": "Физика пространства"
  },
  {
    "id": "n12",
    "type": "octagon",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Роботы с ДУ\nСложность: 2\nЭффект: пехота,\n 1 слот, роботы, ДУ",
    "name": "Роботы с ДУ",
    "req": [
      "n100"
    ],
    "next": [],
    "title": null,
    "x": 919.22,
    "y": 72,
    "lvl": 1,
    "subtree": "Компьютеры"
  },
  {
    "id": "n13",
    "type": "octagon",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Дроиды\nСложность: 3\nЭффект: пехота, \n2 слота, роботы",
    "name": "Дроиды",
    "req": [
      "n91"
    ],
    "next": [],
    "title": null,
    "x": 338.76,
    "y": 439,
    "lvl": 5,
    "subtree": "Физика пространства"
  },
  {
    "id": "n14",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Клиника имплантов\nСложность: 2, осуждение(2)\nЭффект: Общество +2, Хром +1",
    "name": "Клиника имплантов",
    "req": [
      "n95"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 347,
    "lvl": 4,
    "subtree": "Импланты"
  },
  {
    "id": "n15",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Малоинвазивные методики\nСложность: 3, редкие металлы (1)\nЭффект: +6 к ветке \"Импланты\"",
    "name": "Малоинвазивные методики",
    "req": [
      "n86"
    ],
    "next": [
      "n82"
    ],
    "title": null,
    "x": 1205.49,
    "y": 531,
    "lvl": 6,
    "subtree": "Импланты"
  },
  {
    "id": "n16",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Физика бран\nСложность: 3\nЭффект: Наука +3",
    "name": "Физика бран",
    "req": [
      "n69"
    ],
    "next": [
      "n81",
      "n116"
    ],
    "title": null,
    "x": 44.58,
    "y": 623,
    "lvl": 7,
    "subtree": "Физика пространства"
  },
  {
    "id": "n33",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Лимб\nСложность: 6, осуждение (6)\nЭффект: Общество +6, Хром +3",
    "name": "Лимб",
    "req": [
      "n41"
    ],
    "next": [],
    "title": "Некоторые эксперименты в реальной, кхм, реальности тяжеловато даются даже цивилизациям второго типа. Особенно это касается теологических экспериментов.",
    "x": 1495.24,
    "y": 1359,
    "lvl": 15,
    "subtree": "Импланты"
  },
  {
    "id": "n34",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Предел Бремерманна\nСложность: 6\nЭффект: Наука +6",
    "name": "Предел Бремерманна",
    "req": [
      "n60"
    ],
    "next": [],
    "title": "максимальная скорость вычислений  \nв материальной вселенной",
    "x": 919.22,
    "y": 1451,
    "lvl": 16,
    "subtree": "Компьютеры"
  },
  {
    "id": "n35",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#000000",
    "fullText": "Адаптивное производство\nСложность: 1\nЭффект: Производство +1",
    "name": "Адаптивное производство",
    "req": [
      "n58"
    ],
    "next": [
      "n107"
    ],
    "title": null,
    "x": 1495.24,
    "y": 163,
    "lvl": 2,
    "subtree": "Импланты"
  },
  {
    "id": "n36",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Импульсные мавропроцессоры\nСложность: 5, \nтех. Управление гравитацией\nЭффект: Наука +5",
    "name": "Импульсные мавропроцессоры",
    "req": [
      "n73"
    ],
    "next": [],
    "title": "Компьютинг на горизонте событий удивительно эффективен\nhttps://www.popularmechanics.com/space/deep-space/a42874313/black-holes-aliens-quantum-computers/",
    "x": 919.22,
    "y": 1083,
    "lvl": 12,
    "subtree": "Компьютеры"
  },
  {
    "id": "n37",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Трансцендентный ИИ\nСложность: 6\nЭффект: Наука +6",
    "name": "Трансцендентный ИИ",
    "req": [
      "n60"
    ],
    "next": [],
    "title": "Вы же знаете что делаете, правда?",
    "x": 632.95,
    "y": 1451,
    "lvl": 16,
    "subtree": "Компьютеры"
  },
  {
    "id": "n38",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Экранирование имплантов\nСложность: 3, осуждение(3)\nЭффект: Сверхадаптация +1, :защита\nот ЭМ-излучения и радиации, Хром +2",
    "name": "Экранирование имплантов",
    "req": [
      "n86"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 531,
    "lvl": 6,
    "subtree": "Импланты"
  },
  {
    "id": "n39",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Произвольное искривление\nСложность: 6\nЭффект: Производство +6",
    "name": "Произвольное искривление",
    "req": [
      "n5"
    ],
    "next": [
      "n109",
      "n0",
      "n103"
    ],
    "title": null,
    "x": 44.58,
    "y": 1267,
    "lvl": 14,
    "subtree": "Физика пространства"
  },
  {
    "id": "n40",
    "type": "parallelogram2",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Подкожные скафандры\nСложность: 2, осуждение(2)\nЭффект: Адаптация +2, Хром +1",
    "name": "Подкожные скафандры",
    "req": [
      "n88"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 439,
    "lvl": 5,
    "subtree": "Импланты"
  },
  {
    "id": "n41",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Мёртвые души\nСложность: 6, осуждение (6)\nЭффект: разово 1 великий человек-ИИ,\nХром +3",
    "name": "Мёртвые души",
    "req": [
      "n71"
    ],
    "next": [
      "n33"
    ],
    "title": "Гоголы? Где?",
    "x": 1495.24,
    "y": 1267,
    "lvl": 14,
    "subtree": "Импланты"
  },
  {
    "id": "n42",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Туманные вычисления\nСложность: 1\nЭффект: Наука +1",
    "name": "Туманные вычисления",
    "req": [
      "n58"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 72,
    "lvl": 1,
    "subtree": "Импланты"
  },
  {
    "id": "n43",
    "type": "trapezoid2",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Генератор червоточин\nСложность: 6\nЭффект: Двигатель 4, FTL, \n:FTL через червоточины",
    "name": "Генератор червоточин",
    "req": [
      "n44"
    ],
    "next": [],
    "title": null,
    "x": 335.28,
    "y": 1083,
    "lvl": 12,
    "subtree": "Физика пространства"
  },
  {
    "id": "n44",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Управление гравитацией\nСложность: 5, экзотическая материя (1)\nЭффект: +3 свободных куба",
    "name": "Управление гравитацией",
    "req": [
      "n4"
    ],
    "next": [
      "n43",
      "n1",
      "n128"
    ],
    "title": null,
    "x": 44.58,
    "y": 991,
    "lvl": 11,
    "subtree": "Физика пространства"
  },
  {
    "id": "n45",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Научная лаборатория\nСложность: 1\nЭффект: Наука +1",
    "name": "Научная лаборатория",
    "req": [
      "n100"
    ],
    "next": [
      "n111"
    ],
    "title": null,
    "x": 338.76,
    "y": 72,
    "lvl": 1,
    "subtree": "Физика пространства"
  },
  {
    "id": "n46",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Клиника нанохирургии\nСложность: 4\nЭффект: Общество +4",
    "name": "Клиника нанохирургии",
    "req": [
      "n78"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 807,
    "lvl": 9,
    "subtree": "Импланты"
  },
  {
    "id": "n47",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Наноудобрения\nСложность: 4\nЭффект: :устраняет любые\nусловия плохой почвы",
    "name": "Наноудобрения",
    "req": [
      "n82"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 715,
    "lvl": 8,
    "subtree": "Импланты"
  },
  {
    "id": "n48",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Экзокортекс\nСложность: 3, приз\nЭффект: +2 свободных куба",
    "name": "Экзокортекс",
    "req": [
      "n83"
    ],
    "next": [],
    "title": null,
    "x": 919.22,
    "y": 623,
    "lvl": 7,
    "subtree": "Компьютеры"
  },
  {
    "id": "n49",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Сильный ИИ\nСложность: 4, осуждение (4)\nЭффект: +2 свободных куба, Хром +2",
    "name": "Сильный ИИ",
    "req": [
      "n79"
    ],
    "next": [
      "n73",
      "n112"
    ],
    "title": "\"Cogito. Ergo sum.\"\n - Первые слова ИИ \"Голем\"",
    "x": 632.95,
    "y": 899,
    "lvl": 10,
    "subtree": "Компьютеры"
  },
  {
    "id": "n50",
    "type": "trapezoid2",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Струнный магнит\nСложность: 2, аномалия(4)\nЭффект: Двигатель 3, FTL, \n:FTL вдоль суперструн",
    "name": "Струнный магнит",
    "req": [
      "n89"
    ],
    "next": [],
    "title": null,
    "x": -245.17,
    "y": 439,
    "lvl": 5,
    "subtree": "Физика пространства"
  },
  {
    "id": "n54",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Ускоритель частиц\nСложность: 2, сталь (1)\nЭффект: Наука +2",
    "name": "Ускоритель частиц",
    "req": [
      "n97"
    ],
    "next": [],
    "title": null,
    "x": -245.17,
    "y": 347,
    "lvl": 4,
    "subtree": "Физика пространства"
  },
  {
    "id": "n55",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Всеобщее цифровое бессмертие\nСложность: 6\nЭффект: Общество +6",
    "name": "Всеобщее цифровое бессмертие",
    "req": [
      "n66",
      "n3"
    ],
    "next": [
      "n119",
      "n122"
    ],
    "title": null,
    "x": 1205.49,
    "y": 1359,
    "lvl": 15,
    "subtree": "Импланты"
  },
  {
    "id": "n56",
    "type": "ellipse",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Лагранжевы телескопы\nСложность: 2, тех. Освоение орбиты\nЭффект: Ветвь \"Физика пространства\" +4,\n:исследование соседних ЗС",
    "name": "Лагранжевы телескопы",
    "req": [
      "n92"
    ],
    "next": [],
    "title": "для звездных систем в радиусе 4 гексов позволяет бросить плотность системы, тип, орбиту и аномалию пригодной для колонизации планеты",
    "x": 339.72,
    "y": 347,
    "lvl": 4,
    "subtree": "Физика пространства"
  },
  {
    "id": "n57",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Обсерватория\nСложность: 1\nЭффект: Наука +1",
    "name": "Обсерватория",
    "req": [
      "n101"
    ],
    "next": [
      "n93"
    ],
    "title": "оценка количества и типа планет",
    "x": -245.17,
    "y": 163,
    "lvl": 2,
    "subtree": "Физика пространства"
  },
  {
    "id": "n58",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#000000",
    "fullText": "Умное окружение\nСложность: 1\nЭффект: Производство +1",
    "name": "Умное окружение",
    "req": [],
    "next": [
      "n98",
      "n42",
      "n35",
      "n114"
    ],
    "title": null,
    "x": 1205.49,
    "y": 72,
    "lvl": 1,
    "subtree": "Импланты"
  },
  {
    "id": "n59",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Полное телеприсутствие\nСложность: 5, любая тех. FTL\nЭффект: +2 свободных куба,\nНаука +1",
    "name": "Полное телеприсутствие",
    "req": [
      "n7"
    ],
    "next": [],
    "title": "Реально полное. И возможность отвесить подзатыльник на расстоянии в десяток парсеков.",
    "x": 1495.24,
    "y": 1083,
    "lvl": 12,
    "subtree": "Импланты"
  },
  {
    "id": "n60",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Вычислительные потребности\nСложность: 6, сталь (2)\nЭффект: Астроинженерия +10",
    "name": "Вычислительные потребности",
    "req": [
      "n65"
    ],
    "next": [
      "n37",
      "n34",
      "n127"
    ],
    "title": null,
    "x": 632.95,
    "y": 1359,
    "lvl": 15,
    "subtree": "Компьютеры"
  },
  {
    "id": "n61",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Реактор термоядерного синтеза\nСложность: 3, сталь (2)\nЭффект: Производство +3",
    "name": "Реактор термоядерного синтеза",
    "req": [
      "n87"
    ],
    "next": [
      "n115"
    ],
    "title": null,
    "x": -245.17,
    "y": 531,
    "lvl": 6,
    "subtree": "Физика пространства"
  },
  {
    "id": "n62",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Завод субатомных транзисторов\nСложность: 3\nЭффект: Наука +3",
    "name": "Завод субатомных транзисторов",
    "req": [
      "n87"
    ],
    "next": [
      "n75",
      "n108"
    ],
    "title": null,
    "x": 338.76,
    "y": 531,
    "lvl": 6,
    "subtree": "Физика пространства"
  },
  {
    "id": "n63",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Совместное мышление\nСложность: 5, осуждение (5)\nЭффект: +3 очка распределения армиям\nи флотам",
    "name": "Совместное мышление",
    "req": [
      "n74"
    ],
    "next": [],
    "title": "Свободный и мгновенный доступ к мыслям и размышлениям всех остальных через нейроинтерфейсы; небывалое чувство общности и взаимопонимания. Как-то так это всё описывают.",
    "x": 1495.24,
    "y": 1175,
    "lvl": 13,
    "subtree": "Импланты"
  },
  {
    "id": "n64",
    "type": "trapezoid2",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Варп-двигатель\nСложность: 4, экзотматерия (1)\nЭффект: Двигатель 3, FTL, \n:произвольный FTL",
    "name": "Варп-двигатель",
    "req": [
      "n76"
    ],
    "next": [],
    "title": null,
    "x": 335.28,
    "y": 991,
    "lvl": 11,
    "subtree": "Физика пространства"
  },
  {
    "id": "n65",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Симуляция вселенной\nСложность: 6\nЭффект: +12 очков распределения для флота",
    "name": "Симуляция вселенной",
    "req": [
      "n67"
    ],
    "next": [
      "n60"
    ],
    "title": null,
    "x": 632.95,
    "y": 1267,
    "lvl": 14,
    "subtree": "Компьютеры"
  },
  {
    "id": "n66",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Человек Виртуальный\nСложность: 6\nЭффект: Общество +6",
    "name": "Человек Виртуальный",
    "req": [
      "n67",
      "n71"
    ],
    "next": [
      "n55",
      "n121"
    ],
    "title": "На данном этапе есть все технические возможности для жизни человека в одной только виртуальной вселенной, отдельно от любого тела, кроме компьютерных суперкластеров.",
    "x": 919.22,
    "y": 1267,
    "lvl": 14,
    "subtree": "Компьютеры"
  },
  {
    "id": "n67",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Суперкомпьютерное облако\nСложность: 5\nЭффект: Наука +5",
    "name": "Суперкомпьютерное облако",
    "req": [
      "n70"
    ],
    "next": [
      "n65",
      "n66",
      "n104"
    ],
    "title": null,
    "x": 632.95,
    "y": 1175,
    "lvl": 13,
    "subtree": "Компьютеры"
  },
  {
    "id": "n68",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Структурные поля\nСложность: 5, \nэкзотическая материя (1)\nЭффект: Производство +5",
    "name": "Структурные поля",
    "req": [
      "n6"
    ],
    "next": [
      "n1"
    ],
    "title": "Укрепление структуры объектов внутренними силовыми полями",
    "x": -245.17,
    "y": 991,
    "lvl": 11,
    "subtree": "Физика пространства"
  },
  {
    "id": "n69",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Завод наноматериалов\nСложность: 3\nЭффект: Наноматериалы +1, \nНаука +1",
    "name": "Завод наноматериалов",
    "req": [
      "n87"
    ],
    "next": [
      "n16"
    ],
    "title": null,
    "x": 44.58,
    "y": 531,
    "lvl": 6,
    "subtree": "Физика пространства"
  },
  {
    "id": "n70",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Компьютроний\nСложность: 5, экзотическая материя (1)\nЭффект: Наука +4, Общество +1",
    "name": "Компьютроний",
    "req": [
      "n73"
    ],
    "next": [
      "n67",
      "n106"
    ],
    "title": "Он функционирует на основе квантовой механики на фемтомасштабе, позволяя использовать максимальную вычислительную мощность на единицу пространства.",
    "x": 632.95,
    "y": 1083,
    "lvl": 12,
    "subtree": "Компьютеры"
  },
  {
    "id": "n71",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Копирование разума\nСложность: 5, осуждение (5)\nЭффект: Общество +5, Хром +3",
    "name": "Копирование разума",
    "req": [
      "n74"
    ],
    "next": [
      "n66",
      "n3",
      "n41"
    ],
    "title": null,
    "x": 1205.49,
    "y": 1175,
    "lvl": 13,
    "subtree": "Импланты"
  },
  {
    "id": "n72",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Искусственное тело\nСложность: 5, осуждение (5)\nЭффект: Сверхадаптация +2,\n:замена биологического тела, Хром +3",
    "name": "Искусственное тело",
    "req": [
      "n8"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 991,
    "lvl": 11,
    "subtree": "Импланты"
  },
  {
    "id": "n73",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Ансибл-процессоры\nСложность: 5\nЭффект: Производство +5",
    "name": "Ансибл-процессоры",
    "req": [
      "n76",
      "n49"
    ],
    "next": [
      "n70",
      "n36"
    ],
    "title": null,
    "x": 632.95,
    "y": 991,
    "lvl": 11,
    "subtree": "Компьютеры"
  },
  {
    "id": "n74",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Перестройка мозга\nСложность: 5, осуждение (5)\nЭффект: Наука +5, Хром +3",
    "name": "Перестройка мозга",
    "req": [
      "n7"
    ],
    "next": [
      "n63",
      "n71"
    ],
    "title": null,
    "x": 1205.49,
    "y": 1083,
    "lvl": 12,
    "subtree": "Импланты"
  },
  {
    "id": "n75",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Нанокомпьютеры\nСложность: 3\nЭффект: Общество +3",
    "name": "Нанокомпьютеры",
    "req": [
      "n62",
      "n84"
    ],
    "next": [
      "n2",
      "n126"
    ],
    "title": null,
    "x": 632.95,
    "y": 623,
    "lvl": 7,
    "subtree": "Компьютеры"
  },
  {
    "id": "n76",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Ансибль\nСложность: 4, экзотматерия (1)\nЭффект: :обеспечивает \nсверхсветовую связь",
    "name": "Ансибль",
    "req": [
      "n77"
    ],
    "next": [
      "n64",
      "n73"
    ],
    "title": null,
    "x": 335.28,
    "y": 899,
    "lvl": 10,
    "subtree": "Физика пространства"
  },
  {
    "id": "n77",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Экзотматерия\nСложность: 4, специалисты(1)\nЭффект: Экзотматерия +1",
    "name": "Экзотматерия",
    "req": [
      "n81"
    ],
    "next": [
      "n76"
    ],
    "title": null,
    "x": 335.28,
    "y": 807,
    "lvl": 9,
    "subtree": "Физика пространства"
  },
  {
    "id": "n78",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Медицинские наномашины\nСложность: 4\nЭффект: Общество +4, Хром +2",
    "name": "Медицинские наномашины",
    "req": [
      "n82"
    ],
    "next": [
      "n80",
      "n46"
    ],
    "title": null,
    "x": 1205.49,
    "y": 715,
    "lvl": 8,
    "subtree": "Импланты"
  },
  {
    "id": "n79",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Многомерные вычисления\nСложность: 4\nЭффект: Наука +4",
    "name": "Многомерные вычисления",
    "req": [
      "n2"
    ],
    "next": [
      "n49"
    ],
    "title": null,
    "x": 632.95,
    "y": 807,
    "lvl": 9,
    "subtree": "Компьютеры"
  },
  {
    "id": "n80",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Нанитные улучшения организма\nСложность: 4, осуждение (4)\nЭффект: Производство +1,\nСверхадаптация +1, Регенерация +1, Хром +2",
    "name": "Нанитные улучшения организма",
    "req": [
      "n78"
    ],
    "next": [
      "n8",
      "n118",
      "n123"
    ],
    "title": null,
    "x": 1205.49,
    "y": 807,
    "lvl": 9,
    "subtree": "Импланты"
  },
  {
    "id": "n81",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Многомерная физика\nСложность: 4\nЭффект: Наука +4",
    "name": "Многомерная физика",
    "req": [
      "n16"
    ],
    "next": [
      "n77",
      "n9"
    ],
    "title": null,
    "x": 44.58,
    "y": 715,
    "lvl": 8,
    "subtree": "Физика пространства"
  },
  {
    "id": "n82",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Нанороботы\nСложность: 3, наноматериалы (1)\nЭффект: Производство +3",
    "name": "Нанороботы",
    "req": [
      "n15"
    ],
    "next": [
      "n78",
      "n47"
    ],
    "title": null,
    "x": 1205.49,
    "y": 623,
    "lvl": 7,
    "subtree": "Импланты"
  },
  {
    "id": "n83",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Когнитивные расширители\nСложность: 3, осуждение (3)\nЭффект: Игнорирование критпровала\n(Компьютеры), Хром +2",
    "name": "Когнитивные расширители",
    "req": [
      "n85"
    ],
    "next": [
      "n48"
    ],
    "title": null,
    "x": 919.22,
    "y": 531,
    "lvl": 6,
    "subtree": "Компьютеры"
  },
  {
    "id": "n84",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Софогенез\nСложность: 3\nЭффект: Наука +3,\nразово бесплатная технология",
    "name": "Софогенез",
    "req": [
      "n90"
    ],
    "next": [
      "n75"
    ],
    "title": null,
    "x": 632.95,
    "y": 531,
    "lvl": 6,
    "subtree": "Компьютеры"
  },
  {
    "id": "n85",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Контекстная память\nСложность: 2\nЭффект: +4 куба к ветке \"Социология\"",
    "name": "Контекстная память",
    "req": [
      "n94"
    ],
    "next": [
      "n83"
    ],
    "title": null,
    "x": 919.22,
    "y": 439,
    "lvl": 5,
    "subtree": "Компьютеры"
  },
  {
    "id": "n86",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Автономность имплантатов\nСложность: 2, редкие металлы (1)\nЭффект: Производство +1, \nРезерв +1",
    "name": "Автономность имплантатов",
    "req": [
      "n88"
    ],
    "next": [
      "n38",
      "n15"
    ],
    "title": null,
    "x": 1205.49,
    "y": 439,
    "lvl": 5,
    "subtree": "Импланты"
  },
  {
    "id": "n87",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Физика элементарных частиц\nСложность: 2\nЭффект: +4 куба к ветке\n\"Физика пространства\"",
    "name": "Физика элементарных частиц",
    "req": [
      "n89"
    ],
    "next": [
      "n62",
      "n61",
      "n69"
    ],
    "title": null,
    "x": 44.58,
    "y": 439,
    "lvl": 5,
    "subtree": "Физика пространства"
  },
  {
    "id": "n88",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Искусственные органы\nСложность: 2\nЭффект: +1 свободный куб",
    "name": "Искусственные органы",
    "req": [
      "n95"
    ],
    "next": [
      "n86",
      "n40"
    ],
    "title": null,
    "x": 1205.49,
    "y": 347,
    "lvl": 4,
    "subtree": "Импланты"
  },
  {
    "id": "n89",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Анализ несоответствий\nСложность: 2\nЭффект: Наука +2",
    "name": "Анализ несоответствий",
    "req": [
      "n97"
    ],
    "next": [
      "n87",
      "n50"
    ],
    "title": null,
    "x": 44.58,
    "y": 347,
    "lvl": 4,
    "subtree": "Физика пространства"
  },
  {
    "id": "n90",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Компактные квантовые процессоры\nСложность: 2\nЭффект: Наука +2",
    "name": "Компактные квантовые процессоры",
    "req": [
      "n91"
    ],
    "next": [
      "n84"
    ],
    "title": "Эффект, названный \"квантовой волной\", обладал поразительной способностью создавать \"устойчивые когеренты\", квантовые системы, способные избегать\nдекогеренции даже при достаточно серьезном внешнем воздействии, раз за разом возвращаясь в запутанное состояние. Принцип их действия был \nне вполне понятен, но воспроизводимость несомненна. \n\nОткрытие \"устойчивых когерентов\" было очевидным ключом к созданию стабильных и массовых квантовых процессоров. \nЭти устройства представляли собой сложнейшие системы наноструктур, между которыми бурлила самоорганизующаяся квантовая пена. \nИ задачи, которые ранее требовали годы исследований и тысячи суперкомпьютеров, теперь решались за считаные секунды. \nХотя список этих задач был специфичен - в первую очередь то самое вычисление протеинов и решение всяких проблем коммивояжера - \nэто принесло и принесет огромную пользу колонии.",
    "x": 632.95,
    "y": 439,
    "lvl": 5,
    "subtree": "Компьютеры"
  },
  {
    "id": "n91",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Самообучение\nСложность: 2\nЭффект: +4 куба к ветке \"Компьютеры\"",
    "name": "Самообучение",
    "req": [
      "n96"
    ],
    "next": [
      "n90",
      "n13"
    ],
    "title": null,
    "x": 632.95,
    "y": 347,
    "lvl": 4,
    "subtree": "Компьютеры"
  },
  {
    "id": "n92",
    "type": "ellipse",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Космические телескопы\nСложность: 1, тех. Пусковые технологии\nЭффект: Наука +1",
    "name": "Космические телескопы",
    "req": [
      "n99",
      "n102"
    ],
    "next": [
      "n56"
    ],
    "title": null,
    "x": 339.72,
    "y": 255,
    "lvl": 3,
    "subtree": "Физика пространства"
  },
  {
    "id": "n93",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Звёдные карты\nСложность: 1\nЭффект: :открывает координаты Солнца",
    "name": "Звёдные карты",
    "req": [
      "n57"
    ],
    "next": [],
    "title": null,
    "x": -245.17,
    "y": 255,
    "lvl": 3,
    "subtree": "Физика пространства"
  },
  {
    "id": "n94",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Нейроинтерфейсы\nСложность: 2\nЭффект:  +4 куба к ветке \"Компьютеры\"",
    "name": "Нейроинтерфейсы",
    "req": [
      "n95",
      "n96"
    ],
    "next": [
      "n85"
    ],
    "title": null,
    "x": 919.22,
    "y": 347,
    "lvl": 4,
    "subtree": "Компьютеры"
  },
  {
    "id": "n95",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#000000",
    "fullText": "Импланты\nСложность: 1\nЭффект: Производство +1",
    "name": "Импланты",
    "req": [
      "n98"
    ],
    "next": [
      "n88",
      "n94",
      "n14"
    ],
    "title": null,
    "x": 1205.49,
    "y": 255,
    "lvl": 3,
    "subtree": "Импланты"
  },
  {
    "id": "n96",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Миниатюризация\nСложность: 1\nЭффект: Производство +1",
    "name": "Миниатюризация",
    "req": [
      "n99"
    ],
    "next": [
      "n91",
      "n94"
    ],
    "title": null,
    "x": 632.95,
    "y": 255,
    "lvl": 3,
    "subtree": "Компьютеры"
  },
  {
    "id": "n97",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Анализ данных о межзвёздной среде\nСложность: 1\nЭффект: Создание флотов +2",
    "name": "Анализ данных о межзвёздной среде",
    "req": [
      "n102"
    ],
    "next": [
      "n89",
      "n54"
    ],
    "title": null,
    "x": 44.58,
    "y": 255,
    "lvl": 3,
    "subtree": "Физика пространства"
  },
  {
    "id": "n98",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#000000",
    "fullText": "Бионика\nСложность: 1\nЭффект: Устранение\nпоследствий +2",
    "name": "Бионика",
    "req": [
      "n58"
    ],
    "next": [
      "n95"
    ],
    "title": null,
    "x": 1205.49,
    "y": 163,
    "lvl": 2,
    "subtree": "Импланты"
  },
  {
    "id": "n99",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Новые типы компьютеров\nСложность: 1\nЭффект: Наука +1",
    "name": "Новые типы компьютеров",
    "req": [
      "n100"
    ],
    "next": [
      "n96",
      "n92",
      "n113"
    ],
    "title": null,
    "x": 632.95,
    "y": 163,
    "lvl": 2,
    "subtree": "Компьютеры"
  },
  {
    "id": "n100",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#000000",
    "fullText": "Колониальная сеть\nСложность: 1\nЭффект: Общество +1",
    "name": "Колониальная сеть",
    "req": [],
    "next": [
      "n99",
      "n45",
      "n114",
      "n12"
    ],
    "title": null,
    "x": 632.95,
    "y": 72,
    "lvl": 1,
    "subtree": "Компьютеры"
  },
  {
    "id": "n101",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#000000",
    "fullText": "Постземная астрономия\nСложность: 1\nЭффект: Наука +1,\n:изучение своей звёздной системы",
    "name": "Постземная астрономия",
    "req": [],
    "next": [
      "n102",
      "n57",
      "n111"
    ],
    "title": null,
    "x": 44.58,
    "y": 72,
    "lvl": 1,
    "subtree": "Физика пространства"
  },
  {
    "id": "n102",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Анализ космических лучей\nСложность: 1\nЭффект: Наука +1",
    "name": "Анализ космических лучей",
    "req": [
      "n101"
    ],
    "next": [
      "n97",
      "n92"
    ],
    "title": null,
    "x": 44.58,
    "y": 163,
    "lvl": 2,
    "subtree": "Физика пространства"
  },
  {
    "id": "n103",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Субкварковые манипуляции\nСложность: 6\nЭффект: Наука +6",
    "name": "Субкварковые манипуляции",
    "req": [
      "n39"
    ],
    "next": [
      "n10",
      "n127"
    ],
    "title": null,
    "x": 44.58,
    "y": 1359,
    "lvl": 15,
    "subtree": "Физика пространства"
  },
  {
    "id": "n104",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Теория немыслимого\nСложность: 6\nЭффект: Аномалия +5, :можно определить\nцель прыжка через Врата Переброски",
    "name": "Теория немыслимого",
    "req": [
      "n67"
    ],
    "next": [],
    "title": null,
    "x": 334.33,
    "y": 1267,
    "lvl": 14,
    "subtree": "Физика пространства"
  },
  {
    "id": "n105",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Гиперплазма\nСложность: 6, специалисты(2)\nЭффект: Гиперплазма +1",
    "name": "Гиперплазма",
    "req": [
      "n5"
    ],
    "next": [
      "n109"
    ],
    "title": null,
    "x": -245.88,
    "y": 1267,
    "lvl": 14,
    "subtree": "Физика пространства"
  },
  {
    "id": "n106",
    "type": "hexagon",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Мозг-Юпитер\nСложность: 30\nЭффект: Наука +30",
    "name": "Мозг-Юпитер",
    "req": [
      "n70"
    ],
    "next": [],
    "title": "Скорее мозг-Меркурий, но суть вы уловили",
    "x": 919.22,
    "y": 1175,
    "lvl": 13,
    "subtree": "Компьютеры"
  },
  {
    "id": "n107",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#000000",
    "fullText": "Интеллектуальная энергосистема\nСложность: 1\nЭффект: Производство +1",
    "name": "Интеллектуальная энергосистема",
    "req": [
      "n35"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 255,
    "lvl": 3,
    "subtree": "Импланты"
  },
  {
    "id": "n108",
    "type": "trapezoid2",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Корабельные лаборатории\nСложность: 3, 2 слота\nЭффект: Наука +3,\n:на планете прописки",
    "name": "Корабельные лаборатории",
    "req": [
      "n62"
    ],
    "next": [],
    "title": null,
    "x": 338.76,
    "y": 623,
    "lvl": 7,
    "subtree": "Физика пространства"
  },
  {
    "id": "n109",
    "type": "hexagon",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Струноукладчик\nСложность: 200\nЭффект: :позволяет создавать \nсуперструны до 15 парсек длиной",
    "name": "Струноукладчик",
    "req": [
      "n39",
      "n105"
    ],
    "next": [
      "n110"
    ],
    "title": "А также уничтожать струны не больше этой длины. Но - тссс!",
    "x": -245.88,
    "y": 1359,
    "lvl": 15,
    "subtree": "Физика пространства"
  },
  {
    "id": "n110",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Струностроительство\nСложность: 6\nЭффект: :утраивает максимум \nдлины суперструн струноукладчика",
    "name": "Струностроительство",
    "req": [
      "n109"
    ],
    "next": [],
    "title": null,
    "x": -245.88,
    "y": 1451,
    "lvl": 16,
    "subtree": "Физика пространства"
  },
  {
    "id": "n111",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Институт физики пространства\nСложность: 1\nЭффект: +2 куба к ветке\n\"Физика пространства\"",
    "name": "Институт физики пространства",
    "req": [
      "n101",
      "n45"
    ],
    "next": [],
    "title": null,
    "x": 338.76,
    "y": 163,
    "lvl": 2,
    "subtree": "Физика пространства"
  },
  {
    "id": "n112",
    "type": "octagon",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Киберкоммандос\nСложность: 5\nЭффект: пехота, 4 слота, \nроботы, ужас",
    "name": "Киберкоммандос",
    "req": [
      "n49"
    ],
    "next": [],
    "title": null,
    "x": 919.22,
    "y": 991,
    "lvl": 11,
    "subtree": "Компьютеры"
  },
  {
    "id": "n113",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#000000",
    "fullText": "Дополненная реальность\nСложность: 1\nЭффект: Наука +1",
    "name": "Дополненная реальность",
    "req": [
      "n99"
    ],
    "next": [],
    "title": null,
    "x": 919.22,
    "y": 255,
    "lvl": 3,
    "subtree": "Компьютеры"
  },
  {
    "id": "n114",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Станция кибергорничных\nСложность: 1\nЭффект: +1 свободный куб",
    "name": "Станция кибергорничных",
    "req": [
      "n100",
      "n58"
    ],
    "next": [],
    "title": null,
    "x": 919.22,
    "y": 163,
    "lvl": 2,
    "subtree": "Компьютеры"
  },
  {
    "id": "n115",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Генератор антиматерии\nСложность: 3\nЭффект: Антиматерия +1",
    "name": "Генератор антиматерии",
    "req": [
      "n61"
    ],
    "next": [
      "n120"
    ],
    "title": null,
    "x": -245.17,
    "y": 623,
    "lvl": 7,
    "subtree": "Физика пространства"
  },
  {
    "id": "n116",
    "type": "ellipse",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Врата р-переброски\nСложность: 4, аномалия(1)\nЭффект: :случайная переброска к\nпригодной для жизни ЗС",
    "name": "Врата р-переброски",
    "req": [
      "n16"
    ],
    "next": [],
    "title": null,
    "x": 338.76,
    "y": 715,
    "lvl": 8,
    "subtree": "Физика пространства"
  },
  {
    "id": "n117",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Реактор гиперпространства\nСложность: 5, экзотическая материя (1)\nЭффект: Производство +5",
    "name": "Реактор гиперпространства",
    "req": [
      "n128"
    ],
    "next": [],
    "title": null,
    "x": 335.28,
    "y": 1175,
    "lvl": 13,
    "subtree": "Физика пространства"
  },
  {
    "id": "n118",
    "type": "fatarrow",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Живой металл\nСложность: 4\nЭффект: Регенерация +3",
    "name": "Живой металл",
    "req": [
      "n80"
    ],
    "next": [],
    "title": null,
    "x": 1495.24,
    "y": 899,
    "lvl": 10,
    "subtree": "Импланты"
  },
  {
    "id": "n119",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Цифровой рай\nСложность: 6, :повторяемо\nЭффект: Общество +6",
    "name": "Цифровой рай",
    "req": [
      "n55"
    ],
    "next": [],
    "title": null,
    "x": 1205.49,
    "y": 1451,
    "lvl": 16,
    "subtree": "Импланты"
  },
  {
    "id": "n120",
    "type": "trapezoid2",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Двигатель на антиматерии\nСложность: 1, антиматерия (1)\nЭффект: Двигатель 1, \nпред-FTL",
    "name": "Двигатель на антиматерии",
    "req": [
      "n115"
    ],
    "next": [],
    "title": "Теоретическая скорость 1 парсек в 5 лет;\nв реалиях игры это было бы порядка 12 ходов, \nтак что взята более осмысленная скорость - гекс в ход.",
    "x": -245.17,
    "y": 715,
    "lvl": 8,
    "subtree": "Физика пространства"
  },
  {
    "id": "n121",
    "type": "octagon",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Апостолы\nСложность: 6\nЭффект: пехота, 5 слотов, \nэкранирование",
    "name": "Апостолы",
    "req": [
      "n66"
    ],
    "next": [],
    "title": null,
    "x": 922.7,
    "y": 1359,
    "lvl": 15,
    "subtree": "Компьютеры"
  },
  {
    "id": "n122",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Полная автономность\nСложность: 6\nЭффект: :все звездолёты не имеют экипажа\nи не приносят Осуждения при потере",
    "name": "Полная автономность",
    "req": [
      "n55"
    ],
    "next": [],
    "title": "Минимальный экипаж: НОЛЬ человек",
    "x": 1495.24,
    "y": 1451,
    "lvl": 16,
    "subtree": "Импланты"
  },
  {
    "id": "n123",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Утилитарный туман\nСложность: 4, наноматериалы (1)\nЭффект: Защита колонии +2, \nОбщество +2, Контршпионаж +2",
    "name": "Утилитарный туман",
    "req": [
      "n80"
    ],
    "next": [],
    "title": null,
    "x": 919.22,
    "y": 899,
    "lvl": 10,
    "subtree": "Компьютеры"
  },
  {
    "id": "n124",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Спекулятивная материя\nСложность: 5, экзотическая материя (1)\nЭффект: Аномалия +2, \n+2 свободных куба",
    "name": "Спекулятивная материя",
    "req": [
      "n1"
    ],
    "next": [],
    "title": "\"Hypothetical particles\"",
    "x": -245.17,
    "y": 1175,
    "lvl": 13,
    "subtree": "Физика пространства"
  },
  {
    "id": "n125",
    "type": "parallelogram",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Умный город\nСложность: 4\nЭффект: Общество +4",
    "name": "Умный город",
    "req": [
      "n2"
    ],
    "next": [],
    "title": "\"На данный момент движение по ул. Козлова одностороннее. На проспекте Земли на движение к центру выделено две встречных полосы...\"",
    "x": 915.74,
    "y": 807,
    "lvl": 9,
    "subtree": "Компьютеры"
  },
  {
    "id": "n126",
    "type": "octagon",
    "treeName": "Science",
    "borderColor": "#FF0000",
    "fullText": "Супердроиды\nСложность: 4\nЭффект: пехота, 3 слота, \nроботы",
    "name": "Супердроиды",
    "req": [
      "n75"
    ],
    "next": [],
    "title": null,
    "x": 919.22,
    "y": 715,
    "lvl": 8,
    "subtree": "Компьютеры"
  },
  {
    "id": "n127",
    "type": "hexagon",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Гиперэховый хроноскоп\nСложность: 150, тех. Рой Дайсона\nЭффект: :возможность заглядывать\nв прошлое",
    "name": "Гиперэховый хроноскоп",
    "req": [
      "n103",
      "n60"
    ],
    "next": [],
    "title": "хотя для этого требуются немыслимые вычислительные ресурсы,\nвосстановления событий прошлого по эху в гиперпространстве все же возможно",
    "x": 334.33,
    "y": 1451,
    "lvl": 16,
    "subtree": "Физика пространства"
  },
  {
    "id": "n128",
    "type": "rectangle",
    "treeName": "Science",
    "borderColor": "#0000FF",
    "fullText": "Физика гиперпространства\nСложность: 5\nЭффект: Наука +4",
    "name": "Физика гиперпространства",
    "req": [
      "n44"
    ],
    "next": [
      "n5",
      "n117"
    ],
    "title": null,
    "x": 44.58,
    "y": 1083,
    "lvl": 12,
    "subtree": "Физика пространства"
  },
  {
    "id": "n0",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Опорные пункты сил самообороны\nСложность: 1\nЭффект: Защита колонии +2",
    "name": "Опорные пункты сил самообороны",
    "req": [
      "n1"
    ],
    "next": [
      "n126",
      "n5"
    ],
    "title": null,
    "x": 55,
    "y": 138,
    "lvl": 2,
    "subtree": "Наземный бой"
  },
  {
    "id": "n1",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Разведывательный корпус\nСложность: 1\nЭффект: Планетарная разведка +2",
    "name": "Разведывательный корпус",
    "req": [],
    "next": [
      "n0",
      "n79",
      "n125"
    ],
    "title": null,
    "x": 55,
    "y": 46,
    "lvl": 1,
    "subtree": "Наземный бой"
  },
  {
    "id": "n2",
    "type": "parallelogram2",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Para bellum\nСложность: 1\nЭффект: +1 свободный куб",
    "name": "Para bellum",
    "req": [],
    "next": [
      "n44",
      "n87",
      "n93",
      "n70",
      "n77"
    ],
    "title": "«Оружие несёт угнетение, хаос и смерть… но иногда оно же приносит победу»\n– Режиналду Леонардо Педро Боливар де Аленсар-Арарипе, \"Принципы современной войны\"",
    "x": 639.29,
    "y": 46,
    "lvl": 1,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n3",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Милитаризация орбиты\nСложность: 1, тех. Первичная \nорбитальная группировка\nЭффект: Создание флотов +2",
    "name": "Милитаризация орбиты",
    "req": [],
    "next": [
      "n4",
      "n75",
      "n116"
    ],
    "title": null,
    "x": 1211.83,
    "y": 46,
    "lvl": 1,
    "subtree": "Война в космосе"
  },
  {
    "id": "n4",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Авиакосмическая подготовка\nСложность: 1, тех. Мобилизация населения\nЭффект: +1 очко распределения флотам",
    "name": "Авиакосмическая подготовка",
    "req": [
      "n3"
    ],
    "next": [
      "n6",
      "n86"
    ],
    "title": null,
    "x": 1211.83,
    "y": 138,
    "lvl": 2,
    "subtree": "Война в космосе"
  },
  {
    "id": "n5",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Бронепехота\nСложность: 2, тех. Экзоскелеты\nЭффект: пехота, 3 слота,\nЗащита +1",
    "name": "Бронепехота",
    "req": [
      "n0"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 230,
    "lvl": 3,
    "subtree": "Наземный бой"
  },
  {
    "id": "n6",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Военно-космические силы\nСложность: 1\nЭффект: +1 очко распределения флотам",
    "name": "Военно-космические силы",
    "req": [
      "n4"
    ],
    "next": [
      "n9",
      "n63"
    ],
    "title": null,
    "x": 1211.83,
    "y": 230,
    "lvl": 3,
    "subtree": "Война в космосе"
  },
  {
    "id": "n7",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Массовое использование ионисторов\nСложность: 1\nЭффект: Атака +1",
    "name": "Массовое использование ионисторов",
    "req": [
      "n93"
    ],
    "next": [
      "n43",
      "n71",
      "n127"
    ],
    "title": null,
    "x": 639.29,
    "y": 230,
    "lvl": 3,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n8",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#00FF00",
    "fullText": "Постземная военная тактика\nСложность: 2\n, тех. Колониальное управление\nЭффект: Создание армий +4",
    "name": "Постземная военная тактика",
    "req": [
      "n126"
    ],
    "next": [
      "n10",
      "n17",
      "n18"
    ],
    "title": null,
    "x": 55,
    "y": 322,
    "lvl": 4,
    "subtree": "Наземный бой"
  },
  {
    "id": "n9",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Оптимизация верфей\nСложность: 2, тех. Пусковые технологии\nЭффект: Создание флотов +4",
    "name": "Оптимизация верфей",
    "req": [
      "n6"
    ],
    "next": [
      "n11",
      "n34"
    ],
    "title": null,
    "x": 1211.83,
    "y": 322,
    "lvl": 4,
    "subtree": "Война в космосе"
  },
  {
    "id": "n10",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Актуализация уставов\nСложность: 2\nЭффект: Ремонт армий +4",
    "name": "Актуализация уставов",
    "req": [
      "n8"
    ],
    "next": [
      "n16",
      "n91"
    ],
    "title": null,
    "x": 55,
    "y": 414,
    "lvl": 5,
    "subtree": "Наземный бой"
  },
  {
    "id": "n11",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Автономность флота\nСложность: 2\nЭффект: Ремонт флотов +4",
    "name": "Автономность флота",
    "req": [
      "n9"
    ],
    "next": [
      "n14",
      "n64"
    ],
    "title": null,
    "x": 1211.83,
    "y": 414,
    "lvl": 5,
    "subtree": "Война в космосе"
  },
  {
    "id": "n12",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Военный ИИ\nСложность: 4, тех. Сильный ИИ\nЭффект: Скорость +3",
    "name": "Военный ИИ",
    "req": [
      "n73"
    ],
    "next": [
      "n88",
      "n97",
      "n121"
    ],
    "title": null,
    "x": 639.29,
    "y": 874,
    "lvl": 10,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n13",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Сверхсветовая координация\nСложность: 5, тех. Ансибль\nЭффект: \n:Орудия Дайсона могут стрелять",
    "name": "Сверхсветовая координация",
    "req": [
      "n105"
    ],
    "next": [
      "n74",
      "n117"
    ],
    "title": "С силой, равной Стоимость*2.63, и в рамках здравого смысла, Сферы Дайсона могут стрелять в свою и соседние системы. На разнос планеты их не хватит (е17/е32), но на стерилизацию - вполне.",
    "x": 639.29,
    "y": 1150,
    "lvl": 13,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n14",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Специализация кораблей\nСложность: 3\nЭффект: +4 очко распределения флотам",
    "name": "Специализация кораблей",
    "req": [
      "n11"
    ],
    "next": [
      "n19",
      "n72"
    ],
    "title": null,
    "x": 1211.83,
    "y": 506,
    "lvl": 6,
    "subtree": "Война в космосе"
  },
  {
    "id": "n15",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Силы планетарной обороны\nСложность: 3\nЭффект: Защита колонии +6",
    "name": "Силы планетарной обороны",
    "req": [
      "n16"
    ],
    "next": [
      "n21",
      "n124"
    ],
    "title": null,
    "x": 55,
    "y": 598,
    "lvl": 7,
    "subtree": "Наземный бой"
  },
  {
    "id": "n16",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Планетарные базы\nСложность: 3\nЭффект: Общество +3",
    "name": "Планетарные базы",
    "req": [
      "n10"
    ],
    "next": [
      "n41",
      "n15"
    ],
    "title": null,
    "x": 55,
    "y": 506,
    "lvl": 6,
    "subtree": "Наземный бой"
  },
  {
    "id": "n17",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Боевые ксеноживотные\nСложность: 2, образцы (1)\nЭффект: :Атака +5\n на нечуждых планетах",
    "name": "Боевые ксеноживотные",
    "req": [
      "n8"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 414,
    "lvl": 5,
    "subtree": "Наземный бой"
  },
  {
    "id": "n18",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Противокосмические орудия\nСложность: 2\nЭффект: 2 слота, ПКО",
    "name": "Противокосмические орудия",
    "req": [
      "n8"
    ],
    "next": [],
    "title": null,
    "x": 349.54,
    "y": 414,
    "lvl": 5,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n19",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Базы в глубоком космосе\nСложность: 3, тех. Теория \nдосветовой колонизации\nЭффект: Общество +3",
    "name": "Базы в глубоком космосе",
    "req": [
      "n14"
    ],
    "next": [
      "n20",
      "n33"
    ],
    "title": null,
    "x": 1211.83,
    "y": 598,
    "lvl": 7,
    "subtree": "Война в космосе"
  },
  {
    "id": "n20",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#00FF00",
    "fullText": "Межпланетная полиция\nСложность: 4\nЭффект: Контршпионаж +4, Полиция +4",
    "name": "Межпланетная полиция",
    "req": [
      "n19"
    ],
    "next": [
      "n26"
    ],
    "title": null,
    "x": 1211.83,
    "y": 690,
    "lvl": 8,
    "subtree": "Война в космосе"
  },
  {
    "id": "n21",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Мобильная пехота\nСложность: 4, тех. Импланты\nЭффект: Скорость армий +8",
    "name": "Мобильная пехота",
    "req": [
      "n15"
    ],
    "next": [
      "n23",
      "n109"
    ],
    "title": null,
    "x": 55,
    "y": 690,
    "lvl": 8,
    "subtree": "Наземный бой"
  },
  {
    "id": "n22",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Экстрамерные боеголовки\nСложность: 6, гиперплазма(1)\nЭффект: Атака 4, :разрушение\nмодулей при критуспехе",
    "name": "Экстрамерные боеголовки",
    "req": [
      "n120"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 1426,
    "lvl": 16,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n23",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Новая молниеносная война\nСложность: 4\nЭффект: Скорость армий +1",
    "name": "Новая молниеносная война",
    "req": [
      "n21"
    ],
    "next": [
      "n24",
      "n32"
    ],
    "title": null,
    "x": 55,
    "y": 782,
    "lvl": 9,
    "subtree": "Наземный бой"
  },
  {
    "id": "n24",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Планетарный штурм\nСложность: 4\nЭффект: Бомбардировка +7",
    "name": "Планетарный штурм",
    "req": [
      "n23"
    ],
    "next": [
      "n84",
      "n94"
    ],
    "title": null,
    "x": 55,
    "y": 874,
    "lvl": 10,
    "subtree": "Наземный бой"
  },
  {
    "id": "n25",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Межзвёздный плацдарм\nСложность: 5, тех. Межзвёздная власть\nЭффект: Создание наземных баз +10",
    "name": "Межзвёздный плацдарм",
    "req": [
      "n113"
    ],
    "next": [
      "n89",
      "n31"
    ],
    "title": null,
    "x": 55,
    "y": 1150,
    "lvl": 13,
    "subtree": "Наземный бой"
  },
  {
    "id": "n26",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Унификация модулей\nСложность: 4\nЭффект: Создание космических баз +8",
    "name": "Унификация модулей",
    "req": [
      "n20"
    ],
    "next": [
      "n36",
      "n28"
    ],
    "title": null,
    "x": 1211.83,
    "y": 782,
    "lvl": 9,
    "subtree": "Война в космосе"
  },
  {
    "id": "n27",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#00FF00",
    "fullText": "Борьба с пиратством\nСложность: 5\nЭффект: :+10 кубов в бою с пиратами",
    "name": "Борьба с пиратством",
    "req": [
      "n28"
    ],
    "next": [
      "n29",
      "n80"
    ],
    "title": null,
    "x": 1211.83,
    "y": 966,
    "lvl": 11,
    "subtree": "Война в космосе"
  },
  {
    "id": "n28",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Межзвёздные операции\nСложность: 4, тех. Индустриализация космоса\nЭффект: Создание космических баз +8, вне \nродной системы",
    "name": "Межзвёздные операции",
    "req": [
      "n26"
    ],
    "next": [
      "n65",
      "n27"
    ],
    "title": null,
    "x": 1211.83,
    "y": 874,
    "lvl": 10,
    "subtree": "Война в космосе"
  },
  {
    "id": "n29",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Тактика межзвёздной войны\nСложность: 5\nЭффект: Создание флотов +10",
    "name": "Тактика межзвёздной войны",
    "req": [
      "n27"
    ],
    "next": [
      "n30",
      "n123"
    ],
    "title": null,
    "x": 1211.83,
    "y": 1058,
    "lvl": 12,
    "subtree": "Война в космосе"
  },
  {
    "id": "n30",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Суперкорабли\nСложность: 5, тех. Естественная\nнавигация\nЭффект: +7 очка распределения флотам",
    "name": "Суперкорабли",
    "req": [
      "n29"
    ],
    "next": [
      "n66",
      "n100"
    ],
    "title": null,
    "x": 1211.83,
    "y": 1150,
    "lvl": 13,
    "subtree": "Война в космосе"
  },
  {
    "id": "n31",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Трансчеловеческие подразделения\nСложность: 6, тех. Искусственное тело\nЭффект: +12 очка распределения армиям",
    "name": "Трансчеловеческие подразделения",
    "req": [
      "n25"
    ],
    "next": [
      "n107"
    ],
    "title": null,
    "x": 55,
    "y": 1242,
    "lvl": 14,
    "subtree": "Наземный бой"
  },
  {
    "id": "n32",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Стелс-системы\nСложность: 5, \nтех. Биологические наноматериалы\nЭффект: :удваивает Уклонение армий",
    "name": "Стелс-системы",
    "req": [
      "n23"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 874,
    "lvl": 10,
    "subtree": "Наземный бой"
  },
  {
    "id": "n33",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Аванпост в космосе\nСложность: 2\nЭффект: космическая база, 3 слота",
    "name": "Аванпост в космосе",
    "req": [
      "n19"
    ],
    "next": [
      "n35"
    ],
    "title": null,
    "x": 1501.58,
    "y": 690,
    "lvl": 8,
    "subtree": "Война в космосе"
  },
  {
    "id": "n34",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Верфи космофлота\nСложность: 2\nЭффект: Создание флотов +4",
    "name": "Верфи космофлота",
    "req": [
      "n9"
    ],
    "next": [],
    "title": null,
    "x": 1501.58,
    "y": 414,
    "lvl": 5,
    "subtree": "Война в космосе"
  },
  {
    "id": "n35",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Звёздная база\nСложность: 3\nЭффект: космическая база, 4 слота",
    "name": "Звёздная база",
    "req": [
      "n33"
    ],
    "next": [
      "n36"
    ],
    "title": null,
    "x": 1501.58,
    "y": 782,
    "lvl": 9,
    "subtree": "Война в космосе"
  },
  {
    "id": "n36",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Звёздная цитадель\nСложность: 4\nЭффект: космическая база,\n6 слотов",
    "name": "Звёздная цитадель",
    "req": [
      "n26",
      "n35"
    ],
    "next": [],
    "title": null,
    "x": 1501.58,
    "y": 874,
    "lvl": 10,
    "subtree": "Война в космосе"
  },
  {
    "id": "n40",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Гиперподавитель\nСложность: 6, экзотическая материя (1)\nЭффект: :замедляет вдвое чужие\nFTL-переходы в и из системы",
    "name": "Гиперподавитель",
    "req": [
      "n100"
    ],
    "next": [],
    "title": null,
    "x": 1503.11,
    "y": 1334,
    "lvl": 15,
    "subtree": "Война в космосе"
  },
  {
    "id": "n41",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Гарнизон\nСложность: 3\nЭффект: наземная база, \nРемонт армий +3, 1 слот",
    "name": "Гарнизон",
    "req": [
      "n16"
    ],
    "next": [
      "n59"
    ],
    "title": null,
    "x": -234.4,
    "y": 598,
    "lvl": 7,
    "subtree": "Наземный бой"
  },
  {
    "id": "n42",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Гамма-лазерные мины\nСложность: 5\nЭффект: Мины 9",
    "name": "Гамма-лазерные мины",
    "req": [
      "n124"
    ],
    "next": [],
    "title": null,
    "x": 349.54,
    "y": 782,
    "lvl": 9,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n43",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Электромагнитное орудие\nСложность: 2, редкие металлы(1)\nЭффект: Атака 5",
    "name": "Электромагнитное орудие",
    "req": [
      "n7"
    ],
    "next": [],
    "title": null,
    "x": 925.56,
    "y": 322,
    "lvl": 4,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n44",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Зенитные системы\nСложность: 1\nЭффект: 1 слот, ПКО",
    "name": "Зенитные системы",
    "req": [
      "n2"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 138,
    "lvl": 2,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n59",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Наземная база\nСложность: 4\nЭффект: наземная база, 3 слота,\nСоздание армий +4",
    "name": "Наземная база",
    "req": [
      "n41"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 690,
    "lvl": 8,
    "subtree": "Наземный бой"
  },
  {
    "id": "n60",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Ускорители рефлексов\nСложность: 2,\n тех. Нейроинтерфейсы\nЭффект: Скорость +3, Уклонение +3",
    "name": "Ускорители рефлексов",
    "req": [
      "n87"
    ],
    "next": [],
    "title": null,
    "x": 349.54,
    "y": 230,
    "lvl": 3,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n63",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Эсминец\nСложность: 2\nЭффект: звездолёт, 2 слота",
    "name": "Эсминец",
    "req": [
      "n6"
    ],
    "next": [],
    "title": null,
    "x": 1501.58,
    "y": 322,
    "lvl": 4,
    "subtree": "Война в космосе"
  },
  {
    "id": "n64",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Крейсер\nСложность: 3\nЭффект: звездолёт, 3 слота",
    "name": "Крейсер",
    "req": [
      "n11"
    ],
    "next": [],
    "title": null,
    "x": 1501.58,
    "y": 506,
    "lvl": 6,
    "subtree": "Война в космосе"
  },
  {
    "id": "n65",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Линкор\nСложность: 5\nЭффект: звездолёт, 5 слотов",
    "name": "Линкор",
    "req": [
      "n28"
    ],
    "next": [],
    "title": null,
    "x": 1503.11,
    "y": 966,
    "lvl": 11,
    "subtree": "Война в космосе"
  },
  {
    "id": "n66",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Титан\nСложность: 7\nЭффект: звездолёт, 7 слотов",
    "name": "Титан",
    "req": [
      "n30"
    ],
    "next": [],
    "title": null,
    "x": 1503.11,
    "y": 1242,
    "lvl": 14,
    "subtree": "Война в космосе"
  },
  {
    "id": "n67",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Плазменный щит\nСложность: 4\nЭффект: Щит 8",
    "name": "Плазменный щит",
    "req": [
      "n68"
    ],
    "next": [],
    "title": null,
    "x": 349.54,
    "y": 598,
    "lvl": 7,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n68",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Удержание плазмы\nСложность: 3\nЭффект: Атака +2",
    "name": "Удержание плазмы",
    "req": [
      "n81"
    ],
    "next": [
      "n69",
      "n67",
      "n111"
    ],
    "title": null,
    "x": 639.29,
    "y": 506,
    "lvl": 6,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n69",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Плазменное орудие\nСложность: 4\nЭффект: Атака 4",
    "name": "Плазменное орудие",
    "req": [
      "n68"
    ],
    "next": [],
    "title": null,
    "x": 925.56,
    "y": 598,
    "lvl": 7,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n70",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Рельсотрон\nСложность: 1\nЭффект: Атака 2",
    "name": "Рельсотрон",
    "req": [
      "n2"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 46,
    "lvl": 1,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n71",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Модернизация военной техники\nСложность: 2, тех. Оборонная \nпромышленность\nЭффект: Скорость +1",
    "name": "Модернизация военной техники",
    "req": [
      "n7"
    ],
    "next": [
      "n76",
      "n81"
    ],
    "title": null,
    "x": 639.29,
    "y": 322,
    "lvl": 4,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n72",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Тактика орбитальной бомбардировки\nСложность: 3\nЭффект: Бомбардировка +5",
    "name": "Тактика орбитальной бомбардировки",
    "req": [
      "n14"
    ],
    "next": [],
    "title": null,
    "x": 1501.58,
    "y": 598,
    "lvl": 7,
    "subtree": "Война в космосе"
  },
  {
    "id": "n73",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Боевое применение наномашин\nСложность: 4, тех. Нанороботы\nЭффект: Защита +3",
    "name": "Боевое применение наномашин",
    "req": [
      "n83"
    ],
    "next": [
      "n78",
      "n12",
      "n128"
    ],
    "title": null,
    "x": 639.29,
    "y": 782,
    "lvl": 9,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n74",
    "type": "trapezoid2",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Служба координации огня\nСложность: 5, экзотматерия (1)\nЭффект: Атака флотов +1,\nв системе",
    "name": "Служба координации огня",
    "req": [
      "n13"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 1242,
    "lvl": 14,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n75",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Малый корабль\nСложность: 1\nЭффект: звездолёт, 1 слот,\nнет FTL",
    "name": "Малый корабль",
    "req": [
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 1501.58,
    "y": 138,
    "lvl": 2,
    "subtree": "Война в космосе"
  },
  {
    "id": "n76",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Термоядерные ракеты\nСложность: 4, трансураны (1)\nЭффект: Атака 16, 3 слота, \nракеты, ЭМИ, рад",
    "name": "Термоядерные ракеты",
    "req": [
      "n71"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 414,
    "lvl": 5,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n77",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Композитная броня\nСложность: 1\nЭффект: Защита +2",
    "name": "Композитная броня",
    "req": [
      "n2"
    ],
    "next": [],
    "title": null,
    "x": 349.54,
    "y": 46,
    "lvl": 1,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n78",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Боевой нанорой\nСложность: 5, наноматериалы (1)\nЭффект: нанорой, 0 слотов, \nАтака 14",
    "name": "Боевой нанорой",
    "req": [
      "n73"
    ],
    "next": [],
    "title": null,
    "x": 925.56,
    "y": 874,
    "lvl": 10,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n79",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Боевые экзоскелеты\nСложность: 2, тех. Экзоскелеты\nЭффект: Защита +2,\nСкорость +2",
    "name": "Боевые экзоскелеты",
    "req": [
      "n1"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 138,
    "lvl": 2,
    "subtree": "Наземный бой"
  },
  {
    "id": "n80",
    "type": "trapezoid2",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Мобильный комиссариат\nСложность: 5\nЭффект: Контршпионаж +9",
    "name": "Мобильный комиссариат",
    "req": [
      "n27"
    ],
    "next": [],
    "title": null,
    "x": 1503.11,
    "y": 1058,
    "lvl": 12,
    "subtree": "Война в космосе"
  },
  {
    "id": "n81",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Наука смерти\nСложность: 2\nЭффект: +4 к ветви\n\"Вооружение и защита\"",
    "name": "Наука смерти",
    "req": [
      "n71"
    ],
    "next": [
      "n85",
      "n68",
      "n90"
    ],
    "title": null,
    "x": 639.29,
    "y": 414,
    "lvl": 5,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n82",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Ракеты с антиматерией\nСложность: 6, антиматерия (1)\nЭффект: Атака 14, 2 слота, \nракеты, ЭМИ, рад",
    "name": "Ракеты с антиматерией",
    "req": [
      "n83"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 782,
    "lvl": 9,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n83",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Применение антиматерии\nСложность: 4, \nтех. Физика элементарных частиц\nЭффект: Атака +3",
    "name": "Применение антиматерии",
    "req": [
      "n111"
    ],
    "next": [
      "n82",
      "n73"
    ],
    "title": null,
    "x": 639.29,
    "y": 690,
    "lvl": 8,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n84",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Силовая броня\nСложность: 5\nЭффект: Защита +6, Щит +4,\nСверхадаптация +1",
    "name": "Силовая броня",
    "req": [
      "n24"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 966,
    "lvl": 11,
    "subtree": "Наземный бой"
  },
  {
    "id": "n85",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Военный НИИ\nСложность: 3\nЭффект: +6 к ветви \n\"Вооружение и защита\"",
    "name": "Военный НИИ",
    "req": [
      "n81"
    ],
    "next": [],
    "title": null,
    "x": 349.54,
    "y": 506,
    "lvl": 6,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n86",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Кадетский корпус\nСложность: 1\nЭффект: +2 к ветке \"Война в космосе\"",
    "name": "Кадетский корпус",
    "req": [
      "n4"
    ],
    "next": [],
    "title": null,
    "x": 1501.58,
    "y": 230,
    "lvl": 3,
    "subtree": "Война в космосе"
  },
  {
    "id": "n87",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Военные протезы\nСложность: 1, тех. Импланты\nЭффект: Защита +2",
    "name": "Военные протезы",
    "req": [
      "n2"
    ],
    "next": [
      "n60"
    ],
    "title": null,
    "x": 349.54,
    "y": 138,
    "lvl": 2,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n88",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Улучшенный ИИ\nСложность: 5\nЭффект: Атака +2, Уклонение +4",
    "name": "Улучшенный ИИ",
    "req": [
      "n12"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 966,
    "lvl": 11,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n89",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Боевые экзоты\nСложность: 3,\nтех. Использование экзотов\nЭффект: Атака +3, рад, ужас",
    "name": "Боевые экзоты",
    "req": [
      "n25"
    ],
    "next": [],
    "title": null,
    "x": -234.05,
    "y": 1242,
    "lvl": 14,
    "subtree": "Наземный бой"
  },
  {
    "id": "n90",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Радиологическое оружие\nСложность: 3, трансураны(1)\nЭффект: Атака 6, рад",
    "name": "Радиологическое оружие",
    "req": [
      "n81"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 506,
    "lvl": 6,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n91",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Штурмовые бригады\nСложность: 2\nЭффект: Атака 2, осадное",
    "name": "Штурмовые бригады",
    "req": [
      "n10"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 506,
    "lvl": 6,
    "subtree": "Наземный бой"
  },
  {
    "id": "n92",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Инфразвуковые орудия\nСложность: 2\nЭффект: Атака 2, ужас, массовое",
    "name": "Инфразвуковые орудия",
    "req": [
      "n93"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 230,
    "lvl": 3,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n93",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Внутренние войска\nСложность: 1\nЭффект: Полиция +2",
    "name": "Внутренние войска",
    "req": [
      "n2"
    ],
    "next": [
      "n92",
      "n7"
    ],
    "title": null,
    "x": 639.29,
    "y": 138,
    "lvl": 2,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n94",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Общесистемная армия\nСложность: 5\nЭффект: Создание армий +10",
    "name": "Общесистемная армия",
    "req": [
      "n24"
    ],
    "next": [
      "n95",
      "n113"
    ],
    "title": null,
    "x": 55.35,
    "y": 966,
    "lvl": 11,
    "subtree": "Наземный бой"
  },
  {
    "id": "n95",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Интеллектуальное восстановление\nСложность: 5\nЭффект:: Армии на союзной планете \nвосстанавливаются за один ход",
    "name": "Интеллектуальное восстановление",
    "req": [
      "n94"
    ],
    "next": [],
    "title": null,
    "x": -234.05,
    "y": 1058,
    "lvl": 12,
    "subtree": "Наземный бой"
  },
  {
    "id": "n96",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Мезонные орудия\nСложность: 6, \nтех. Аномальные топологии\nЭффект: Атака 6, ББ, рад",
    "name": "Мезонные орудия",
    "req": [
      "n97"
    ],
    "next": [],
    "title": null,
    "x": 925.56,
    "y": 1058,
    "lvl": 12,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n97",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Оружие на \"новой физике\"\nСложность: 5, тех. \nФизика гиперпространства\nЭффект: Атака +4",
    "name": "Оружие на \"новой физике\"",
    "req": [
      "n12"
    ],
    "next": [
      "n98",
      "n96",
      "n105"
    ],
    "title": null,
    "x": 639.29,
    "y": 966,
    "lvl": 11,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n98",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Стазокерамическая броня\nСложность: 5, стазокерамика(1)\nЭффект: Защита +4, Гарантированная\nзащита 1",
    "name": "Стазокерамическая броня",
    "req": [
      "n97"
    ],
    "next": [],
    "title": null,
    "x": 349.54,
    "y": 1058,
    "lvl": 12,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n99",
    "type": "hexagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "И-врата\nСложность: 6, тех.  Телепортация\nЭффект: :мгновенная переброска флота\nмежду И-вратами",
    "name": "И-врата",
    "req": [
      "n101"
    ],
    "next": [],
    "title": null,
    "x": 1211.83,
    "y": 1426,
    "lvl": 16,
    "subtree": "Война в космосе"
  },
  {
    "id": "n100",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Война в гиперпространстве\nСложность: 6, тех.  Гиперволны\nЭффект: Скорость FTL +6, \n:видны все корабли в галактике",
    "name": "Война в гиперпространстве",
    "req": [
      "n30"
    ],
    "next": [
      "n101",
      "n40"
    ],
    "title": "Глубокое понимание и практическое применение физики гиперпространства...",
    "x": 1211.83,
    "y": 1242,
    "lvl": 14,
    "subtree": "Война в космосе"
  },
  {
    "id": "n101",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Планетоидная инженерия\nСложность: 7, тех. Звёздная материя\nЭффект: Защита флотов +1",
    "name": "Планетоидная инженерия",
    "req": [
      "n100"
    ],
    "next": [
      "n99",
      "n102"
    ],
    "title": null,
    "x": 1211.83,
    "y": 1334,
    "lvl": 15,
    "subtree": "Война в космосе"
  },
  {
    "id": "n102",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Звезда Смерти\nСложность: 15\nЭффект: звездолёт, 15 слотов,\nЛюбимец 8",
    "name": "Звезда Смерти",
    "req": [
      "n101"
    ],
    "next": [],
    "title": "Потому что могу!",
    "x": 1501.58,
    "y": 1426,
    "lvl": 16,
    "subtree": "Война в космосе"
  },
  {
    "id": "n103",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Щит искривления\nСложность: 5\nЭффект: Щит 10",
    "name": "Щит искривления",
    "req": [
      "n105"
    ],
    "next": [],
    "title": null,
    "x": 344.75,
    "y": 1150,
    "lvl": 13,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n104",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Нейтрониевая шрапнель\nСложность: 6, \nнейтроний (1)\nЭффект: Бомбардировка +12",
    "name": "Нейтрониевая шрапнель",
    "req": [
      "n117"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 1334,
    "lvl": 15,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n105",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Военная гравитоника\nСложность: 5, тех. Управление гравитацией\nЭффект: Щит армий +1, Щит флотов +1",
    "name": "Военная гравитоника",
    "req": [
      "n97"
    ],
    "next": [
      "n103",
      "n106",
      "n13"
    ],
    "title": null,
    "x": 639.29,
    "y": 1058,
    "lvl": 12,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n106",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Сингулярная шрапнель\nСложность: 5, экзотматерия(1)\nЭффект: Атака 6, ББ",
    "name": "Сингулярная шрапнель",
    "req": [
      "n105"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 1150,
    "lvl": 13,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n107",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Миры-крепости\nСложность: 6\nЭффект: Создание наземных баз +4,\nЗащита колонии +8",
    "name": "Миры-крепости",
    "req": [
      "n31"
    ],
    "next": [
      "n108",
      "n112",
      "n122"
    ],
    "title": null,
    "x": 55.7,
    "y": 1334,
    "lvl": 15,
    "subtree": "Наземный бой"
  },
  {
    "id": "n108",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Мгновенное реагирование\nСложность: 8, тех. Телепортация\nЭффект: :переброска армий на любую \nдружественную планету мгновенна",
    "name": "Мгновенное реагирование",
    "req": [
      "n107"
    ],
    "next": [],
    "title": null,
    "x": 55.7,
    "y": 1426,
    "lvl": 16,
    "subtree": "Наземный бой"
  },
  {
    "id": "n109",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Десантные капсулы\nСложность: 4\nЭффект: :возможна высадка\nбез подавления МО и ПКО",
    "name": "Десантные капсулы",
    "req": [
      "n21"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 782,
    "lvl": 9,
    "subtree": "Наземный бой"
  },
  {
    "id": "n110",
    "type": "trapezoid",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Реактивные ранцы\nСложность: 4\nЭффект: Скорость +4, Полёт 1",
    "name": "Реактивные ранцы",
    "req": [
      "n111"
    ],
    "next": [],
    "title": null,
    "x": 929.04,
    "y": 690,
    "lvl": 8,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n111",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Средства космического абордажа\nСложность: 3\nЭффект: :Абордаж +2",
    "name": "Средства космического абордажа",
    "req": [
      "n68"
    ],
    "next": [
      "n83",
      "n110"
    ],
    "title": null,
    "x": 639.29,
    "y": 598,
    "lvl": 7,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n112",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Система \"Винегрет\"\nСложность: 7, тех. Гиперплазма\nЭффект: Атака 18, массовое",
    "name": "Система \"Винегрет\"",
    "req": [
      "n107",
      "n120"
    ],
    "next": [],
    "title": null,
    "x": 344.75,
    "y": 1426,
    "lvl": 16,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n113",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Тактическая левитация\nСложность: 5,\nтех. Управление гравитацией\nЭффект: Скорость армий +10",
    "name": "Тактическая левитация",
    "req": [
      "n94"
    ],
    "next": [
      "n25",
      "n114"
    ],
    "title": null,
    "x": 55,
    "y": 1058,
    "lvl": 12,
    "subtree": "Наземный бой"
  },
  {
    "id": "n114",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Лев-эсминцы\nСложность: 6\nЭффект: танки, 6 слотов, \nПолёт 1",
    "name": "Лев-эсминцы",
    "req": [
      "n113"
    ],
    "next": [],
    "title": null,
    "x": -234.05,
    "y": 1150,
    "lvl": 13,
    "subtree": "Наземный бой"
  },
  {
    "id": "n115",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Танки\nСложность: 3\nЭффект: танки, 3 слота, \nЗащита +4",
    "name": "Танки",
    "req": [
      "n126"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 322,
    "lvl": 4,
    "subtree": "Наземный бой"
  },
  {
    "id": "n116",
    "type": "trapezoid2",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Спасательные бригады\nСложность: 2\nЭффект: Устранение \nпоследствий +4",
    "name": "Спасательные бригады",
    "req": [
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 1501.58,
    "y": 46,
    "lvl": 1,
    "subtree": "Война в космосе"
  },
  {
    "id": "n117",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Боевое применение нейтрония\nСложность: 6, тех. Звёздная материя\nЭффект: Защита +5",
    "name": "Боевое применение нейтрония",
    "req": [
      "n13"
    ],
    "next": [
      "n104",
      "n119",
      "n120"
    ],
    "title": null,
    "x": 639.29,
    "y": 1242,
    "lvl": 14,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n118",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Странглетовое супероружие\nСложность: 8, нейтроний (2), \nгиперплазма (2)\nЭффект: Атака 3, странглет",
    "name": "Странглетовое супероружие",
    "req": [
      "n120"
    ],
    "next": [],
    "title": null,
    "x": 639.29,
    "y": 1426,
    "lvl": 16,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n119",
    "type": "trapezoid2",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Живой нейтроний\nСложность: 5, нейтроний(1)\nЭффект: Защита +4,\nРегенерация +1",
    "name": "Живой нейтроний",
    "req": [
      "n117"
    ],
    "next": [],
    "title": null,
    "x": 344.75,
    "y": 1334,
    "lvl": 15,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n120",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#0000FF",
    "fullText": "Оружие гиперпространства\nСложность: 6, тех. Гиперплазма\nЭффект: Атака +6",
    "name": "Оружие гиперпространства",
    "req": [
      "n117"
    ],
    "next": [
      "n118",
      "n22",
      "n112"
    ],
    "title": null,
    "x": 639.29,
    "y": 1334,
    "lvl": 15,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n121",
    "type": "octagon",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Бог войны\nСложность: 10\nЭффект: титан, 10 слотов, ужас,\nЛюбимец 4",
    "name": "Бог войны",
    "req": [
      "n12"
    ],
    "next": [],
    "title": "Именно то, что вы подумали.\nВес \"Бога войны- ок. 1.5 миллионов тонн при высоте 700 м, \nвнутренние силовые поля поддерживают целостность корпуса\n",
    "x": 349.54,
    "y": 966,
    "lvl": 11,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n122",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Планетарный бастион\nСложность: 10\nЭффект: наземная база, 8 слотов,\nСоздание армий +3, Защита колонии +6",
    "name": "Планетарный бастион",
    "req": [
      "n107"
    ],
    "next": [],
    "title": null,
    "x": -234.05,
    "y": 1426,
    "lvl": 16,
    "subtree": "Наземный бой"
  },
  {
    "id": "n123",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Ускоряющие врата\nСложность: 8, чудо,\nтех. Энергия гиперпространства\nЭффект: :Скорость FTL из системы +2",
    "name": "Ускоряющие врата",
    "req": [
      "n29"
    ],
    "next": [],
    "title": "\"Залог победы – неожиданность и скорость. В любви это так же верно, как в бою.\"\n\n— Андре Моруа",
    "x": 1503.11,
    "y": 1150,
    "lvl": 13,
    "subtree": "Война в космосе"
  },
  {
    "id": "n124",
    "type": "ellipse",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Космические мины\nСложность: 4\nЭффект: Мины 6",
    "name": "Космические мины",
    "req": [
      "n15"
    ],
    "next": [
      "n42"
    ],
    "title": null,
    "x": 349.54,
    "y": 690,
    "lvl": 8,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n125",
    "type": "rectangle",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Военная академия\nСложность: 1\nЭффект: разово +1 великий человек\nвоенной специализации",
    "name": "Военная академия",
    "req": [
      "n1"
    ],
    "next": [],
    "title": null,
    "x": -234.4,
    "y": 46,
    "lvl": 1,
    "subtree": "Наземный бой"
  },
  {
    "id": "n126",
    "type": "parallelogram",
    "treeName": "Military",
    "borderColor": "#000000",
    "fullText": "Тренировочная база\nСложность: 1\nЭффект: Создание армий +2",
    "name": "Тренировочная база",
    "req": [
      "n0"
    ],
    "next": [
      "n8",
      "n115"
    ],
    "title": null,
    "x": 55,
    "y": 230,
    "lvl": 3,
    "subtree": "Наземный бой"
  },
  {
    "id": "n127",
    "type": "fatarrow",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Магнитный щит\nСложность: 2\nЭффект: Щит 4",
    "name": "Магнитный щит",
    "req": [
      "n7"
    ],
    "next": [],
    "title": null,
    "x": 349.54,
    "y": 322,
    "lvl": 4,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n128",
    "type": "trapezoid2",
    "treeName": "Military",
    "borderColor": "#FF0000",
    "fullText": "Ремонтный наноулей\nСложность: 4, наноматериалы (1)\nЭффект: Регенерация +2",
    "name": "Ремонтный наноулей",
    "req": [
      "n73"
    ],
    "next": [],
    "title": null,
    "x": 353.01,
    "y": 874,
    "lvl": 10,
    "subtree": "Вооружение и защита"
  },
  {
    "id": "n0",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Мобилизация населения\nСложность: 1\nЭффект: Общество +1",
    "name": "Мобилизация населения",
    "req": [
      "n17"
    ],
    "next": [
      "n9",
      "n1",
      "n37",
      "n74"
    ],
    "title": null,
    "x": 335,
    "y": 223,
    "lvl": 2,
    "subtree": "Государство"
  },
  {
    "id": "n1",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Колониальное управление\nСложность: 1, затраты (1)\nЭффект: Пропаганда +1, \nСтроительство +1",
    "name": "Колониальное управление",
    "req": [
      "n0"
    ],
    "next": [
      "n2",
      "n24",
      "n34"
    ],
    "title": null,
    "x": 335,
    "y": 315,
    "lvl": 3,
    "subtree": "Государство"
  },
  {
    "id": "n2",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Общеколониальные программы\nСложность: 2\nЭффект: Общество +2",
    "name": "Общеколониальные программы",
    "req": [
      "n1"
    ],
    "next": [
      "n3",
      "n36",
      "n38",
      "n73"
    ],
    "title": null,
    "x": 335,
    "y": 407,
    "lvl": 4,
    "subtree": "Государство"
  },
  {
    "id": "n3",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Новое законодательство\nСложность: 2\nЭффект: +1 свободный куб",
    "name": "Новое законодательство",
    "req": [
      "n2"
    ],
    "next": [
      "n46",
      "n71",
      "n83"
    ],
    "title": null,
    "x": 335,
    "y": 499,
    "lvl": 5,
    "subtree": "Государство"
  },
  {
    "id": "n4",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Межпланетная власть\nСложность: 4, волнения (2)\nЭффект: Общество +4",
    "name": "Межпланетная власть",
    "req": [
      "n91"
    ],
    "next": [
      "n5",
      "n16",
      "n29"
    ],
    "title": null,
    "x": 335,
    "y": 775,
    "lvl": 8,
    "subtree": "Государство"
  },
  {
    "id": "n5",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Межпланетный закон\nСложность: 4\nЭффект: Полиция +8",
    "name": "Межпланетный закон",
    "req": [
      "n4"
    ],
    "next": [
      "n6",
      "n47"
    ],
    "title": null,
    "x": 335,
    "y": 867,
    "lvl": 9,
    "subtree": "Государство"
  },
  {
    "id": "n6",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Всеобщий учёт\nСложность: 4\nЭффект: Производство +4",
    "name": "Всеобщий учёт",
    "req": [
      "n5"
    ],
    "next": [
      "n39",
      "n93"
    ],
    "title": null,
    "x": 335,
    "y": 959,
    "lvl": 10,
    "subtree": "Государство"
  },
  {
    "id": "n7",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Межзвёздная власть\nСложность: 5, волнения(3),\nлюбая тех. FTL\nЭффект: Общество +5, Полиция +1",
    "name": "Межзвёздная власть",
    "req": [
      "n93"
    ],
    "next": [
      "n27",
      "n28",
      "n87"
    ],
    "title": null,
    "x": 335,
    "y": 1143,
    "lvl": 12,
    "subtree": "Государство"
  },
  {
    "id": "n8",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Земной миф\nСложность: 4\nЭффект: Пропаганда +8",
    "name": "Земной миф",
    "req": [
      "n81"
    ],
    "next": [
      "n103",
      "n78"
    ],
    "title": null,
    "x": 1195.34,
    "y": 959,
    "lvl": 10,
    "subtree": "Социология"
  },
  {
    "id": "n9",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Центр добровольного содействия\nСложность: 1\nЭффект: Конверсия +2",
    "name": "Центр добровольного содействия",
    "req": [
      "n0"
    ],
    "next": [],
    "title": null,
    "x": 615.84,
    "y": 223,
    "lvl": 2,
    "subtree": "Государство"
  },
  {
    "id": "n12",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Новые способы пропаганды\nСложность: 1\nЭффект: Наука +1",
    "name": "Новые способы пропаганды",
    "req": [
      "n14"
    ],
    "next": [
      "n20",
      "n31",
      "n26"
    ],
    "title": null,
    "x": 1195.34,
    "y": 315,
    "lvl": 3,
    "subtree": "Социология"
  },
  {
    "id": "n13",
    "type": "parallelogram2",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Психологическая адаптация\nСложность: 1\nЭффект: Общество +1",
    "name": "Психологическая адаптация",
    "req": [],
    "next": [
      "n14",
      "n32",
      "n65",
      "n97",
      "n102"
    ],
    "title": null,
    "x": 1195.34,
    "y": 132,
    "lvl": 1,
    "subtree": "Социология"
  },
  {
    "id": "n14",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Колониальная социология\nСложность: 1, затраты (1)\nЭффект: Дипломатия +1, Пропаганда +1",
    "name": "Колониальная социология",
    "req": [
      "n13"
    ],
    "next": [
      "n12",
      "n105"
    ],
    "title": null,
    "x": 1195.34,
    "y": 223,
    "lvl": 2,
    "subtree": "Социология"
  },
  {
    "id": "n15",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Ксенодипломатия\nСложность: 5, первый контакт\nЭффект: Дипломатия +10",
    "name": "Ксенодипломатия",
    "req": [
      "n66"
    ],
    "next": [],
    "title": null,
    "x": 905.59,
    "y": 1051,
    "lvl": 11,
    "subtree": "Социология"
  },
  {
    "id": "n16",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Государственная безопасность\nСложность: 4, осуждение (4)\nЭффект: Полиция +8",
    "name": "Государственная безопасность",
    "req": [
      "n4"
    ],
    "next": [
      "n25"
    ],
    "title": null,
    "x": 50.92,
    "y": 867,
    "lvl": 9,
    "subtree": "Государство"
  },
  {
    "id": "n17",
    "type": "parallelogram2",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Подтверждение авторитета\nСложность: 1\nЭффект: разово Общество +6",
    "name": "Подтверждение авторитета",
    "req": [],
    "next": [
      "n0",
      "n40",
      "n75"
    ],
    "title": null,
    "x": 335,
    "y": 132,
    "lvl": 1,
    "subtree": "Государство"
  },
  {
    "id": "n18",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Чуждый разум\nСложность: 4\nЭффект: Наука +4",
    "name": "Чуждый разум",
    "req": [
      "n109"
    ],
    "next": [
      "n81",
      "n110"
    ],
    "title": null,
    "x": 1195.34,
    "y": 775,
    "lvl": 8,
    "subtree": "Социология"
  },
  {
    "id": "n19",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Машинное правосудие\nСложность: 5, тех. Ограниченный ИИ\nЭффект: Общество +5",
    "name": "Машинное правосудие",
    "req": [
      "n47"
    ],
    "next": [
      "n92"
    ],
    "title": null,
    "x": 615.84,
    "y": 1051,
    "lvl": 11,
    "subtree": "Государство"
  },
  {
    "id": "n20",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Доктрина целеустремлённости\nСложность: 2\nЭффект: Общество +2",
    "name": "Доктрина целеустремлённости",
    "req": [
      "n12"
    ],
    "next": [
      "n23",
      "n22",
      "n104"
    ],
    "title": null,
    "x": 1195.34,
    "y": 407,
    "lvl": 4,
    "subtree": "Социология"
  },
  {
    "id": "n21",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Девиатика\nСложность: 3\nЭффект: :+6 куба при взаимодействии\nс маргинальными группами",
    "name": "Девиатика",
    "req": [
      "n22"
    ],
    "next": [],
    "title": null,
    "x": 908.02,
    "y": 588,
    "lvl": 6,
    "subtree": "Социология"
  },
  {
    "id": "n22",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Теория социальных отклонений\nСложность: 2\nЭффект: Общество +2, \n:естественная рождаемость, Чистота +1",
    "name": "Теория социальных отклонений",
    "req": [
      "n20"
    ],
    "next": [
      "n21",
      "n41",
      "n77"
    ],
    "title": null,
    "x": 1195.34,
    "y": 499,
    "lvl": 5,
    "subtree": "Социология"
  },
  {
    "id": "n23",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Трудовой энтузиазм\nСложность: 2\nЭффект: :+1 очко опыта\nтекущим и будущим великим людям",
    "name": "Трудовой энтузиазм",
    "req": [
      "n20"
    ],
    "next": [
      "n35"
    ],
    "title": null,
    "x": 905.59,
    "y": 407,
    "lvl": 4,
    "subtree": "Социология"
  },
  {
    "id": "n24",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Полицейское управление\nСложность: 2\nЭффект: Контршпионаж +2,\nПолиция +2",
    "name": "Полицейское управление",
    "req": [
      "n1"
    ],
    "next": [],
    "title": "\"Возьмите сто человек, и среди них обязательно будет трое воров, двое убийц и один злостный неплательщик налогов\" \n – Наставление молодого полицейского, стр. 2.",
    "x": 46.06,
    "y": 407,
    "lvl": 4,
    "subtree": "Государство"
  },
  {
    "id": "n25",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Строгий надзор\nСложность: 4, осуждение (4)\nЭффект: Контршпионаж +10, Наука -1",
    "name": "Строгий надзор",
    "req": [
      "n16"
    ],
    "next": [],
    "title": null,
    "x": 50.92,
    "y": 959,
    "lvl": 10,
    "subtree": "Государство"
  },
  {
    "id": "n26",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Двоемыслие\nСложность: 2, осуждение (2)\nЭффект: :военное подавление\nВолнений не генерирует Осуждения",
    "name": "Двоемыслие",
    "req": [
      "n12"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 407,
    "lvl": 4,
    "subtree": "Социология"
  },
  {
    "id": "n27",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Террор-группы\nСложность: 5, осуждение (5)\nЭффект: Полиция +12, \nпри подавлении армией",
    "name": "Террор-группы",
    "req": [
      "n7"
    ],
    "next": [],
    "title": null,
    "x": 50.92,
    "y": 1235,
    "lvl": 13,
    "subtree": "Государство"
  },
  {
    "id": "n28",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Трансчеловеческий закон\nСложность: 5\nЭффект: Общество +5",
    "name": "Трансчеловеческий закон",
    "req": [
      "n7"
    ],
    "next": [
      "n49",
      "n50",
      "n48"
    ],
    "title": null,
    "x": 335,
    "y": 1235,
    "lvl": 13,
    "subtree": "Государство"
  },
  {
    "id": "n29",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Криптобюрократия\nСложность: 4\nЭффект: Пропаганда +2, Контршпионаж +6",
    "name": "Криптобюрократия",
    "req": [
      "n33",
      "n4"
    ],
    "next": [
      "n51"
    ],
    "title": null,
    "x": 615.84,
    "y": 775,
    "lvl": 8,
    "subtree": "Государство"
  },
  {
    "id": "n30",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Мастерская мемов\nСложность: 3\nЭффект: Производство +3",
    "name": "Мастерская мемов",
    "req": [
      "n77"
    ],
    "next": [
      "n82"
    ],
    "title": "Глянул мем - и нет проблем!",
    "x": 908.02,
    "y": 683,
    "lvl": 7,
    "subtree": "Социология"
  },
  {
    "id": "n31",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Бюро пропаганды\nСложность: 1\nЭффект: Пропаганда +2",
    "name": "Бюро пропаганды",
    "req": [
      "n12"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 315,
    "lvl": 3,
    "subtree": "Социология"
  },
  {
    "id": "n32",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Музей Старой Земли\nСложность: 1\nЭффект: Пропаганда +2",
    "name": "Музей Старой Земли",
    "req": [
      "n13"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 223,
    "lvl": 2,
    "subtree": "Социология"
  },
  {
    "id": "n33",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Контролируемая криптоанархия\nСложность: 3, тех. Самообучение\nЭффект: Наука +3",
    "name": "Контролируемая криптоанархия",
    "req": [
      "n71"
    ],
    "next": [
      "n29"
    ],
    "title": null,
    "x": 615.84,
    "y": 683,
    "lvl": 7,
    "subtree": "Государство"
  },
  {
    "id": "n34",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Средства массовой информации\nСложность: 1\nЭффект: Общество +1",
    "name": "Средства массовой информации",
    "req": [
      "n1"
    ],
    "next": [],
    "title": null,
    "x": 615.84,
    "y": 315,
    "lvl": 3,
    "subtree": "Государство"
  },
  {
    "id": "n35",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Культ личности\nСложность: 2\nЭффект: разово +2 очка опыта\nлидеру колонии",
    "name": "Культ личности",
    "req": [
      "n23"
    ],
    "next": [],
    "title": null,
    "x": 905.59,
    "y": 499,
    "lvl": 5,
    "subtree": "Социология"
  },
  {
    "id": "n36",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Управление экстренных ситуаций\nСложность: 2, специалисты(1)\nЭффект: Резерв +1",
    "name": "Управление экстренных ситуаций",
    "req": [
      "n2"
    ],
    "next": [],
    "title": null,
    "x": 615.84,
    "y": 407,
    "lvl": 4,
    "subtree": "Государство"
  },
  {
    "id": "n37",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Целевой отбор\nСложность: 1, :не более 4 Великих людей\nЭффект: разово +1 великий человек",
    "name": "Целевой отбор",
    "req": [
      "n0"
    ],
    "next": [],
    "title": null,
    "x": 52.13,
    "y": 315,
    "lvl": 3,
    "subtree": "Государство"
  },
  {
    "id": "n38",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Армейский призыв\nСложность: 2, осуждение (2)\nЭффект: Создание армий +5",
    "name": "Армейский призыв",
    "req": [
      "n2"
    ],
    "next": [],
    "title": null,
    "x": 52.13,
    "y": 499,
    "lvl": 5,
    "subtree": "Государство"
  },
  {
    "id": "n39",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Военная экономика\nСложность: 5\nЭффект: :Производство +8\nв военное время",
    "name": "Военная экономика",
    "req": [
      "n6"
    ],
    "next": [],
    "title": null,
    "x": 50.92,
    "y": 1051,
    "lvl": 11,
    "subtree": "Государство"
  },
  {
    "id": "n40",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Совет колонии\nСложность: 1\nЭффект: Общество +1",
    "name": "Совет колонии",
    "req": [
      "n17"
    ],
    "next": [],
    "title": null,
    "x": 615.84,
    "y": 132,
    "lvl": 1,
    "subtree": "Государство"
  },
  {
    "id": "n41",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Биотерпимость\nСложность: 3, волнения(2), :нельзя Хром\nЭффект: :древо Генетики\nне приносит осуждения",
    "name": "Биотерпимость",
    "req": [
      "n22"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 588,
    "lvl": 6,
    "subtree": "Социология"
  },
  {
    "id": "n45",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Социальное моделирование\nСложность: 5, \nтех. Многомерные вычисления\nЭффект: Общество +5",
    "name": "Социальное моделирование",
    "req": [
      "n78"
    ],
    "next": [
      "n52",
      "n89"
    ],
    "title": null,
    "x": 1195.34,
    "y": 1143,
    "lvl": 12,
    "subtree": "Социология"
  },
  {
    "id": "n46",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Пожизненные контракты\nСложность: 3, осуждение (3)\nЭффект: Производство +3",
    "name": "Пожизненные контракты",
    "req": [
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 52.13,
    "y": 588,
    "lvl": 6,
    "subtree": "Государство"
  },
  {
    "id": "n47",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Цифровая юриспруденция\nСложность: 4, тех. Софогенез\nЭффект: Общество +4",
    "name": "Цифровая юриспруденция",
    "req": [
      "n5"
    ],
    "next": [
      "n19"
    ],
    "title": null,
    "x": 615.84,
    "y": 959,
    "lvl": 10,
    "subtree": "Государство"
  },
  {
    "id": "n48",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Индивидуализация законодательства\nСложность: 6\nЭффект: Общество +10, Контршпионаж -8",
    "name": "Индивидуализация законодательства",
    "req": [
      "n28"
    ],
    "next": [],
    "title": "\"Каждый индивидуум имеет право... на форк законодательства и внесение в него... не противоречащих настоящей Конституции изменений\"\n– Конституция Сообщества, п. 19",
    "x": 615.84,
    "y": 1327,
    "lvl": 14,
    "subtree": "Государство"
  },
  {
    "id": "n49",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Незримое государство\nСложность: 6, тех. Компьютроний\nЭффект: Общество +6",
    "name": "Незримое государство",
    "req": [
      "n28"
    ],
    "next": [
      "n55",
      "n95",
      "n98"
    ],
    "title": "\"Каждый гражданин имеет право на свободу... от явных проявлений государства\"\n – Конституция Сообщества, п.4",
    "x": 335,
    "y": 1327,
    "lvl": 14,
    "subtree": "Государство"
  },
  {
    "id": "n50",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Монокультура\nСложность: 6\nЭффект: Пропаганда +6, Шпионаж +6",
    "name": "Монокультура",
    "req": [
      "n28"
    ],
    "next": [],
    "title": "И ЭТО НАШЕ СЛОВО! АМИНЬ!",
    "x": 50.92,
    "y": 1327,
    "lvl": 14,
    "subtree": "Государство"
  },
  {
    "id": "n51",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Всеобщее шифрование\nСложность: 4\nЭффект: Общество +4, \nвзлом систем связи невозможен",
    "name": "Всеобщее шифрование",
    "req": [
      "n29"
    ],
    "next": [],
    "title": null,
    "x": 615.84,
    "y": 867,
    "lvl": 9,
    "subtree": "Государство"
  },
  {
    "id": "n52",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Оптимизация мышления\nСложность: 5, осуждение (5)\nЭффект: Производство +5",
    "name": "Оптимизация мышления",
    "req": [
      "n45"
    ],
    "next": [
      "n53",
      "n84",
      "n88"
    ],
    "title": null,
    "x": 1195.34,
    "y": 1235,
    "lvl": 13,
    "subtree": "Социология"
  },
  {
    "id": "n53",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Клиодинамика\nСложность: 6, осуждение (6)\nЭффект: Общество +6",
    "name": "Клиодинамика",
    "req": [
      "n52"
    ],
    "next": [
      "n85",
      "n86",
      "n101"
    ],
    "title": null,
    "x": 1195.34,
    "y": 1327,
    "lvl": 14,
    "subtree": "Социология"
  },
  {
    "id": "n54",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Трансцендентная дипломатия\nСложность: 6\nЭффект: :договороспособность \nпри общении с трансцендентным разумом",
    "name": "Трансцендентная дипломатия",
    "req": [
      "n85"
    ],
    "next": [],
    "title": "Это что-то вроде мяуканья кошки. \nНе то чтобы тот же уровень, но трансцендентный ИИ должен примерно понять. \nСюда же от души напихано того, что с  должно выглядеть ювенальщиной и умильностью\n - просто на случай, если над нами уже занесли странглетовый тапок.",
    "x": 905.59,
    "y": 1511,
    "lvl": 16,
    "subtree": "Социология"
  },
  {
    "id": "n55",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Vox Populi\nСложность: 6, тех. Машинная телепатия\nЭффект: Общество +6",
    "name": "Vox Populi",
    "req": [
      "n49"
    ],
    "next": [
      "n111"
    ],
    "title": "Желания народа - закон для государства.",
    "x": 335,
    "y": 1419,
    "lvl": 15,
    "subtree": "Государство"
  },
  {
    "id": "n65",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Музей ксеноцивилизаций\nСложность: 1, :ксеноартефакты\nЭффект: Общество +1",
    "name": "Музей ксеноцивилизаций",
    "req": [
      "n13"
    ],
    "next": [],
    "title": null,
    "x": 908.02,
    "y": 223,
    "lvl": 2,
    "subtree": "Социология"
  },
  {
    "id": "n66",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "  Институт Экспериментальной Истории\nСложность: 4\nЭффект: :+9 кубов к взаимодействию с \nменее развитыми цивилизациями",
    "name": "Институт Экспериментальной Истории",
    "req": [
      "n110"
    ],
    "next": [
      "n15"
    ],
    "title": null,
    "x": 905.59,
    "y": 959,
    "lvl": 10,
    "subtree": "Социология"
  },
  {
    "id": "n69",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Понимание ИИ\nСложность: 5, тех. Сильный ИИ\nЭффект: Наука +5",
    "name": "Понимание ИИ",
    "req": [
      "n78"
    ],
    "next": [
      "n100"
    ],
    "title": null,
    "x": 905.59,
    "y": 1143,
    "lvl": 12,
    "subtree": "Социология"
  },
  {
    "id": "n70",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Спящие агенты\nСложность: 3\nЭффект: Шпионаж +6",
    "name": "Спящие агенты",
    "req": [
      "n77"
    ],
    "next": [
      "n96"
    ],
    "title": null,
    "x": 1485.09,
    "y": 683,
    "lvl": 7,
    "subtree": "Социология"
  },
  {
    "id": "n71",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Постземная экономика\nСложность: 3\nЭффект: Производство +3",
    "name": "Постземная экономика",
    "req": [
      "n3"
    ],
    "next": [
      "n72",
      "n33",
      "n91"
    ],
    "title": null,
    "x": 335,
    "y": 588,
    "lvl": 6,
    "subtree": "Государство"
  },
  {
    "id": "n72",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Государственное планирование\nСложность: 3, тех. Софогенез\nЭффект: Производство +3",
    "name": "Государственное планирование",
    "req": [
      "n71"
    ],
    "next": [],
    "title": null,
    "x": 48.78,
    "y": 683,
    "lvl": 7,
    "subtree": "Государство"
  },
  {
    "id": "n73",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Монумент двадцать первого века\nСложность: 2\nЭффект: Пропаганда +2,\nразово Доверие +1",
    "name": "Монумент двадцать первого века",
    "req": [
      "n2"
    ],
    "next": [],
    "title": "По шкале Кардашева колония сравнялась с началом 21 века на Земле. Ура!",
    "x": 615.84,
    "y": 499,
    "lvl": 5,
    "subtree": "Государство"
  },
  {
    "id": "n74",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Центр гражданской обороны\nСложность: 1\nЭффект: Устранение последствий +2",
    "name": "Центр гражданской обороны",
    "req": [
      "n0"
    ],
    "next": [],
    "title": null,
    "x": 55.78,
    "y": 223,
    "lvl": 2,
    "subtree": "Государство"
  },
  {
    "id": "n75",
    "type": "octagon",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Ополчение\nСложность: 2\nЭффект: пехота, 1 слот",
    "name": "Ополчение",
    "req": [
      "n17"
    ],
    "next": [],
    "title": null,
    "x": 55.78,
    "y": 132,
    "lvl": 1,
    "subtree": "Государство"
  },
  {
    "id": "n76",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Идеальный мем\nСложность: 200\nЭффект: победа",
    "name": "Идеальный мем",
    "req": [
      "n85"
    ],
    "next": [],
    "title": "\"Разным людям кажутся интересными и достойными распространения разные вещи.\nНо невзирая на разные культуры, разные языки, разную морфологию сознания... \nВсегда есть некий общий фундамент. Фундамент, который мы смогли найти и  захватить.\"",
    "x": 1195.34,
    "y": 1511,
    "lvl": 16,
    "subtree": "Социология"
  },
  {
    "id": "n77",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Прикладная меметика\nСложность: 3, тех. Самообучение\nЭффект: +1 свободный куб, Пропаганда +1",
    "name": "Прикладная меметика",
    "req": [
      "n22"
    ],
    "next": [
      "n30",
      "n70",
      "n109"
    ],
    "title": null,
    "x": 1195.34,
    "y": 588,
    "lvl": 6,
    "subtree": "Социология"
  },
  {
    "id": "n78",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Теория сознания\nСложность: 5, осуждение (5)\nЭффект: Дипломатия +10",
    "name": "Теория сознания",
    "req": [
      "n8"
    ],
    "next": [
      "n79",
      "n45",
      "n69"
    ],
    "title": null,
    "x": 1195.34,
    "y": 1051,
    "lvl": 11,
    "subtree": "Социология"
  },
  {
    "id": "n79",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Клиника психохирургии\nСложность: 5\nЭффект: Общество +5",
    "name": "Клиника психохирургии",
    "req": [
      "n78"
    ],
    "next": [],
    "title": "То, на что раньше требовались годы психотерапии, теперь делается за несколько психохирургических вмешательств. А если личность изменилась слишком сильно - ну что ж, всегда можно вернуть всё назад.",
    "x": 1485.09,
    "y": 1143,
    "lvl": 12,
    "subtree": "Социология"
  },
  {
    "id": "n81",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Мнемогенез\nСложность: 4\nЭффект: +2 свободных куба,\nразово бесплатная технология",
    "name": "Мнемогенез",
    "req": [
      "n18"
    ],
    "next": [
      "n8"
    ],
    "title": null,
    "x": 1195.34,
    "y": 867,
    "lvl": 9,
    "subtree": "Социология"
  },
  {
    "id": "n82",
    "type": "fatarrow",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Мемопроектор\nСложность: 4\nЭффект: Атака 8, ужас",
    "name": "Мемопроектор",
    "req": [
      "n30"
    ],
    "next": [],
    "title": "Смертельные мемы",
    "x": 908.02,
    "y": 775,
    "lvl": 8,
    "subtree": "Социология"
  },
  {
    "id": "n83",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Частные военные компании\nСложность: 3\nЭффект: :при успехе на 1д10\nне растёт Осуждение от потери отряда",
    "name": "Частные военные компании",
    "req": [
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 615.84,
    "y": 588,
    "lvl": 6,
    "subtree": "Государство"
  },
  {
    "id": "n84",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Клиника рекомбинации разума\nСложность: 6\nЭффект: Наука +6",
    "name": "Клиника рекомбинации разума",
    "req": [
      "n52"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 1327,
    "lvl": 14,
    "subtree": "Социология"
  },
  {
    "id": "n85",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Единая теория разума\nСложность: 6\nЭффект: :+12 кубов к взаимодействию \nс нечеловеческим разумом",
    "name": "Единая теория разума",
    "req": [
      "n53"
    ],
    "next": [
      "n76",
      "n54",
      "n99"
    ],
    "title": null,
    "x": 1195.34,
    "y": 1419,
    "lvl": 15,
    "subtree": "Социология"
  },
  {
    "id": "n86",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Поддержание пассионарности\nСложность: 7, осуждение (5)\nЭффект: Общество +7, :обществу \nне грозит стагнация",
    "name": "Поддержание пассионарности",
    "req": [
      "n53"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 1419,
    "lvl": 15,
    "subtree": "Социология"
  },
  {
    "id": "n87",
    "type": "hexagon",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Стелларнет\nСложность: 5, любая тех. FTL-связи\nЭффект: :произвольное распределение\nкубов Общества по ЗС",
    "name": "Стелларнет",
    "req": [
      "n7"
    ],
    "next": [],
    "title": null,
    "x": 615.84,
    "y": 1235,
    "lvl": 13,
    "subtree": "Государство"
  },
  {
    "id": "n88",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#000000",
    "fullText": "Космические бродяги\nСложность: 6\nЭффект: :Общество +1 на каждом \n корабле стоимости 2+",
    "name": "Космические бродяги",
    "req": [
      "n52"
    ],
    "next": [],
    "title": null,
    "x": 905.59,
    "y": 1327,
    "lvl": 14,
    "subtree": "Социология"
  },
  {
    "id": "n89",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Просчет реакций\nСложность: 5\nЭффект: Шпионаж +5, Дипломатия +5",
    "name": "Просчет реакций",
    "req": [
      "n45"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 1235,
    "lvl": 13,
    "subtree": "Социология"
  },
  {
    "id": "n90",
    "type": "trapezoid",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Строительные батальоны\nСложность: 4\nЭффект: :удваивает кубы \nпри строительстве этой Армией",
    "name": "Строительные батальоны",
    "req": [
      "n91"
    ],
    "next": [],
    "title": null,
    "x": 48.78,
    "y": 775,
    "lvl": 8,
    "subtree": "Государство"
  },
  {
    "id": "n91",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Почетная обязанность\nСложность: 3\nЭффект: Конверсия +3, Пропаганда +3",
    "name": "Почетная обязанность",
    "req": [
      "n71"
    ],
    "next": [
      "n4",
      "n90"
    ],
    "title": null,
    "x": 335,
    "y": 683,
    "lvl": 7,
    "subtree": "Государство"
  },
  {
    "id": "n92",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Права ИИ\nСложность: 5, тех. Сильный ИИ\nЭффект: разово 1 великий человек-ИИ",
    "name": "Права ИИ",
    "req": [
      "n93",
      "n19"
    ],
    "next": [
      "n100"
    ],
    "title": null,
    "x": 615.84,
    "y": 1143,
    "lvl": 12,
    "subtree": "Государство"
  },
  {
    "id": "n93",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Неоправо\nСложность: 5\nЭффект: Общество +5",
    "name": "Неоправо",
    "req": [
      "n6"
    ],
    "next": [
      "n7",
      "n92",
      "n94"
    ],
    "title": null,
    "x": 335,
    "y": 1051,
    "lvl": 11,
    "subtree": "Государство"
  },
  {
    "id": "n94",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Лоббирование\nСложность: 5, осуждение(5)\nЭффект: Производство +5",
    "name": "Лоббирование",
    "req": [
      "n93"
    ],
    "next": [],
    "title": null,
    "x": 50.92,
    "y": 1143,
    "lvl": 12,
    "subtree": "Государство"
  },
  {
    "id": "n95",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Улей\nСложность: 10\nЭффект: Производство +7,\nКонтршпионаж +6",
    "name": "Улей",
    "req": [
      "n49"
    ],
    "next": [],
    "title": "Человек не пчелка... Он лучше.",
    "x": 50.92,
    "y": 1419,
    "lvl": 15,
    "subtree": "Государство"
  },
  {
    "id": "n96",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Боевой транс\nСложность: 4\nЭффект: Атака армий +5,\nСкорость армий +4",
    "name": "Боевой транс",
    "req": [
      "n70"
    ],
    "next": [
      "n108"
    ],
    "title": null,
    "x": 1485.09,
    "y": 775,
    "lvl": 8,
    "subtree": "Социология"
  },
  {
    "id": "n97",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Институт социологии\nСложность: 1\nЭффект: +2 к ветви \"Социология\"",
    "name": "Институт социологии",
    "req": [
      "n13"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 132,
    "lvl": 1,
    "subtree": "Социология"
  },
  {
    "id": "n98",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Адхократия\nСложность: 6\nЭффект: Общество +4, Наука +2,\n:адаптивная псведоанархия",
    "name": "Адхократия",
    "req": [
      "n49"
    ],
    "next": [],
    "title": "Необходимые государственные структуры - возникают и распадаются, как только в них исчезнет нужда. ",
    "x": 615.84,
    "y": 1419,
    "lvl": 15,
    "subtree": "Государство"
  },
  {
    "id": "n99",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Тихая гавань\nСложность: 6, :повторяемо\nЭффект: Общество +4, \n+1 свободный куб",
    "name": "Тихая гавань",
    "req": [
      "n85"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 1511,
    "lvl": 16,
    "subtree": "Социология"
  },
  {
    "id": "n100",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "ИИ-компаньоны\nСложность: 6, приз\nЭффект: +4 свободных куба",
    "name": "ИИ-компаньоны",
    "req": [
      "n69",
      "n92"
    ],
    "next": [],
    "title": "Друг и помощник, который всегда с тобой",
    "x": 905.59,
    "y": 1235,
    "lvl": 13,
    "subtree": "Социология"
  },
  {
    "id": "n101",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Центр социального прогнозирования\nСложность: 6\nЭффект: :позволяет использовать\nНауку для бросков Общества",
    "name": "Центр социального прогнозирования",
    "req": [
      "n53"
    ],
    "next": [],
    "title": null,
    "x": 905.59,
    "y": 1419,
    "lvl": 15,
    "subtree": "Социология"
  },
  {
    "id": "n102",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#FF0000",
    "fullText": "Рекреационные зоны\nСложность: 1\nЭффект: Общество +1",
    "name": "Рекреационные зоны",
    "req": [
      "n13"
    ],
    "next": [],
    "title": null,
    "x": 908.02,
    "y": 132,
    "lvl": 1,
    "subtree": "Социология"
  },
  {
    "id": "n103",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Зов прародины\nСложность: 5, :пуризм\nЭффект: Создание флотов +5,\n:Создание модулей +5",
    "name": "Зов прародины",
    "req": [
      "n8"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 1051,
    "lvl": 11,
    "subtree": "Социология"
  },
  {
    "id": "n104",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Культура хрома\nСложность: 2, волнения(1), :нельзя ГМО\nЭффект: :древо Импланты\nне приносит осуждения",
    "name": "Культура хрома",
    "req": [
      "n20"
    ],
    "next": [],
    "title": null,
    "x": 1485.09,
    "y": 499,
    "lvl": 5,
    "subtree": "Социология"
  },
  {
    "id": "n105",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Независимые исследователи\nСложность: 1, осуждение(2)\nЭффект: Наука +1",
    "name": "Независимые исследователи",
    "req": [
      "n14"
    ],
    "next": [],
    "title": "\"Ребята полезные, но очень уж свободолюбивые\"",
    "x": 908.02,
    "y": 315,
    "lvl": 3,
    "subtree": "Социология"
  },
  {
    "id": "n107",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#000000",
    "fullText": "Мемплекс-вещание\nСложность: 5, приз\nЭффект: Производство +5, \n+1 свободный куб",
    "name": "Мемплекс-вещание",
    "req": [
      "n108"
    ],
    "next": [],
    "title": "Во всех помещениях колонии теперь стоит гул, похожий на мешанину странных слов из подсознания. \nДля неподготовленного человека он - источник постоянной головной боли;\nдля подготовленного - анегльское пение, несущее в себе всю необходимую для работы \nи жизни информацию в предельно сконцентрированной форме",
    "x": 1485.09,
    "y": 959,
    "lvl": 10,
    "subtree": "Социология"
  },
  {
    "id": "n108",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Состояние безветрия\nСложность: 4\nЭффект: Наука +3,\nЗащита колонии +2",
    "name": "Состояние безветрия",
    "req": [
      "n96"
    ],
    "next": [
      "n107"
    ],
    "title": "Медитации занимают все более серьезное место в жизни колонии. \nЭто помогает избегать стрессов, характерных для постиндустриального общества, и спокойно переносить самые страшные удары судьбы.",
    "x": 1485.09,
    "y": 867,
    "lvl": 9,
    "subtree": "Социология"
  },
  {
    "id": "n109",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Новый институт семьи\nСложность: 3, осуждение(6)\nЭффект: Общество +3",
    "name": "Новый институт семьи",
    "req": [
      "n77"
    ],
    "next": [
      "n18"
    ],
    "title": "Или скорее адаптация семьи к реалиям постиндустриального общества. \nКак оставить приемлемым социальное давление и в то же время обеспечить коэффициент рождаемости хотя бы на уровне воспроизводства?\nСложный комплекс мер государственной поддержки, суррогатное материнство и развитая сеть интернатов дадут ответ.\nНе факт, правда, что он вам понравится...",
    "x": 1195.34,
    "y": 683,
    "lvl": 7,
    "subtree": "Социология"
  },
  {
    "id": "n110",
    "type": "rectangle",
    "treeName": "Sociology",
    "borderColor": "#00FF00",
    "fullText": "Универсальный переводчик\nСложность: 4, тех. Нанокомпьютеры\nЭффект: Дипломатия +8,\n:общение с любым ксеноскамом",
    "name": "Универсальный переводчик",
    "req": [
      "n18"
    ],
    "next": [
      "n66"
    ],
    "title": "Скорее методологический комплекс и модели, чем конкретное устройство",
    "x": 905.59,
    "y": 867,
    "lvl": 9,
    "subtree": "Социология"
  },
  {
    "id": "n111",
    "type": "parallelogram",
    "treeName": "Sociology",
    "borderColor": "#000000",
    "fullText": "Акрогород\nСложность: 6, :повторяемое\nЭффект: Общество +4,\nПроизводство +2",
    "name": "Акрогород",
    "req": [
      "n55"
    ],
    "next": [],
    "title": "Идеальный город Райта",
    "x": 335,
    "y": 1511,
    "lvl": 16,
    "subtree": "Государство"
  },
  {
    "id": "n0",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Экзобиология\nСложность: 1\nЭффект: Наука +1",
    "name": "Экзобиология",
    "req": [
      "n1"
    ],
    "next": [
      "n8",
      "n6",
      "n36"
    ],
    "title": null,
    "x": 214.79,
    "y": 177,
    "lvl": 2,
    "subtree": "Экзобиология"
  },
  {
    "id": "n1",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Оценка внешней среды\nСложность: 1\nЭффект: Наука +1",
    "name": "Оценка внешней среды",
    "req": [],
    "next": [
      "n0",
      "n5",
      "n34",
      "n35"
    ],
    "title": null,
    "x": 214.79,
    "y": 85,
    "lvl": 1,
    "subtree": "Экзобиология"
  },
  {
    "id": "n2",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Секвенирование ДНК\nСложность: 1, :Общество не менее 2\nЭффект: Генные модификации +2",
    "name": "Секвенирование ДНК",
    "req": [],
    "next": [
      "n3",
      "n4",
      "n77"
    ],
    "title": null,
    "x": 1081.52,
    "y": 85,
    "lvl": 1,
    "subtree": "Генетика"
  },
  {
    "id": "n3",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Генная терапия\nСложность: 1\nЭффект: Общество +1",
    "name": "Генная терапия",
    "req": [
      "n2"
    ],
    "next": [
      "n7",
      "n31",
      "n83",
      "n51"
    ],
    "title": null,
    "x": 1081.52,
    "y": 177,
    "lvl": 2,
    "subtree": "Генетика"
  },
  {
    "id": "n4",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Генное планирование\nСложность: 1, осуждение (1)\nЭффект: +1 свободный куб, ГМО +1",
    "name": "Генное планирование",
    "req": [
      "n2"
    ],
    "next": [
      "n45"
    ],
    "title": null,
    "x": 795.25,
    "y": 85,
    "lvl": 1,
    "subtree": "Генетика"
  },
  {
    "id": "n5",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Оценка биосферы\nСложность: 1, образцы (1)\nЭффект: Взаимодействие\nс местной биосферой +1",
    "name": "Оценка биосферы",
    "req": [
      "n1"
    ],
    "next": [
      "n8"
    ],
    "title": null,
    "x": 505.5,
    "y": 177,
    "lvl": 2,
    "subtree": "Экзобиология"
  },
  {
    "id": "n6",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Инопланетное сельское хозяйство\nСложность: 1\nЭффект: Общество +1",
    "name": "Инопланетное сельское хозяйство",
    "req": [
      "n0"
    ],
    "next": [
      "n40",
      "n46"
    ],
    "title": null,
    "x": 214.79,
    "y": 269,
    "lvl": 3,
    "subtree": "Экзобиология"
  },
  {
    "id": "n7",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Генная модификация населения\nСложность: 1\nЭффект: Генные модификации +2,\n:доступны искусственные матки",
    "name": "Генная модификация населения",
    "req": [
      "n3"
    ],
    "next": [
      "n43",
      "n68",
      "n10"
    ],
    "title": null,
    "x": 1081.52,
    "y": 269,
    "lvl": 3,
    "subtree": "Генетика"
  },
  {
    "id": "n8",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Оценка свойств местных организмов\nСложность: 1\nЭффект: Взаимодействие\nс местной биосферой +2",
    "name": "Оценка свойств местных организмов",
    "req": [
      "n0",
      "n5"
    ],
    "next": [
      "n17",
      "n43"
    ],
    "title": "«Мы, прах умирающего мира, должны прислушиваться к живому»\n– Кавита Такур, \"Сутра Исхода\"",
    "x": 505.5,
    "y": 269,
    "lvl": 3,
    "subtree": "Экзобиология"
  },
  {
    "id": "n9",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Адаптация земных микроорганизмов\nСложность: 2, непривычная среда (1)\nЭффект: Терраформинг +3",
    "name": "Адаптация земных микроорганизмов",
    "req": [
      "n10"
    ],
    "next": [
      "n14"
    ],
    "title": null,
    "x": 791.77,
    "y": 453,
    "lvl": 5,
    "subtree": "Генетика"
  },
  {
    "id": "n10",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Новые организмы\nСложность: 2\nЭффект: Наука +2",
    "name": "Новые организмы",
    "req": [
      "n7"
    ],
    "next": [
      "n18",
      "n73",
      "n9"
    ],
    "title": null,
    "x": 1081.52,
    "y": 361,
    "lvl": 4,
    "subtree": "Генетика"
  },
  {
    "id": "n11",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Направленная эволюция\nСложность: 3, осуждение (3)\nЭффект: +2 свободных куба",
    "name": "Направленная эволюция",
    "req": [
      "n18"
    ],
    "next": [
      "n13",
      "n20",
      "n44"
    ],
    "title": null,
    "x": 1081.52,
    "y": 545,
    "lvl": 6,
    "subtree": "Генетика"
  },
  {
    "id": "n12",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Экзопочвоведение\nСложность: 2\nЭффект: Наука +2",
    "name": "Экзопочвоведение",
    "req": [
      "n40"
    ],
    "next": [
      "n14",
      "n74",
      "n84"
    ],
    "title": null,
    "x": 214.79,
    "y": 453,
    "lvl": 5,
    "subtree": "Экзобиология"
  },
  {
    "id": "n13",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Искусственные помощники\nСложность: 3\nЭффект: Общество +3",
    "name": "Искусственные помощники",
    "req": [
      "n11"
    ],
    "next": [
      "n15",
      "n91"
    ],
    "title": null,
    "x": 1081.52,
    "y": 637,
    "lvl": 7,
    "subtree": "Генетика"
  },
  {
    "id": "n14",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Адаптация земных растений\nСложность: 3, непривычная среда (1)\nЭффект: :убирает \nусловие неподходящей почвы",
    "name": "Адаптация земных растений",
    "req": [
      "n9",
      "n12"
    ],
    "next": [
      "n52"
    ],
    "title": null,
    "x": 505.5,
    "y": 545,
    "lvl": 6,
    "subtree": "Экзобиология"
  },
  {
    "id": "n15",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Тотальная перестройка генома\nСложность: 4\nЭффект: Наука +4,\n неуязвимость к обычным болезням, ГМО +2",
    "name": "Тотальная перестройка генома",
    "req": [
      "n13"
    ],
    "next": [
      "n22",
      "n37",
      "n109"
    ],
    "title": null,
    "x": 1081.52,
    "y": 729,
    "lvl": 8,
    "subtree": "Генетика"
  },
  {
    "id": "n16",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Биологические наноматериалы\nСложность: 4, специалисты(1)\nЭффект: Производство +4",
    "name": "Биологические наноматериалы",
    "req": [
      "n42"
    ],
    "next": [
      "n69",
      "n86"
    ],
    "title": null,
    "x": 214.79,
    "y": 729,
    "lvl": 8,
    "subtree": "Экзобиология"
  },
  {
    "id": "n17",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Ксенопитомник\nСложность: 3, образцы (1)\nЭффект: Взаимодействие\nс местной биосферой +4",
    "name": "Ксенопитомник",
    "req": [
      "n8"
    ],
    "next": [
      "n80"
    ],
    "title": null,
    "x": 505.5,
    "y": 361,
    "lvl": 4,
    "subtree": "Экзобиология"
  },
  {
    "id": "n18",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Теория экстремофилии\nСложность: 2, тех. Пусковые технологии\nЭффект: Наука +2",
    "name": "Теория экстремофилии",
    "req": [
      "n10"
    ],
    "next": [
      "n11",
      "n26",
      "n19"
    ],
    "title": null,
    "x": 1081.52,
    "y": 453,
    "lvl": 5,
    "subtree": "Генетика"
  },
  {
    "id": "n19",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Пантропия\nСложность: 3, осуждение (3)\nЭффект: Общество +1,\nАдаптация +2, ГМО +1",
    "name": "Пантропия",
    "req": [
      "n18"
    ],
    "next": [
      "n20"
    ],
    "title": null,
    "x": 791.77,
    "y": 545,
    "lvl": 6,
    "subtree": "Генетика"
  },
  {
    "id": "n20",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Сверхчеловеческая адаптация\nСложность: 3, осуждение (3)\nЭффект: Сверхадаптация +1, ГМО +2",
    "name": "Сверхчеловеческая адаптация",
    "req": [
      "n19",
      "n11"
    ],
    "next": [
      "n21"
    ],
    "title": null,
    "x": 791.77,
    "y": 637,
    "lvl": 7,
    "subtree": "Генетика"
  },
  {
    "id": "n21",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Пустотная адаптация\nСложность: 4\nЭффект: Сверхадаптация +2, ГМО +2",
    "name": "Пустотная адаптация",
    "req": [
      "n20"
    ],
    "next": [],
    "title": null,
    "x": 791.77,
    "y": 729,
    "lvl": 8,
    "subtree": "Генетика"
  },
  {
    "id": "n22",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Морфологическая свобода\nСложность: 4, осуждение (4)\nЭффект: Общество +4, ГМО +2",
    "name": "Морфологическая свобода",
    "req": [
      "n15"
    ],
    "next": [
      "n23",
      "n38"
    ],
    "title": null,
    "x": 1081.52,
    "y": 821,
    "lvl": 9,
    "subtree": "Генетика"
  },
  {
    "id": "n23",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Когнитивная свобода\nСложность: 4\nЭффект: Наука +4, ГМО +2",
    "name": "Когнитивная свобода",
    "req": [
      "n22"
    ],
    "next": [
      "n96",
      "n102"
    ],
    "title": null,
    "x": 1081.52,
    "y": 913,
    "lvl": 10,
    "subtree": "Генетика"
  },
  {
    "id": "n24",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Постчеловеческие нейронные организации\nСложность: 5, осуждение (5)\nЭффект: +2 свободных куба,\nВетвь \"Экзобиология\" +2, ГМО +3",
    "name": "Постчеловеческие нейронные организации",
    "req": [
      "n102"
    ],
    "next": [
      "n93",
      "n99",
      "n48"
    ],
    "title": null,
    "x": 1081.52,
    "y": 1097,
    "lvl": 12,
    "subtree": "Генетика"
  },
  {
    "id": "n25",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Скульпторы миров\nСложность: 6, тех. Управление гравитацией\nЭффект: Терраформинг +12",
    "name": "Скульпторы миров",
    "req": [
      "n97"
    ],
    "next": [
      "n47",
      "n104",
      "n110"
    ],
    "title": null,
    "x": 214.79,
    "y": 1281,
    "lvl": 14,
    "subtree": "Экзобиология"
  },
  {
    "id": "n26",
    "type": "octagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Биокатер\nСложность: 2\nЭффект: звездолёт, 2 слота, гигер,\nРемонт +1, нет FTL",
    "name": "Биокатер",
    "req": [
      "n18"
    ],
    "next": [],
    "title": null,
    "x": 1366.06,
    "y": 545,
    "lvl": 6,
    "subtree": "Генетика"
  },
  {
    "id": "n27",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Анализ экзотов\nСложность: 5, экзоты (1)\nЭффект: Общество +5",
    "name": "Анализ экзотов",
    "req": [
      "n70"
    ],
    "next": [
      "n28",
      "n103"
    ],
    "title": null,
    "x": 508.98,
    "y": 1005,
    "lvl": 11,
    "subtree": "Экзобиология"
  },
  {
    "id": "n28",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Использование экзотов\nСложность: 5, экзоты (1)\nЭффект: +2 свободных куба,\nНаука +1",
    "name": "Использование экзотов",
    "req": [
      "n27"
    ],
    "next": [
      "n72"
    ],
    "title": null,
    "x": 508.98,
    "y": 1097,
    "lvl": 12,
    "subtree": "Экзобиология"
  },
  {
    "id": "n29",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Бесконечная экспансия\nСложность: 5\nЭффект: +2 свободных куба, \n:при основании новых колоний",
    "name": "Бесконечная экспансия",
    "req": [
      "n50"
    ],
    "next": [
      "n82",
      "n97"
    ],
    "title": null,
    "x": 214.79,
    "y": 1097,
    "lvl": 12,
    "subtree": "Экзобиология"
  },
  {
    "id": "n30",
    "type": "ellipse",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Орбитальный сад\nСложность: 4\nЭффект: +2 свободных куба",
    "name": "Орбитальный сад",
    "req": [
      "n37"
    ],
    "next": [
      "n98"
    ],
    "title": null,
    "x": 795.25,
    "y": 913,
    "lvl": 10,
    "subtree": "Генетика"
  },
  {
    "id": "n31",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Генная клиника\nСложность: 1\nЭффект: Общество +1",
    "name": "Генная клиника",
    "req": [
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 793.51,
    "y": 269,
    "lvl": 3,
    "subtree": "Генетика"
  },
  {
    "id": "n34",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Станции наблюдения\nСложность: 1\nЭффект: Взаимодействие\nс местной биосферой +2",
    "name": "Станции наблюдения",
    "req": [
      "n1"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 177,
    "lvl": 2,
    "subtree": "Экзобиология"
  },
  {
    "id": "n35",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Добыча образцов местной жизни\nСложность: 1, :местная жизнь\nЭффект: Образцы +2",
    "name": "Добыча образцов местной жизни",
    "req": [
      "n1"
    ],
    "next": [],
    "title": null,
    "x": 505.1,
    "y": 85,
    "lvl": 1,
    "subtree": "Экзобиология"
  },
  {
    "id": "n36",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Институт экзобиологии\nСложность: 1\nЭффект: +2 куба\nк ветке \"Экзобиология\"",
    "name": "Институт экзобиологии",
    "req": [
      "n0"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 269,
    "lvl": 3,
    "subtree": "Экзобиология"
  },
  {
    "id": "n37",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Вакуумные растения\nСложность: 4\nЭффект: Общество +4",
    "name": "Вакуумные растения",
    "req": [
      "n15"
    ],
    "next": [
      "n30"
    ],
    "title": null,
    "x": 795.25,
    "y": 821,
    "lvl": 9,
    "subtree": "Генетика"
  },
  {
    "id": "n38",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Лестница Дедала\nСложность: 5, чудо\nЭффект: +1 свободный куб,\nВетка \"Генетика\" +7",
    "name": "Лестница Дедала",
    "req": [
      "n22"
    ],
    "next": [],
    "title": null,
    "x": 1366.91,
    "y": 913,
    "lvl": 10,
    "subtree": "Генетика"
  },
  {
    "id": "n39",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Ферма биополимеров\nСложность: 2\nЭффект: Производство +2",
    "name": "Ферма биополимеров",
    "req": [
      "n40"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 453,
    "lvl": 5,
    "subtree": "Экзобиология"
  },
  {
    "id": "n40",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Выращивание биополимеров\nСложность: 2\nЭффект: Производство +2",
    "name": "Выращивание биополимеров",
    "req": [
      "n6"
    ],
    "next": [
      "n39",
      "n12"
    ],
    "title": null,
    "x": 214.79,
    "y": 361,
    "lvl": 4,
    "subtree": "Экзобиология"
  },
  {
    "id": "n41",
    "type": "ellipse",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Орбитальные парники\nСложность: 4\nЭффект: Общество +4",
    "name": "Орбитальные парники",
    "req": [
      "n42"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 729,
    "lvl": 8,
    "subtree": "Экзобиология"
  },
  {
    "id": "n42",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Аэропоника\nСложность: 3\nЭффект: Общество +3",
    "name": "Аэропоника",
    "req": [
      "n74"
    ],
    "next": [
      "n41",
      "n16",
      "n111"
    ],
    "title": null,
    "x": 214.79,
    "y": 637,
    "lvl": 7,
    "subtree": "Экзобиология"
  },
  {
    "id": "n43",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Ксеносимбиоз\nСложность: 2, осуждение (2)\nЭффект: :+4 к дружественным действиям\nс инопланетной жизнью, ГМО +2",
    "name": "Ксеносимбиоз",
    "req": [
      "n8",
      "n7"
    ],
    "next": [],
    "title": null,
    "x": 793.51,
    "y": 361,
    "lvl": 4,
    "subtree": "Генетика"
  },
  {
    "id": "n44",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Возвышение неразумных\nСложность: 3, осуждение (3), образцы (1)\nЭффект: +1 свободный куб,\n:открывает создание полуразумных видов",
    "name": "Возвышение неразумных",
    "req": [
      "n11"
    ],
    "next": [],
    "title": null,
    "x": 1367.8,
    "y": 637,
    "lvl": 7,
    "subtree": "Генетика"
  },
  {
    "id": "n45",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Генетическая аристократия\nСложность: 1, осуждение (1)\nЭффект: разово +1 великий человек, ГМО +1",
    "name": "Генетическая аристократия",
    "req": [
      "n4"
    ],
    "next": [],
    "title": null,
    "x": 795.25,
    "y": 177,
    "lvl": 2,
    "subtree": "Генетика"
  },
  {
    "id": "n46",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Ксенофермы\nСложность: 2, образцы(1)\nЭффект: Общество +2",
    "name": "Ксенофермы",
    "req": [
      "n6"
    ],
    "next": [],
    "title": null,
    "x": -75.92,
    "y": 361,
    "lvl": 4,
    "subtree": "Экзобиология"
  },
  {
    "id": "n47",
    "type": "trapezoid2",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Станция геоглиптики\nСложность: 10, 5 слотов\nЭффект: :контроль \nнад Гористостью",
    "name": "Станция геоглиптики",
    "req": [
      "n25"
    ],
    "next": [],
    "title": "Станция выглядит как огромный решётчатый треугольник с тремя шарами гравитационных манипуляторов по углам и блоком управления в центре. \nОна даже способна на межпланетные и межзвёздные перелёты, правда только с использованием буксиров.\nПожирая до десяти тонн антиматерии в час, она перенаправляет потоки магмы в мантии планеты, а при необходимости даже разгоняет или замедляет ядро, \nчтобы добиться желаемого ландшафта и уровня тектонической активности. \nСтанция способна работать в двух режимах. В первом преобразования ведутся грубо и завершаются за месяц, но на поверхности выживает разве что планктон.\nВо втором же трансформация длится годами, и единственным её признаком остаётся низкий глухой гул, слышимый в любой точке планеты.\n\nК сведению: энергоёмкость около 1е30, зарядка от сферы Дайсона - полчаса. Должна была бы тащить на себе несколько гигатонн антиматерии.",
    "x": -74.96,
    "y": 1373,
    "lvl": 15,
    "subtree": "Экзобиология"
  },
  {
    "id": "n48",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Автоэволюция\nСложность: 5\nЭффект: +2 свободных куба, Экзоты +1",
    "name": "Автоэволюция",
    "req": [
      "n24"
    ],
    "next": [
      "n87",
      "n108"
    ],
    "title": null,
    "x": 1081.52,
    "y": 1189,
    "lvl": 13,
    "subtree": "Генетика"
  },
  {
    "id": "n49",
    "type": "ellipse",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Стандартный преобразователь\nСложность: 5, 2 слота\nЭффект: :контроль над Температурой",
    "name": "Стандартный преобразователь",
    "req": [
      "n50"
    ],
    "next": [],
    "title": "За этими скромными машинами, сопровождающими каждый колониальный корабль, скрывается титанический объём труда и воистину устращающая вычислительная и технологическая мощь.\nПосле развёртывания на вновь колонизированной планете они определяют и модифицируютусловия окружающей среды так, чтобы они соответствовали земным. Слишком высокая температура? \nВыброс одного из десятков видов спор покроет планету полуживым светоотражающим ковром в стратосфере. Слишком далеко от звезды и холодно? \nВ несколько запусков весьма скромной массы на орбите будет развёрнута прогревная линза, а ГМО-растения на планете выбросят в атмосферу  парниковые газы. \nНет атмосферы? Не беда, способные выжить в вакууме и жёстком излучении бактерии поглотят почву и переработают её в достаточные объёмы кислорода и азота за совершенно смешные пару лет.\n",
    "x": -74.96,
    "y": 1097,
    "lvl": 12,
    "subtree": "Экзобиология"
  },
  {
    "id": "n50",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Строительство биосферы\nСложность: 5\nЭффект: Терраформинг +10",
    "name": "Строительство биосферы",
    "req": [
      "n70"
    ],
    "next": [
      "n49",
      "n29",
      "n112"
    ],
    "title": null,
    "x": 214.79,
    "y": 1005,
    "lvl": 11,
    "subtree": "Экзобиология"
  },
  {
    "id": "n51",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Банк генов\nСложность: 1\nЭффект: +2 куба\nк ветке \"Генетика\"",
    "name": "Банк генов",
    "req": [
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 1371.27,
    "y": 177,
    "lvl": 2,
    "subtree": "Генетика"
  },
  {
    "id": "n52",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "НИИ Земной Жизни\nСложность: 3\nЭффект: Наука +3",
    "name": "НИИ Земной Жизни",
    "req": [
      "n14"
    ],
    "next": [],
    "title": null,
    "x": 505.5,
    "y": 637,
    "lvl": 7,
    "subtree": "Экзобиология"
  },
  {
    "id": "n53",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Базовое жильё\nСложность: 1, базовое\nЭффект: выдаётся при высадке",
    "name": "Базовое жильё",
    "req": [],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 85,
    "lvl": 1,
    "subtree": "Экзобиология"
  },
  {
    "id": "n68",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Роение\nСложность: 2, осуждение(4)\nЭффект: Производство +2 , ГМО +1",
    "name": "Роение",
    "req": [
      "n7"
    ],
    "next": [],
    "title": "Просто химические метки и обмен данными с помощью органов ЭМ-ретранлсяции за ушами. Ничего такого, ага-ага.",
    "x": 1362.58,
    "y": 361,
    "lvl": 4,
    "subtree": "Генетика"
  },
  {
    "id": "n69",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Конструирование экосистем\nСложность: 4\nЭффект: Терраформинг +8",
    "name": "Конструирование экосистем",
    "req": [
      "n16"
    ],
    "next": [
      "n70",
      "n76",
      "n85",
      "n100"
    ],
    "title": null,
    "x": 214.79,
    "y": 821,
    "lvl": 9,
    "subtree": "Экзобиология"
  },
  {
    "id": "n70",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Неорганическая жизнь\nСложность: 4\nЭффект: Наука +4",
    "name": "Неорганическая жизнь",
    "req": [
      "n69"
    ],
    "next": [
      "n27",
      "n50"
    ],
    "title": null,
    "x": 214.79,
    "y": 913,
    "lvl": 10,
    "subtree": "Экзобиология"
  },
  {
    "id": "n71",
    "type": "octagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Звёздный лотос\nСложность: 7\nЭффект: хабитат, автономность, 6 слотов, \nгигер, +1 свободный куб",
    "name": "Звёздный лотос",
    "req": [
      "n89"
    ],
    "next": [],
    "title": "Эти громадные биостанции действительно напоминают лотос - исключительно по прихоти главного дизайнера проекта. \nОрганично совмещая в себе биологические, технологические и прочие компоненты, эти питаемые термоядерными реакторами и светом самой Галактики цветы\nмедленно дрейфуют в межзвёздной пустоте к одним им ведомым целям.",
    "x": 795.25,
    "y": 1373,
    "lvl": 15,
    "subtree": "Генетика"
  },
  {
    "id": "n72",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Конструирование экзотов\nСложность: 5\nЭффект: +2 свободных куба, Экзоты +1",
    "name": "Конструирование экзотов",
    "req": [
      "n28"
    ],
    "next": [
      "n101",
      "n89"
    ],
    "title": null,
    "x": 508.98,
    "y": 1189,
    "lvl": 13,
    "subtree": "Экзобиология"
  },
  {
    "id": "n73",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Живорастущие дома\nСложность: 2, тех. Выращивание биополимеров\nЭффект: :можно строить за Общество, ГМО +1",
    "name": "Живорастущие дома",
    "req": [
      "n10"
    ],
    "next": [],
    "title": "Можно строить наземные и орбитальные здания за Общество.\nПри этом они получают свойство \"гигер\"",
    "x": 1366.06,
    "y": 453,
    "lvl": 5,
    "subtree": "Генетика"
  },
  {
    "id": "n74",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Прикладная метеорология\nСложность: 3\nЭффект: Общество +2, Метеозащита +1",
    "name": "Прикладная метеорология",
    "req": [
      "n12"
    ],
    "next": [
      "n42",
      "n75"
    ],
    "title": null,
    "x": 214.79,
    "y": 545,
    "lvl": 6,
    "subtree": "Экзобиология"
  },
  {
    "id": "n75",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Станция контроля погоды\nСложность: 3\nЭффект: Метеозащита 1",
    "name": "Станция контроля погоды",
    "req": [
      "n74"
    ],
    "next": [],
    "title": "В каком-то смысле являясь более мощной версией HAARP, этот внушительных размеров комплекс  излучателей, метеорадаров и миномётных систем обеспечивает в покрываемой области приемлимое количество осадков и скорость ветра.\n\nВнимание - пригоден для борьбы с непривычной средой, но не чуждой! Кислотные облака и ветер под сто метров в секунду таким образом разогнать не получится.",
    "x": -74.96,
    "y": 637,
    "lvl": 7,
    "subtree": "Экзобиология"
  },
  {
    "id": "n76",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Мир смерти\nСложность: 4\nЭффект: :условия планеты считаются\nчуждыми (2) для неадаптированных",
    "name": "Мир смерти",
    "req": [
      "n69"
    ],
    "next": [],
    "title": "\"Вам здесь не рады\"",
    "x": 505.5,
    "y": 913,
    "lvl": 10,
    "subtree": "Экзобиология"
  },
  {
    "id": "n77",
    "type": "trapezoid2",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Биологическое оружие\nСложность: 2\nЭффект: Атака 2, \nбио",
    "name": "Биологическое оружие",
    "req": [
      "n2"
    ],
    "next": [],
    "title": null,
    "x": 1371.27,
    "y": 85,
    "lvl": 1,
    "subtree": "Генетика"
  },
  {
    "id": "n80",
    "type": "octagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Ксенокавалерия\nСложность: 2, :Чуждость не больше 1\nЭффект: пехота, 1 слот, гигер,\nСкорость +3",
    "name": "Ксенокавалерия",
    "req": [
      "n17"
    ],
    "next": [],
    "title": null,
    "x": 505.5,
    "y": 453,
    "lvl": 5,
    "subtree": "Экзобиология"
  },
  {
    "id": "n81",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Человек Абсолютный\nСложность: 400\nЭффект: победа",
    "name": "Человек Абсолютный",
    "req": [
      "n90"
    ],
    "next": [],
    "title": "\"Пока вы ютитесь в своих стальных скорлупках - мы парим меж звёзд\".\n\n\n\"А, да. ГЕНОПУРИСТЫ СОСАААААТЬ!\"",
    "x": 1081.52,
    "y": 1465,
    "lvl": 16,
    "subtree": "Генетика"
  },
  {
    "id": "n82",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Посев рудных бактерий\nСложность: 5\nЭффект: :+30 к кубу Ресурсов \nпланеты",
    "name": "Посев рудных бактерий",
    "req": [
      "n29"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 1189,
    "lvl": 13,
    "subtree": "Экзобиология"
  },
  {
    "id": "n83",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Адаптация к местным условиям\nСложность: 1\nЭффект: Адаптация +1",
    "name": "Адаптация к местным условиям",
    "req": [
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 1367.8,
    "y": 269,
    "lvl": 3,
    "subtree": "Генетика"
  },
  {
    "id": "n84",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Силикатные бактерии\nСложность: 3, непривычная среда (3)\nЭффект: :создаёт почву если её нет",
    "name": "Силикатные бактерии",
    "req": [
      "n12"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 545,
    "lvl": 6,
    "subtree": "Экзобиология"
  },
  {
    "id": "n85",
    "type": "parallelogram2",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Земная биосфера\nСложность: 4, \nтех. Адаптация земных растений\nЭффект: Свободный +2, :земная биосфера",
    "name": "Земная биосфера",
    "req": [
      "n69"
    ],
    "next": [
      "n112"
    ],
    "title": null,
    "x": -74.96,
    "y": 913,
    "lvl": 10,
    "subtree": "Экзобиология"
  },
  {
    "id": "n86",
    "type": "octagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Живые танки\nСложность: 4\nЭффект: танки, 3 слота, био, \nгигер",
    "name": "Живые танки",
    "req": [
      "n16"
    ],
    "next": [],
    "title": null,
    "x": 505.5,
    "y": 821,
    "lvl": 9,
    "subtree": "Экзобиология"
  },
  {
    "id": "n87",
    "type": "trapezoid",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Человек Пылающий\nСложность: 7, приз\nЭффект: Атака +4, Полёт 2,\n:Сверхадаптация 5",
    "name": "Человек Пылающий",
    "req": [
      "n89",
      "n48"
    ],
    "next": [
      "n90"
    ],
    "title": "\"Формой и разумом они подобны людям, тело же их крылато и пылает звёздным огнём; \nи горе, о горе несчастному, осмелившемуся вызвать их гнев!\" \n\n– \"Легенды и сказания племён NK218\", стр. 53",
    "x": 1081.52,
    "y": 1281,
    "lvl": 14,
    "subtree": "Генетика"
  },
  {
    "id": "n88",
    "type": "trapezoid2",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Установка Сизиф\nСложность: 12, 6 слотов\nЭффект: :может перемещать\nпланеты между орбитами",
    "name": "Установка Сизиф",
    "req": [
      "n104"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 1465,
    "lvl": 16,
    "subtree": "Экзобиология"
  },
  {
    "id": "n89",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Реакторные митохондрии\nСложность: 6\nЭффект: +3 свободных куба, ГМО +3",
    "name": "Реакторные митохондрии",
    "req": [
      "n72"
    ],
    "next": [
      "n87",
      "n71"
    ],
    "title": "“Митохондрии”, качающие энергию из эффектов гиперпространства",
    "x": 795.25,
    "y": 1281,
    "lvl": 14,
    "subtree": "Генетика"
  },
  {
    "id": "n90",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Живые гипердвигатели\nСложность: 6, любая тех. FTL\nЭффект: +3 свободных куба",
    "name": "Живые гипердвигатели",
    "req": [
      "n87"
    ],
    "next": [
      "n81",
      "n92",
      "n95",
      "n107"
    ],
    "title": null,
    "x": 1081.52,
    "y": 1373,
    "lvl": 15,
    "subtree": "Генетика"
  },
  {
    "id": "n91",
    "type": "trapezoid",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Боевые ксеноморфы\nСложность: 4\nЭффект: Атака +2, Скорость +2,\nбио, ужас, гигер",
    "name": "Боевые ксеноморфы",
    "req": [
      "n13"
    ],
    "next": [],
    "title": null,
    "x": 1367.8,
    "y": 729,
    "lvl": 8,
    "subtree": "Генетика"
  },
  {
    "id": "n92",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Живые корабли\nСложность: 6\nЭффект: :корабли и их модули можно строить \nза Общество; они получают свойство \"гигер\"",
    "name": "Живые корабли",
    "req": [
      "n90"
    ],
    "next": [],
    "title": "Мерзко. Дешево. Эффективно. Для ксенофилов бесплатный подъем боевого духа в подарок.",
    "x": 1366.91,
    "y": 1465,
    "lvl": 16,
    "subtree": "Генетика"
  },
  {
    "id": "n93",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Коммуна Мичурина\nСложность: 5, волнения (3)\nЭффект: :Общество колонии удвоено,\n:Производство и Наука равны 0",
    "name": "Коммуна Мичурина",
    "req": [
      "n24"
    ],
    "next": [],
    "title": null,
    "x": 1366.91,
    "y": 1189,
    "lvl": 13,
    "subtree": "Генетика"
  },
  {
    "id": "n94",
    "type": "octagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Ксенотитан\nСложность: 6, наноматериалы(2)\nЭффект: титан, 6 слотов,\nгигер, ужас",
    "name": "Ксенотитан",
    "req": [
      "n97"
    ],
    "next": [],
    "title": "ХССССССССССССССССССС!",
    "x": -74.96,
    "y": 1281,
    "lvl": 14,
    "subtree": "Экзобиология"
  },
  {
    "id": "n95",
    "type": "trapezoid2",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Органический FTL-привод\nСложность: 7\nЭффект: Двигатель 3, \nFTL, гигер",
    "name": "Органический FTL-привод",
    "req": [
      "n90"
    ],
    "next": [],
    "title": null,
    "x": 791.77,
    "y": 1465,
    "lvl": 16,
    "subtree": "Генетика"
  },
  {
    "id": "n96",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Нейропластичность\nСложность: 5\nЭффект: Шпионаж +10, ГМО +3",
    "name": "Нейропластичность",
    "req": [
      "n23"
    ],
    "next": [],
    "title": null,
    "x": 1366.91,
    "y": 1005,
    "lvl": 11,
    "subtree": "Генетика"
  },
  {
    "id": "n97",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Биология суперорганизмов\nСложность: 5\nЭффект: Производство +5",
    "name": "Биология суперорганизмов",
    "req": [
      "n29"
    ],
    "next": [
      "n25",
      "n94"
    ],
    "title": null,
    "x": 214.79,
    "y": 1189,
    "lvl": 13,
    "subtree": "Экзобиология"
  },
  {
    "id": "n98",
    "type": "ellipse",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Капиллярные башни\nСложность: 5, осуждение(10),\nтех. Биология суперорганизмов\nЭффект: Орбита +10",
    "name": "Капиллярные башни",
    "req": [
      "n30"
    ],
    "next": [],
    "title": null,
    "x": 795.25,
    "y": 1005,
    "lvl": 11,
    "subtree": "Генетика"
  },
  {
    "id": "n99",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Термитник\nСложность: 5, тех. Роение, волнения(3)\nЭффект: :Производство колонии \nудвоено, :Наука и Общество равны 0",
    "name": "Термитник",
    "req": [
      "n24"
    ],
    "next": [],
    "title": null,
    "x": 795.25,
    "y": 1189,
    "lvl": 13,
    "subtree": "Генетика"
  },
  {
    "id": "n100",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Вычислительный мох\nСложность: 4\nЭффект: Наука +4",
    "name": "Вычислительный мох",
    "req": [
      "n69"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 821,
    "lvl": 9,
    "subtree": "Экзобиология"
  },
  {
    "id": "n101",
    "type": "hexagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Метановые организмы\nСложность: 6, экзоты(1),\n:метановая планета\nЭффект: Производство +6",
    "name": "Метановые организмы",
    "req": [
      "n72"
    ],
    "next": [],
    "title": "Пластик, полимеры, любые продукты органической химии - один засев этими существами, \nи метановая планета под ними превращается в огромный квазиживой завод.",
    "x": 508.98,
    "y": 1281,
    "lvl": 14,
    "subtree": "Экзобиология"
  },
  {
    "id": "n102",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Интуитивное понимание гиперфизики\nСложность: 5\nЭффект: Наука +5",
    "name": "Интуитивное понимание гиперфизики",
    "req": [
      "n23"
    ],
    "next": [
      "n24",
      "n113"
    ],
    "title": null,
    "x": 1081.52,
    "y": 1005,
    "lvl": 11,
    "subtree": "Генетика"
  },
  {
    "id": "n103",
    "type": "hexagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Засев газовых гигантов\nСложность: 12, чудо, экзоты(1),\n:водородный газовый гигант\nЭффект: Общество +12, Наука +1",
    "name": "Засев газовых гигантов",
    "req": [
      "n27"
    ],
    "next": [],
    "title": "Оранжереи размером с континент, \nплавающие в атмосфере газовых гигантов",
    "x": 795.25,
    "y": 1097,
    "lvl": 12,
    "subtree": "Генетика"
  },
  {
    "id": "n104",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Творцы миров\nСложность: 6\nЭффект: :за 5 ед Плотности системы и \n30 Производства позволяет создать планету",
    "name": "Творцы миров",
    "req": [
      "n25"
    ],
    "next": [
      "n88",
      "n105",
      "n106"
    ],
    "title": null,
    "x": 214.79,
    "y": 1373,
    "lvl": 15,
    "subtree": "Экзобиология"
  },
  {
    "id": "n105",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Сотворение звёзд\nСложность: 6\nЭффект: :открывает модификацию и\nзажигание звёзд",
    "name": "Сотворение звёзд",
    "req": [
      "n104"
    ],
    "next": [],
    "title": "https://kardashev.fandom.com/wiki/Stellification",
    "x": 214.79,
    "y": 1465,
    "lvl": 16,
    "subtree": "Экзобиология"
  },
  {
    "id": "n106",
    "type": "hexagon",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Укротитель звёзд\nСложность: 12\nЭффект: +6 свободных куба,\n:звезда абсолютно стабильна",
    "name": "Укротитель звёзд",
    "req": [
      "n104"
    ],
    "next": [],
    "title": "\"Признавайтесь, кто тёр волшебную лампу?\"\n- с испытаний \"Укротителя звёзд\"",
    "x": 508.98,
    "y": 1465,
    "lvl": 16,
    "subtree": "Экзобиология"
  },
  {
    "id": "n107",
    "type": "octagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Корабль-матка\nСложность: 8\nЭффект: звездолёт, 8 слотов, гигер,\nРегенерация +1",
    "name": "Корабль-матка",
    "req": [
      "n90"
    ],
    "next": [],
    "title": null,
    "x": 1366.91,
    "y": 1373,
    "lvl": 15,
    "subtree": "Генетика"
  },
  {
    "id": "n108",
    "type": "trapezoid2",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Биотерминатор\nСложность: 5\nЭффект: :Уничтожает \nбиосферу планеты",
    "name": "Биотерминатор",
    "req": [
      "n48"
    ],
    "next": [],
    "title": null,
    "x": 1366.91,
    "y": 1281,
    "lvl": 14,
    "subtree": "Генетика"
  },
  {
    "id": "n109",
    "type": "octagon",
    "treeName": "Biology",
    "borderColor": "#000000",
    "fullText": "Биокорабль\nСложность: 4\nЭффект: звездолёт, 4 слота, гигер,\nРемонт +2, нет FTL",
    "name": "Биокорабль",
    "req": [
      "n15"
    ],
    "next": [],
    "title": null,
    "x": 1366.91,
    "y": 821,
    "lvl": 9,
    "subtree": "Генетика"
  },
  {
    "id": "n110",
    "type": "trapezoid2",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Планетарный нимбулайзер\nСложность: 8, 4 слота, чудо\nЭффект: :контроль \nнад процентом Воды",
    "name": "Планетарный нимбулайзер",
    "req": [
      "n25"
    ],
    "next": [],
    "title": "Жахнуть пару ледяных комет, связать воду в верхней мантии, наморозить ледяные шапки, \nустроить астропромышленный элекролиз...\nДля серьёзных дядек со вторым Кардышевым это не такая уж большая проблема.\nИ нет, эта трехкилометровая штука не похожа на земной нимбулайзер.",
    "x": 508.98,
    "y": 1373,
    "lvl": 15,
    "subtree": "Экзобиология"
  },
  {
    "id": "n111",
    "type": "trapezoid2",
    "treeName": "Biology",
    "borderColor": "#FF0000",
    "fullText": "Жилой модуль\nСложность: 4, 2 слота\nЭффект: Общество +4,\n:для текущей планеты",
    "name": "Жилой модуль",
    "req": [
      "n42"
    ],
    "next": [],
    "title": "Жилые массивы и вертикальные модульные теплицы",
    "x": 505.5,
    "y": 729,
    "lvl": 8,
    "subtree": "Экзобиология"
  },
  {
    "id": "n112",
    "type": "parallelogram",
    "treeName": "Biology",
    "borderColor": "#0000FF",
    "fullText": "Биосфера Эдема\nСложность: 5, тех. Нанороботы\nЭффект: +2 свободных куба,\n:райский мир",
    "name": "Биосфера Эдема",
    "req": [
      "n50",
      "n85"
    ],
    "next": [],
    "title": "Планета-сад, планета-рай, где деревья сами кладут плоды в протянутую руку,\nживотные услужливы и игривы,\nа опасность для человека практически немыслима.\nТолько что не молочные реки с кисельными берегами.",
    "x": -74.96,
    "y": 1005,
    "lvl": 11,
    "subtree": "Экзобиология"
  },
  {
    "id": "n113",
    "type": "rectangle",
    "treeName": "Biology",
    "borderColor": "#00FF00",
    "fullText": "Естественная навигация\nСложность: 5\nЭффект: Наука +2,\nСкорость FTL +6, ГМО +3",
    "name": "Естественная навигация",
    "req": [
      "n102"
    ],
    "next": [],
    "title": null,
    "x": 1366.91,
    "y": 1097,
    "lvl": 12,
    "subtree": "Генетика"
  },
  {
    "id": "n0",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Шахта\nСложность: 1\nЭффект: Производство +1, Сталь +1",
    "name": "Шахта",
    "req": [
      "n1"
    ],
    "next": [
      "n6",
      "n36",
      "n13"
    ],
    "title": null,
    "x": 21.97,
    "y": 119,
    "lvl": 2,
    "subtree": "Добыча"
  },
  {
    "id": "n1",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Экзоминералогия\nСложность: 1\nЭффект: Производство +1",
    "name": "Экзоминералогия",
    "req": [],
    "next": [
      "n0",
      "n54",
      "n90"
    ],
    "title": null,
    "x": 21.97,
    "y": 27,
    "lvl": 1,
    "subtree": "Добыча"
  },
  {
    "id": "n2",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Адаптация промышленности\nСложность: 1\nЭффект: Производство +1",
    "name": "Адаптация промышленности",
    "req": [],
    "next": [
      "n3",
      "n54",
      "n83"
    ],
    "title": null,
    "x": 610.34,
    "y": 27,
    "lvl": 1,
    "subtree": "Производство"
  },
  {
    "id": "n3",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Экзоскелеты\nСложность: 1\nЭффект: Сталь +1",
    "name": "Экзоскелеты",
    "req": [
      "n2"
    ],
    "next": [
      "n7",
      "n13",
      "n84"
    ],
    "title": null,
    "x": 610.34,
    "y": 119,
    "lvl": 2,
    "subtree": "Производство"
  },
  {
    "id": "n4",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Экзометеорология\nСложность: 1\nЭффект: Наука +1",
    "name": "Экзометеорология",
    "req": [],
    "next": [
      "n38",
      "n8"
    ],
    "title": null,
    "x": 1182.89,
    "y": 27,
    "lvl": 1,
    "subtree": "Космос"
  },
  {
    "id": "n5",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Обновление ракетной техники\nСложность: 1, редкие металлы (1)\nЭффект: Пуски +2",
    "name": "Обновление ракетной техники",
    "req": [
      "n8"
    ],
    "next": [],
    "title": null,
    "x": 896.62,
    "y": 211,
    "lvl": 3,
    "subtree": "Космос"
  },
  {
    "id": "n6",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Плавильный комбинат\nСложность: 1\nЭффект: Редкие металлы +1, \nПроизводство +1",
    "name": "Плавильный комбинат",
    "req": [
      "n0"
    ],
    "next": [
      "n11",
      "n55"
    ],
    "title": "запускает добычу Трансуранов и Редких металлов",
    "x": 21.97,
    "y": 211,
    "lvl": 3,
    "subtree": "Добыча"
  },
  {
    "id": "n7",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Базовая автоматизация\nСложность: 1\nЭффект: Производство +1",
    "name": "Базовая автоматизация",
    "req": [
      "n3"
    ],
    "next": [
      "n10",
      "n37"
    ],
    "title": null,
    "x": 610.34,
    "y": 211,
    "lvl": 3,
    "subtree": "Производство"
  },
  {
    "id": "n8",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Первичная орбитальная группировка\nСложность: 1\nЭффект: Планетарная разведка +2",
    "name": "Первичная орбитальная группировка",
    "req": [
      "n4"
    ],
    "next": [
      "n41",
      "n9",
      "n5"
    ],
    "title": null,
    "x": 1182.89,
    "y": 119,
    "lvl": 2,
    "subtree": "Космос"
  },
  {
    "id": "n9",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Пусковые технологии\nСложность: 1\nЭффект: Пуски +2",
    "name": "Пусковые технологии",
    "req": [
      "n8"
    ],
    "next": [
      "n40",
      "n56"
    ],
    "title": null,
    "x": 1182.89,
    "y": 211,
    "lvl": 3,
    "subtree": "Космос"
  },
  {
    "id": "n10",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "3D-печать\nСложность: 2\nЭффект: +1 свободный куб",
    "name": "3D-печать",
    "req": [
      "n7"
    ],
    "next": [
      "n14",
      "n75"
    ],
    "title": null,
    "x": 610.34,
    "y": 316,
    "lvl": 4,
    "subtree": "Производство"
  },
  {
    "id": "n11",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Энергетические ресурсы\nСложность: 2\nЭффект: Трансураны +1, \nПроизводство +1",
    "name": "Энергетические ресурсы",
    "req": [
      "n6"
    ],
    "next": [
      "n39",
      "n125"
    ],
    "title": null,
    "x": 21.97,
    "y": 316,
    "lvl": 4,
    "subtree": "Добыча"
  },
  {
    "id": "n12",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Восстановление звездолёта\nСложность: 2, тех. Звездолёт Рассеяния\nЭффект: разово звездолёт восстановлен,\nразово Крейсер бесплатно",
    "name": "Восстановление звездолёта",
    "req": [
      "n56"
    ],
    "next": [],
    "title": "На многое не надейтесь:\nэтой чушке все ещё нужен хотя бы\nнормальный межпланетный двигатель",
    "x": 1465.69,
    "y": 421,
    "lvl": 5,
    "subtree": "Космос"
  },
  {
    "id": "n13",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Экстенсивная добыча\nСложность: 1\nЭффект: Производство +1",
    "name": "Экстенсивная добыча",
    "req": [
      "n0",
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 211,
    "lvl": 3,
    "subtree": "Производство"
  },
  {
    "id": "n14",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Масштабное производство\nСложность: 2, сталь (2)\nЭффект: Производство +2, \n:сплавление кубов",
    "name": "Масштабное производство",
    "req": [
      "n10"
    ],
    "next": [
      "n17",
      "n118"
    ],
    "title": "сплавление кубов позволяет кидать д30-д100, облегчая расчеты и снижая шанс критов",
    "x": 610.34,
    "y": 421,
    "lvl": 5,
    "subtree": "Производство"
  },
  {
    "id": "n15",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#000000",
    "fullText": "Бюро внепланетных ресурсов\nСложность: 3, тех. Освоение орбиты\nЭффект: Наука +2",
    "name": "Бюро внепланетных ресурсов",
    "req": [
      "n125"
    ],
    "next": [
      "n20",
      "n22"
    ],
    "title": null,
    "x": 21.97,
    "y": 527,
    "lvl": 6,
    "subtree": "Добыча"
  },
  {
    "id": "n16",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Орбитальное производство\nСложность: 3\nЭффект: +1 свободный куб,\n:колонии в других ЗС",
    "name": "Орбитальное производство",
    "req": [
      "n119"
    ],
    "next": [
      "n21",
      "n117",
      "n128"
    ],
    "title": null,
    "x": 1182.89,
    "y": 527,
    "lvl": 6,
    "subtree": "Космос"
  },
  {
    "id": "n17",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Оборонная промышленность\nСложность: 3, сталь (1)\nЭффект: Создание армий +7",
    "name": "Оборонная промышленность",
    "req": [
      "n14"
    ],
    "next": [
      "n18",
      "n51"
    ],
    "title": null,
    "x": 610.34,
    "y": 527,
    "lvl": 6,
    "subtree": "Производство"
  },
  {
    "id": "n18",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Полномасштабная автоматизация\nСложность: 3, специалисты (1)\nЭффект: Общество +3",
    "name": "Полномасштабная автоматизация",
    "req": [
      "n17"
    ],
    "next": [
      "n52",
      "n23"
    ],
    "title": null,
    "x": 610.34,
    "y": 632,
    "lvl": 7,
    "subtree": "Производство"
  },
  {
    "id": "n19",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Сверхглубокое бурение\nСложность: 4, наноматериалы (1)\nЭффект: Производство +4",
    "name": "Сверхглубокое бурение",
    "req": [
      "n78"
    ],
    "next": [
      "n43",
      "n113",
      "n124"
    ],
    "title": null,
    "x": 21.97,
    "y": 843,
    "lvl": 9,
    "subtree": "Добыча"
  },
  {
    "id": "n20",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Массовая внепланетная добыча\nСложность: 3\nЭффект: Редкие металлы +2, \nТрансураны +2",
    "name": "Массовая внепланетная добыча",
    "req": [
      "n15"
    ],
    "next": [
      "n42"
    ],
    "title": null,
    "x": -267.78,
    "y": 632,
    "lvl": 7,
    "subtree": "Добыча"
  },
  {
    "id": "n21",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Индустриализация космоса\nСложность: 3, сталь (1)\nЭффект: Производство +3",
    "name": "Индустриализация космоса",
    "req": [
      "n16"
    ],
    "next": [
      "n81",
      "n115",
      "n121"
    ],
    "title": null,
    "x": 1182.89,
    "y": 632,
    "lvl": 7,
    "subtree": "Космос"
  },
  {
    "id": "n22",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Завод массового наносинтеза\nСложность: 3, \nтех. Завод наноматериалов\nЭффект: Наноматериалы +2",
    "name": "Завод массового наносинтеза",
    "req": [
      "n15"
    ],
    "next": [
      "n78"
    ],
    "title": null,
    "x": 21.97,
    "y": 632,
    "lvl": 7,
    "subtree": "Добыча"
  },
  {
    "id": "n23",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Суперстройки\nСложность: 4\nЭффект: Строительство +8",
    "name": "Суперстройки",
    "req": [
      "n18"
    ],
    "next": [
      "n48",
      "n127"
    ],
    "title": null,
    "x": 610.34,
    "y": 738,
    "lvl": 8,
    "subtree": "Производство"
  },
  {
    "id": "n24",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Освоение мантии планеты\nСложность: 4, экзотическая материя (1)\nЭффект: +2 свободных куба",
    "name": "Освоение мантии планеты",
    "req": [
      "n43"
    ],
    "next": [
      "n82"
    ],
    "title": null,
    "x": 316.16,
    "y": 1054,
    "lvl": 11,
    "subtree": "Производство"
  },
  {
    "id": "n25",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Репликация\nСложность: 4\nЭффект: +2 свободных куба, :производство \nсамовоспроизводящихся роботов",
    "name": "Репликация",
    "req": [
      "n127"
    ],
    "next": [
      "n26"
    ],
    "title": null,
    "x": 610.34,
    "y": 948,
    "lvl": 10,
    "subtree": "Производство"
  },
  {
    "id": "n26",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Общепланетная система снабжения\nСложность: 5\nЭффект: Общество +5",
    "name": "Общепланетная система снабжения",
    "req": [
      "n25"
    ],
    "next": [
      "n79",
      "n32"
    ],
    "title": null,
    "x": 610.34,
    "y": 1054,
    "lvl": 11,
    "subtree": "Производство"
  },
  {
    "id": "n27",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#00FF00",
    "fullText": "Общесистемная библиотека\nСложность: 5, тех. Контекстная память\nЭффект: Наука +5",
    "name": "Общесистемная библиотека",
    "req": [
      "n28"
    ],
    "next": [],
    "title": null,
    "x": 1465.69,
    "y": 1054,
    "lvl": 11,
    "subtree": "Космос"
  },
  {
    "id": "n28",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Соларнет\nСложность: 4\nЭффект: Общество +4",
    "name": "Соларнет",
    "req": [
      "n50"
    ],
    "next": [
      "n27",
      "n29",
      "n122"
    ],
    "title": null,
    "x": 1182.89,
    "y": 948,
    "lvl": 10,
    "subtree": "Космос"
  },
  {
    "id": "n29",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Межпланетная торговля\nСложность: 5\nЭффект: +2 свободных куба",
    "name": "Межпланетная торговля",
    "req": [
      "n28"
    ],
    "next": [
      "n30",
      "n79",
      "n97"
    ],
    "title": null,
    "x": 1182.89,
    "y": 1054,
    "lvl": 11,
    "subtree": "Космос"
  },
  {
    "id": "n30",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#000000",
    "fullText": "Колонизация пустоты\nСложность: 5\nЭффект: Общество +5",
    "name": "Колонизация пустоты",
    "req": [
      "n29"
    ],
    "next": [
      "n102",
      "n114"
    ],
    "title": null,
    "x": 1182.89,
    "y": 1159,
    "lvl": 12,
    "subtree": "Космос"
  },
  {
    "id": "n31",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Модернизация промышленности\nСложность: 5, специалисты (1)\nЭффект: Производство +5",
    "name": "Модернизация промышленности",
    "req": [
      "n32"
    ],
    "next": [
      "n106"
    ],
    "title": null,
    "x": 610.34,
    "y": 1265,
    "lvl": 13,
    "subtree": "Производство"
  },
  {
    "id": "n32",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Индустриальная гравитоника\nСложность: 5, \nтех. Управление гравитацией\nЭффект: Производство +5",
    "name": "Индустриальная гравитоника",
    "req": [
      "n26"
    ],
    "next": [
      "n60",
      "n96",
      "n31"
    ],
    "title": null,
    "x": 610.34,
    "y": 1159,
    "lvl": 12,
    "subtree": "Производство"
  },
  {
    "id": "n33",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Звёздная материя\nСложность: 6, экзотматерия (1),\nтех. Управление гравитацией\nЭффект: Нейтроний +1",
    "name": "Звёздная материя",
    "req": [
      "n87"
    ],
    "next": [
      "n86",
      "n109"
    ],
    "title": null,
    "x": 21.97,
    "y": 1371,
    "lvl": 14,
    "subtree": "Добыча"
  },
  {
    "id": "n34",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Дилемма Дайсона\nСложность: 5\nЭффект: Астроинженерия +10",
    "name": "Дилемма Дайсона",
    "req": [
      "n91"
    ],
    "next": [
      "n87",
      "n89"
    ],
    "title": "Мы видим цель!",
    "x": 21.97,
    "y": 1159,
    "lvl": 12,
    "subtree": "Добыча"
  },
  {
    "id": "n35",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Межзвёздное снабжение\nСложность: 6\nЭффект: +3 свободных куба",
    "name": "Межзвёздное снабжение",
    "req": [
      "n106"
    ],
    "next": [
      "n94"
    ],
    "title": null,
    "x": 610.34,
    "y": 1477,
    "lvl": 15,
    "subtree": "Производство"
  },
  {
    "id": "n36",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Промышленные рудники\nСложность: 1\nЭффект: Производство +1, Сталь +1",
    "name": "Промышленные рудники",
    "req": [
      "n0"
    ],
    "next": [],
    "title": null,
    "x": -271.73,
    "y": 211,
    "lvl": 3,
    "subtree": "Добыча"
  },
  {
    "id": "n37",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Мануфактура\nСложность: 2\nЭффект: Производство +2",
    "name": "Мануфактура",
    "req": [
      "n7"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 316,
    "lvl": 4,
    "subtree": "Производство"
  },
  {
    "id": "n38",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Метеостанция\nСложность: 1\nЭффект: :+2 к устранению Отказов \nот погодных условий",
    "name": "Метеостанция",
    "req": [
      "n4"
    ],
    "next": [],
    "title": null,
    "x": 896.62,
    "y": 27,
    "lvl": 1,
    "subtree": "Космос"
  },
  {
    "id": "n39",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Электростанции\nСложность: 2\nЭффект: Производство +2",
    "name": "Электростанции",
    "req": [
      "n11"
    ],
    "next": [],
    "title": null,
    "x": -272.21,
    "y": 421,
    "lvl": 5,
    "subtree": "Добыча"
  },
  {
    "id": "n40",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Космодром\nСложность: 2\nЭффект: Пуски +4",
    "name": "Космодром",
    "req": [
      "n9"
    ],
    "next": [],
    "title": null,
    "x": 896.62,
    "y": 316,
    "lvl": 4,
    "subtree": "Космос"
  },
  {
    "id": "n41",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Спутники связи\nСложность: 1\nЭффект: Общество +1",
    "name": "Спутники связи",
    "req": [
      "n8"
    ],
    "next": [
      "n57"
    ],
    "title": null,
    "x": 1469.16,
    "y": 211,
    "lvl": 3,
    "subtree": "Космос"
  },
  {
    "id": "n42",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Сеть захвата астероидов\nСложность: 3\nЭффект: Орбита +6",
    "name": "Сеть захвата астероидов",
    "req": [
      "n20"
    ],
    "next": [],
    "title": null,
    "x": -267.78,
    "y": 738,
    "lvl": 8,
    "subtree": "Добыча"
  },
  {
    "id": "n43",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Субмантийная шахта\nСложность: 4\nЭффект: Производство +4",
    "name": "Субмантийная шахта",
    "req": [
      "n19"
    ],
    "next": [
      "n24"
    ],
    "title": null,
    "x": 316.16,
    "y": 948,
    "lvl": 10,
    "subtree": "Производство"
  },
  {
    "id": "n47",
    "type": "trapezoid2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Ядерный ракетный двигатель\nСложность: 1, трансураны (1)\nЭффект: Двигатель 0.5, \nпред-FTL",
    "name": "Ядерный ракетный двигатель",
    "req": [
      "n119"
    ],
    "next": [],
    "title": "Не так важно, ядерно-импульсный это двигатель или атомный реактор с разомкнутым в сопло контуром; \nважно, что во-первых при ускорении в 1g он может разогнаться до 3,3% скорости света за десять дней\nи во-вторых он жутко, жутчайше фонит.",
    "x": 896.62,
    "y": 527,
    "lvl": 6,
    "subtree": "Космос"
  },
  {
    "id": "n48",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Башня Циолковского\nСложность: 8, наноматериалы (2),\nчудо\nЭффект: Орбита +20",
    "name": "Башня Циолковского",
    "req": [
      "n23",
      "n50"
    ],
    "next": [],
    "title": null,
    "x": 893.14,
    "y": 843,
    "lvl": 9,
    "subtree": "Космос"
  },
  {
    "id": "n49",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Орбитальное кольцо\nСложность: 18, чудо\nЭффект: Создание флотов +36",
    "name": "Орбитальное кольцо",
    "req": [
      "n102"
    ],
    "next": [
      "n95"
    ],
    "title": null,
    "x": 1472.64,
    "y": 1371,
    "lvl": 14,
    "subtree": "Космос"
  },
  {
    "id": "n50",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Масштабные орбитальные сооружения\nСложность: 4\nЭффект: Орбита +8",
    "name": "Масштабные орбитальные сооружения",
    "req": [
      "n115"
    ],
    "next": [
      "n28",
      "n59",
      "n80",
      "n48"
    ],
    "title": null,
    "x": 1182.89,
    "y": 843,
    "lvl": 9,
    "subtree": "Космос"
  },
  {
    "id": "n51",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Военный завод\nСложность: 3, сталь (1)\nЭффект: Создание армий +7",
    "name": "Военный завод",
    "req": [
      "n17"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 632,
    "lvl": 7,
    "subtree": "Производство"
  },
  {
    "id": "n52",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Саморазвёртываемая фабрика\nСложность: 1, чудо\nЭффект: Производство +4",
    "name": "Саморазвёртываемая фабрика",
    "req": [
      "n18"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 738,
    "lvl": 8,
    "subtree": "Производство"
  },
  {
    "id": "n53",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Разборка звездолёта\nСложность: 1\nЭффект: разово Производство +6, \n:звездолёт Рассеяния разобран",
    "name": "Разборка звездолёта",
    "req": [
      "n85"
    ],
    "next": [],
    "title": null,
    "x": 1469.16,
    "y": 119,
    "lvl": 2,
    "subtree": "Космос"
  },
  {
    "id": "n54",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Подземное строительство\nСложность: 1\nЭффект: Защита колонии +2,\nСтроительство -2, Метеозащита 1",
    "name": "Подземное строительство",
    "req": [
      "n2",
      "n1"
    ],
    "next": [],
    "title": "Скорее паттерны и геологоразведка для этой планеты, чем одноразовый проект.\nКаждое здание получает особенность \"подземное\" (обязательно, но бесплатно)",
    "x": 316.16,
    "y": 119,
    "lvl": 2,
    "subtree": "Производство"
  },
  {
    "id": "n55",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Защитный купол\nСложность: 2, сталь(2)\nЭффект: Защита колонии +2, \nМетеозащита 1",
    "name": "Защитный купол",
    "req": [
      "n6"
    ],
    "next": [],
    "title": null,
    "x": -272.21,
    "y": 316,
    "lvl": 4,
    "subtree": "Добыча"
  },
  {
    "id": "n56",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Освоение орбиты\nСложность: 2, тех. Постземная астрономия\nЭффект: Производство +2,\n:оценка ресурсов других планет ЗС",
    "name": "Освоение орбиты",
    "req": [
      "n9"
    ],
    "next": [
      "n12",
      "n116",
      "n119"
    ],
    "title": "Позволяет сделать (упрощённые) броски на воду/ресурсы/етц для всех планет своей звездной системы",
    "x": 1182.89,
    "y": 316,
    "lvl": 4,
    "subtree": "Космос"
  },
  {
    "id": "n57",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Гелиоприемник\nСложность: 2, :солнце\nЭффект: Производство +2",
    "name": "Гелиоприемник",
    "req": [
      "n41"
    ],
    "next": [],
    "title": null,
    "x": 1469.16,
    "y": 316,
    "lvl": 4,
    "subtree": "Космос"
  },
  {
    "id": "n58",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Базовая электростанция\nСложность: 1, базовое\nЭффект: выдаётся при высадке,\nэлектростанция",
    "name": "Базовая электростанция",
    "req": [],
    "next": [],
    "title": null,
    "x": -267.78,
    "y": 27,
    "lvl": 1,
    "subtree": "Добыча"
  },
  {
    "id": "n59",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Планетарный плазменный щит\nСложность: 4, сталь(1)\nЭффект: Щит планеты +6",
    "name": "Планетарный плазменный щит",
    "req": [
      "n50"
    ],
    "next": [],
    "title": "Огромная, огроменная сеть станций, проецирующих над всей планетой плазменный щит",
    "x": 893.14,
    "y": 948,
    "lvl": 10,
    "subtree": "Космос"
  },
  {
    "id": "n60",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Планетарный щит искривления\nСложность: 12, чудо\nЭффект: Щит планеты +12",
    "name": "Планетарный щит искривления",
    "req": [
      "n32"
    ],
    "next": [],
    "title": "Не спрашивайте, сколько станций её поддерживает и во сколько обошлось строительство.",
    "x": 896.62,
    "y": 1265,
    "lvl": 13,
    "subtree": "Космос"
  },
  {
    "id": "n75",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#00FF00",
    "fullText": "Индивидуализация производства\nСложность: 2\nЭффект: Общество +2",
    "name": "Индивидуализация производства",
    "req": [
      "n10"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 421,
    "lvl": 5,
    "subtree": "Производство"
  },
  {
    "id": "n78",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Промышленные нанороботы\nСложность: 4, тех. Нанороботы\nЭффект: Производство +4",
    "name": "Промышленные нанороботы",
    "req": [
      "n22"
    ],
    "next": [
      "n19",
      "n111",
      "n110"
    ],
    "title": null,
    "x": 21.97,
    "y": 738,
    "lvl": 8,
    "subtree": "Добыча"
  },
  {
    "id": "n79",
    "type": "trapezoid2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Торговый модуль\nСложность: 5\nЭффект: +2 свободных куба",
    "name": "Торговый модуль",
    "req": [
      "n26",
      "n29"
    ],
    "next": [],
    "title": null,
    "x": 896.62,
    "y": 1159,
    "lvl": 12,
    "subtree": "Космос"
  },
  {
    "id": "n80",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Планетарный рой\nСложность: 5, чудо\nЭффект: +3 свободных куба",
    "name": "Планетарный рой",
    "req": [
      "n50"
    ],
    "next": [],
    "title": null,
    "x": 1465.69,
    "y": 948,
    "lvl": 10,
    "subtree": "Космос"
  },
  {
    "id": "n81",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Спутники контроля погоды\nСложность: 4, антиматерия(1)\nЭффект: Метеозащита 3",
    "name": "Спутники контроля погоды",
    "req": [
      "n21"
    ],
    "next": [],
    "title": null,
    "x": 896.62,
    "y": 738,
    "lvl": 8,
    "subtree": "Космос"
  },
  {
    "id": "n82",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Шахта глубокого ядра\nСложность: 5, экзотматерия (1)\nЭффект: Производство +5,\nСталь +1",
    "name": "Шахта глубокого ядра",
    "req": [
      "n24"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 1159,
    "lvl": 12,
    "subtree": "Производство"
  },
  {
    "id": "n83",
    "type": "trapezoid",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Вездеходные транспорты\nСложность: 1\nЭффект: Скорость +2",
    "name": "Вездеходные транспорты",
    "req": [
      "n2"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 27,
    "lvl": 1,
    "subtree": "Производство"
  },
  {
    "id": "n84",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#00FF00",
    "fullText": "Защита от агрессивных условий\nСложность: 1\nЭффект: Резерв +1",
    "name": "Защита от агрессивных условий",
    "req": [
      "n3"
    ],
    "next": [],
    "title": null,
    "x": 893.14,
    "y": 119,
    "lvl": 2,
    "subtree": "Космос"
  },
  {
    "id": "n85",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Звездолёт Рассеяния\nСложность: 0\nЭффект: выдаётся на старте",
    "name": "Звездолёт Рассеяния",
    "req": [],
    "next": [
      "n53"
    ],
    "title": null,
    "x": 1469.16,
    "y": 27,
    "lvl": 1,
    "subtree": "Космос"
  },
  {
    "id": "n86",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Предел энергонасыщения\nСложность: 6, гиперплазма (1)\nЭффект: Производство +6",
    "name": "Предел энергонасыщения",
    "req": [
      "n33"
    ],
    "next": [
      "n93",
      "n92",
      "n104"
    ],
    "title": null,
    "x": 21.97,
    "y": 1477,
    "lvl": 15,
    "subtree": "Добыча"
  },
  {
    "id": "n87",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Энергия звёзд\nСложность: 5\nЭффект: Производство +5",
    "name": "Энергия звёзд",
    "req": [
      "n34"
    ],
    "next": [
      "n33",
      "n105"
    ],
    "title": null,
    "x": 21.97,
    "y": 1265,
    "lvl": 13,
    "subtree": "Добыча"
  },
  {
    "id": "n88",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Сфера Дайсона\nСложность: 250\nЭффект: Производство +270",
    "name": "Сфера Дайсона",
    "req": [
      "n89"
    ],
    "next": [
      "n98"
    ],
    "title": null,
    "x": -272.21,
    "y": 1371,
    "lvl": 14,
    "subtree": "Добыча"
  },
  {
    "id": "n89",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Рой Дайсона\nСложность: 110\nЭффект: Производство +120",
    "name": "Рой Дайсона",
    "req": [
      "n34",
      "n123"
    ],
    "next": [
      "n88"
    ],
    "title": null,
    "x": -272.21,
    "y": 1265,
    "lvl": 13,
    "subtree": "Добыча"
  },
  {
    "id": "n90",
    "type": "parallelogram2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Георазведка\nСложность: 1\nЭффект: разово позволяет перебросить\nкуб на Ресурсы (только вверх)",
    "name": "Георазведка",
    "req": [
      "n1"
    ],
    "next": [],
    "title": null,
    "x": -267.78,
    "y": 119,
    "lvl": 2,
    "subtree": "Добыча"
  },
  {
    "id": "n91",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Эксплуатация глубокого космоса\nСложность: 5, тех. Индустриализация космоса\nЭффект: Производство +5",
    "name": "Эксплуатация глубокого космоса",
    "req": [
      "n124"
    ],
    "next": [
      "n123",
      "n34"
    ],
    "title": null,
    "x": 21.97,
    "y": 1054,
    "lvl": 11,
    "subtree": "Добыча"
  },
  {
    "id": "n92",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Произвольный синтез\nСложность: 7, тех. Теория немыслимого\nЭффект: :убирает требования по ресурсам \nза Производство [номер ряда ресурса]",
    "name": "Произвольный синтез",
    "req": [
      "n86"
    ],
    "next": [],
    "title": null,
    "x": 21.97,
    "y": 1581,
    "lvl": 16,
    "subtree": "Добыча"
  },
  {
    "id": "n93",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Сфера Пенроуза\nСложность: 300, черная дыра\nЭффект: Производство +250, \nНаука +50",
    "name": "Сфера Пенроуза",
    "req": [
      "n86"
    ],
    "next": [],
    "title": null,
    "x": -272.21,
    "y": 1581,
    "lvl": 16,
    "subtree": "Добыча"
  },
  {
    "id": "n94",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Омнихранилища\nСложность: 7, тех. Телепортация\nЭффект: :все ресурсы доступны \nиз любой точки сети складов",
    "name": "Омнихранилища",
    "req": [
      "n35"
    ],
    "next": [],
    "title": null,
    "x": 610.34,
    "y": 1581,
    "lvl": 16,
    "subtree": "Производство"
  },
  {
    "id": "n95",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Мир-кольцо\nСложность: 32, сталь(12)\nЭффект: Производство +30, \nОбщество +2",
    "name": "Мир-кольцо",
    "req": [
      "n49"
    ],
    "next": [
      "n99"
    ],
    "title": null,
    "x": 1472.64,
    "y": 1477,
    "lvl": 15,
    "subtree": "Космос"
  },
  {
    "id": "n96",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Планетарный генератор гравитации\nСложность: 6\nЭффект: :приводит гравитацию \nпланеты к любому нужному значению",
    "name": "Планетарный генератор гравитации",
    "req": [
      "n32"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 1265,
    "lvl": 13,
    "subtree": "Производство"
  },
  {
    "id": "n97",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#00FF00",
    "fullText": "Межпланетный туризм\nСложность: 5\nЭффект: Общество +5",
    "name": "Межпланетный туризм",
    "req": [
      "n29"
    ],
    "next": [],
    "title": null,
    "x": 1465.69,
    "y": 1159,
    "lvl": 12,
    "subtree": "Космос"
  },
  {
    "id": "n98",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Мозг-матрёшка\nСложность: 300\nЭффект: Наука +330",
    "name": "Мозг-матрёшка",
    "req": [
      "n88"
    ],
    "next": [],
    "title": null,
    "x": -272.21,
    "y": 1477,
    "lvl": 15,
    "subtree": "Добыча"
  },
  {
    "id": "n99",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Диск Алдерсона\nСложность: 38, сталь(15)\nЭффект: Производство +38, Общество +4, \nНаука +1",
    "name": "Диск Алдерсона",
    "req": [
      "n95",
      "n100"
    ],
    "next": [],
    "title": null,
    "x": 1472.64,
    "y": 1581,
    "lvl": 16,
    "subtree": "Космос"
  },
  {
    "id": "n100",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Астроинженерия\nСложность: 6, сталь (2)\nЭффект: Астроинженерия +10",
    "name": "Астроинженерия",
    "req": [
      "n101"
    ],
    "next": [
      "n99",
      "n103",
      "n108"
    ],
    "title": null,
    "x": 1182.89,
    "y": 1477,
    "lvl": 15,
    "subtree": "Космос"
  },
  {
    "id": "n101",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#000000",
    "fullText": "Колонизация облака Оорта\nСложность: 6\nЭффект: Общество +3, Наука +3",
    "name": "Колонизация облака Оорта",
    "req": [
      "n114"
    ],
    "next": [
      "n100",
      "n107"
    ],
    "title": null,
    "x": 1182.89,
    "y": 1371,
    "lvl": 14,
    "subtree": "Космос"
  },
  {
    "id": "n102",
    "type": "octagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Цилиндр О'Нила\nСложность: 8, сталь(2)\nЭффект: хабитат, 7 слотов,\nСвободный +1",
    "name": "Цилиндр О'Нила",
    "req": [
      "n30"
    ],
    "next": [
      "n49"
    ],
    "title": null,
    "x": 1472.64,
    "y": 1265,
    "lvl": 13,
    "subtree": "Космос"
  },
  {
    "id": "n103",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Стандартные шаблонные конструкции\nСложность: 6\nЭффект: Строительство +6, \nСоздание флотов +4,  Астроинженерия +4",
    "name": "Стандартные шаблонные конструкции",
    "req": [
      "n100"
    ],
    "next": [],
    "title": null,
    "x": 1182.89,
    "y": 1581,
    "lvl": 16,
    "subtree": "Космос"
  },
  {
    "id": "n104",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Кугельблиц\nСложность: 140, специалисты(2)\nЭффект: Наука +20, Производство +120,\n:производит энергию не хуже звезды",
    "name": "Кугельблиц",
    "req": [
      "n86"
    ],
    "next": [],
    "title": "Как чёрная дыра, только вместо материи там ушла за горизонт событий энергия.\nНафига - непонятно, но очень интересно.",
    "x": 316.16,
    "y": 1581,
    "lvl": 16,
    "subtree": "Производство"
  },
  {
    "id": "n105",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Массовое освоение звезды\nСложность: 5\nЭффект: +2 свободных куба",
    "name": "Массовое освоение звезды",
    "req": [
      "n87"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 1371,
    "lvl": 14,
    "subtree": "Производство"
  },
  {
    "id": "n106",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Сверхэффективность\nСложность: 6, тех. Сильный ИИ\nЭффект: Производство +6",
    "name": "Сверхэффективность",
    "req": [
      "n31"
    ],
    "next": [
      "n35"
    ],
    "title": null,
    "x": 610.34,
    "y": 1371,
    "lvl": 14,
    "subtree": "Производство"
  },
  {
    "id": "n107",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Глаза Аргуса\nСложность: 6\nЭффект: Наука +6",
    "name": "Глаза Аргуса",
    "req": [
      "n101"
    ],
    "next": [],
    "title": "Неисчислимая россыпь автоматических научных станций, расположенных по всему облаку Оорта и соединённых в единую полуразумную сеть",
    "x": 896.62,
    "y": 1477,
    "lvl": 15,
    "subtree": "Космос"
  },
  {
    "id": "n108",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Звёздный двигатель\nСложность: 200\nЭффект: :Позволяет двигать \nзвёздную систему",
    "name": "Звёздный двигатель",
    "req": [
      "n100"
    ],
    "next": [],
    "title": null,
    "x": 896.62,
    "y": 1581,
    "lvl": 16,
    "subtree": "Космос"
  },
  {
    "id": "n109",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Нейтрониевая кузня\nСложность: 40, :нейтронная звезда\nЭффект: Нейтроний +4, \nПроизводство +10, Наука +5",
    "name": "Нейтрониевая кузня",
    "req": [
      "n33"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 1477,
    "lvl": 15,
    "subtree": "Производство"
  },
  {
    "id": "n110",
    "type": "octagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Строительный нанорой\nСложность: 5, наноматериалы (1)\nЭффект: нанорой, 0 слотов, Атака 1,\nСтроительство +2",
    "name": "Строительный нанорой",
    "req": [
      "n78"
    ],
    "next": [],
    "title": null,
    "x": 316.16,
    "y": 843,
    "lvl": 9,
    "subtree": "Производство"
  },
  {
    "id": "n111",
    "type": "octagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Добывающий нанорой\nСложность: 4, наноматериалы (1)\nЭффект: нанорой, 0 слотов, Атака 1,\nСталь +2, :Истощение 1",
    "name": "Добывающий нанорой",
    "req": [
      "n78"
    ],
    "next": [],
    "title": null,
    "x": -267.78,
    "y": 843,
    "lvl": 9,
    "subtree": "Добыча"
  },
  {
    "id": "n112",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Нанообогатитель\nСложность: 5\nЭффект: Сталь +5",
    "name": "Нанообогатитель",
    "req": [
      "n124"
    ],
    "next": [],
    "title": null,
    "x": -267.78,
    "y": 1054,
    "lvl": 11,
    "subtree": "Добыча"
  },
  {
    "id": "n113",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Тектоническая кузня\nСложность: 4\nЭффект: Производство +4",
    "name": "Тектоническая кузня",
    "req": [
      "n19"
    ],
    "next": [],
    "title": null,
    "x": -267.78,
    "y": 948,
    "lvl": 10,
    "subtree": "Добыча"
  },
  {
    "id": "n114",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Массовое строительство хабитатов\nСложность: 5\nЭффект: Создание \nхабитатов +10",
    "name": "Массовое строительство хабитатов",
    "req": [
      "n30"
    ],
    "next": [
      "n101"
    ],
    "title": null,
    "x": 1182.89,
    "y": 1265,
    "lvl": 13,
    "subtree": "Космос"
  },
  {
    "id": "n115",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Автономное производство\nСложность: 4\nЭффект: :вторичные колонии начинают\nсо 2 уровня",
    "name": "Автономное производство",
    "req": [
      "n21"
    ],
    "next": [
      "n50",
      "n120"
    ],
    "title": null,
    "x": 1182.89,
    "y": 738,
    "lvl": 8,
    "subtree": "Космос"
  },
  {
    "id": "n116",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Пусковая петля\nСложность: 4, сталь (2), чудо\nЭффект: Орбита +12",
    "name": "Пусковая петля",
    "req": [
      "n56"
    ],
    "next": [],
    "title": null,
    "x": 896.62,
    "y": 421,
    "lvl": 5,
    "subtree": "Космос"
  },
  {
    "id": "n117",
    "type": "parallelogram",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Планетарный магнитный щит\nСложность: 3, сталь(1)\nЭффект: Щит планеты +4",
    "name": "Планетарный магнитный щит",
    "req": [
      "n16"
    ],
    "next": [],
    "title": "Мощный электромагнит вдоль экватора планеты - и все дела.",
    "x": 896.62,
    "y": 632,
    "lvl": 7,
    "subtree": "Космос"
  },
  {
    "id": "n118",
    "type": "fatarrow",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Производственные наборы\nСложность: 5, чудо\nЭффект: разово Производство +10,\nодноразовый",
    "name": "Производственные наборы",
    "req": [
      "n14"
    ],
    "next": [],
    "title": "Очень полезно, если нужно построить что-нибудь в пустой звездной системе.\nИли просто отложить кучу производства про запас",
    "x": 316.16,
    "y": 527,
    "lvl": 6,
    "subtree": "Производство"
  },
  {
    "id": "n119",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Теория досветовой колонизации\nСложность: 2, :корабль 2+\nЭффект: Наука +2,\n:колонии на планетах своей ЗС",
    "name": "Теория досветовой колонизации",
    "req": [
      "n56"
    ],
    "next": [
      "n16",
      "n47",
      "n126"
    ],
    "title": null,
    "x": 1182.89,
    "y": 421,
    "lvl": 5,
    "subtree": "Космос"
  },
  {
    "id": "n120",
    "type": "octagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Хабитат\nСложность: 4, сталь(2)\nЭффект: хабитат, 2 слота,\n+1 свободный куб",
    "name": "Хабитат",
    "req": [
      "n115"
    ],
    "next": [],
    "title": null,
    "x": 1465.69,
    "y": 843,
    "lvl": 9,
    "subtree": "Космос"
  },
  {
    "id": "n121",
    "type": "trapezoid2",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Корабельные заводы\nСложность: 3, 2 слота\nЭффект: Производство +3,\n:для текущей планеты",
    "name": "Корабельные заводы",
    "req": [
      "n21"
    ],
    "next": [],
    "title": "Проблема здесь не в непосредственно орбитальном заводе, а в массовости и масштабируемости\n",
    "x": 1465.69,
    "y": 738,
    "lvl": 8,
    "subtree": "Космос"
  },
  {
    "id": "n122",
    "type": "hexagon",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Сеть дозаправки\nСложность: 5\nЭффект: Антиматерия -1, :операции в\nпобочных колониях не требуют Ресурсов",
    "name": "Сеть дозаправки",
    "req": [
      "n28"
    ],
    "next": [],
    "title": null,
    "x": 893.14,
    "y": 1054,
    "lvl": 11,
    "subtree": "Космос"
  },
  {
    "id": "n123",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Орбитальные \nгенераторы антиматерии\nСложность: 5, тех. Физика бран\nЭффект: Антиматерия +2",
    "name": "Орбитальные  генераторы антиматерии",
    "req": [
      "n91"
    ],
    "next": [
      "n89"
    ],
    "title": null,
    "x": -272.21,
    "y": 1159,
    "lvl": 12,
    "subtree": "Добыча"
  },
  {
    "id": "n124",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Оптимизация добычи\nСложность: 4\nЭффект: :Все ресурсы 1-3 уровня +1",
    "name": "Оптимизация добычи",
    "req": [
      "n19"
    ],
    "next": [
      "n112",
      "n91"
    ],
    "title": null,
    "x": 21.97,
    "y": 948,
    "lvl": 10,
    "subtree": "Добыча"
  },
  {
    "id": "n125",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#000000",
    "fullText": "Министерство Ресурсов\nСложность: 3, \nтех. Общеколониальные программы\nЭффект: +6 кубов к ветви \"Добыча\"",
    "name": "Министерство Ресурсов",
    "req": [
      "n11"
    ],
    "next": [
      "n15"
    ],
    "title": null,
    "x": 21.97,
    "y": 421,
    "lvl": 5,
    "subtree": "Добыча"
  },
  {
    "id": "n126",
    "type": "fatarrow",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Колониальный модуль\nСложность: 3\nЭффект: :позволяет основать новую \nколонию, одноразовый",
    "name": "Колониальный модуль",
    "req": [
      "n119"
    ],
    "next": [],
    "title": "Для колонии в другой звездной системе\nтаких нужно на корабле аж 2 штуки",
    "x": 1465.69,
    "y": 527,
    "lvl": 6,
    "subtree": "Космос"
  },
  {
    "id": "n127",
    "type": "rectangle",
    "treeName": "Industry",
    "borderColor": "#0000FF",
    "fullText": "Шаблонная архитектура\nСложность: 4, специалисты (1)\nЭффект: Строительство +8",
    "name": "Шаблонная архитектура",
    "req": [
      "n23"
    ],
    "next": [
      "n25"
    ],
    "title": null,
    "x": 610.34,
    "y": 843,
    "lvl": 9,
    "subtree": "Производство"
  },
  {
    "id": "n128",
    "type": "ellipse",
    "treeName": "Industry",
    "borderColor": "#FF0000",
    "fullText": "Лунный транспортный узел\nСложность: 4, :луна, чудо\nЭффект: +2 свободных куба, \nОрбита +4",
    "name": "Лунный транспортный узел",
    "req": [
      "n16"
    ],
    "next": [],
    "title": "Освоение луны основной колонии для улучшения поддержки орбитальной инфраструктуры",
    "x": 1465.69,
    "y": 632,
    "lvl": 7,
    "subtree": "Космос"
  },
  {
    "id": "n1",
    "type": "parallelogram2",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Затмение Лисмы\nСложность: 3, тех. Роение\nЭффект: :Атака +3\nдля своих армий на планете",
    "name": "Затмение Лисмы",
    "req": [
      "n47"
    ],
    "next": [],
    "title": null,
    "x": -74.96,
    "y": 269,
    "lvl": 3,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n6",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Быть Беглецами\nСложность: 10\nЭффект: :уникальные \nтехнологии Беглецов",
    "name": "Быть Беглецами",
    "req": [],
    "next": [
      "n47"
    ],
    "title": null,
    "x": -74.96,
    "y": 85,
    "lvl": 1,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n31",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Быть Юнитологической федерацией\nСложность: 10\nЭффект: :уникальные \nтехнологии Юнитологической федерации",
    "name": "Быть Юнитологической федерацией",
    "req": [],
    "next": [
      "n35"
    ],
    "title": null,
    "x": 511.5,
    "y": 85,
    "lvl": 1,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n32",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Быть Инженерами\nСложность: 10\nЭффект: :уникальные \nтехнологии Инженеров",
    "name": "Быть Инженерами",
    "req": [],
    "next": [
      "n36"
    ],
    "title": null,
    "x": 804.72,
    "y": 85,
    "lvl": 1,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n33",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Быть Хоакином\nСложность: 10\nЭффект: :уникальные \nтехнологии Хоакина",
    "name": "Быть Хоакином",
    "req": [],
    "next": [
      "n38"
    ],
    "title": null,
    "x": 1391.18,
    "y": 85,
    "lvl": 1,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n34",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Быть Илонием Джобсом\nСложность: 10\nЭффект: :уникальные \nтехнологии Илония Джобса",
    "name": "Быть Илонием Джобсом",
    "req": [],
    "next": [],
    "title": null,
    "x": 1977.63,
    "y": 85,
    "lvl": 1,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n35",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Создание Некроморфов\nСложность: 3, тех. Искусственные помощники\nЭффект: Наука +2, Общество +1,\n:сделай нас единым",
    "name": "Создание Некроморфов",
    "req": [
      "n31"
    ],
    "next": [
      "n41",
      "n42"
    ],
    "title": null,
    "x": 511.5,
    "y": 177,
    "lvl": 2,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n36",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Забор биоматериала\nСложность: 3\nЭффект: :при уничтожении живого юнита создает\nресурс Заключенные равный [Здоровье] юнита",
    "name": "Забор биоматериала",
    "req": [
      "n32"
    ],
    "next": [
      "n43"
    ],
    "title": null,
    "x": 804.72,
    "y": 177,
    "lvl": 2,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n38",
    "type": "hexagon",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Летающая лаборатория \"Циолковский\"\nСложность: 6\nЭффект: ветвь \"Физика пространства\" +7,\n1 слот, :можно колонизировать ЗС",
    "name": "Летающая лаборатория \"Циолковский\"",
    "req": [
      "n33"
    ],
    "next": [],
    "title": null,
    "x": 1391.18,
    "y": 177,
    "lvl": 2,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n41",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Порождение Некроморфов\nСложность: 3\nЭффект: :при уничтожении живого юнита создает \nравную по сумме здоровья группу Некроморфов",
    "name": "Порождение Некроморфов",
    "req": [
      "n35"
    ],
    "next": [],
    "title": null,
    "x": 511.5,
    "y": 269,
    "lvl": 3,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n42",
    "type": "octagon",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Некроморф\nСложность: 3\nЭффект: пехота, 0 слотов, гигер,\nАтака +3, Скорость +2",
    "name": "Некроморф",
    "req": [
      "n35"
    ],
    "next": [],
    "title": null,
    "x": 218.27,
    "y": 269,
    "lvl": 3,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n43",
    "type": "rectangle",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Принудительное сервиторирование\nСложность: 3, тех. Автономность имплантатов\nЭффект: :преобразует 3 ед Заключенных\nв Сервитора",
    "name": "Принудительное сервиторирование",
    "req": [
      "n36"
    ],
    "next": [
      "n44"
    ],
    "title": "Собсна, Хоакин правильно подметил одну деталь. Учитывая наличие социальных элементов, которые хотят вредить колонии компании \"ИмпТех\", я не вижу других перспектив, окромя сервиторизации преступных элементов. Не гоже халтурщикам и вредителям проедать ресурсы в пустоту, совершил серьёзное преступление против колонии? Принудительное аугментирование и становление биороботом. Что нам для этого нужно?\n\nНаличие преступных элементов, как ресурса, который добывается после уничтожения пуристов/прочей швали, которая идёт против партии.\n\nЭкзокортекс, с целью возможности контролировать мозг преступного элемента, путём вживления необходимой нам прошивки. Автономные импланты, способные поддерживать свою работу за счёт ресурсов организма, дабы эта тварь только кушала, а не тратила полезное для колонии электричество. За счёт этого мы получаем\n\"Принудительное установление имплантов в преступные элементы.\"\n\nСам по себе, это даже скорее опасный проект, а потому, требуется в скорейшем времени начать подавлять разум, строительством специальных зданий, откуда и будет идти корректировка работ и настроений принудительно аугментированых элементов. При уничтожении здания, элементы могут выйти из под контроля и, собсна, начать бунтовать, за всё хорошее.\n\"Здание контроля за биороботами.\"\n",
    "x": 804.72,
    "y": 269,
    "lvl": 3,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n44",
    "type": "octagon",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Сервитор\nСложность: 3, тех. Нейроинтерфейсы\nЭффект: пехота, 0 слотов, гигер,\nПроизводство +3",
    "name": "Сервитор",
    "req": [
      "n43"
    ],
    "next": [],
    "title": null,
    "x": 1097.95,
    "y": 361,
    "lvl": 4,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n45",
    "type": "octagon",
    "treeName": "Unique",
    "borderColor": "#0000FF",
    "fullText": "Жорики\nСложность: 3, :жорик-сеть\nЭффект: пехота, 1 слот, гигер,\nЗащита +2, Скорость +2",
    "name": "Жорики",
    "req": [
      "n47"
    ],
    "next": [],
    "title": null,
    "x": 218.27,
    "y": 177,
    "lvl": 2,
    "subtree": "Уникальные технологии"
  },
  {
    "id": "n47",
    "type": "parallelogram",
    "treeName": "Unique",
    "borderColor": "#FF0000",
    "fullText": "Жорик-сеть\nСложность: 2, :Чуждость не больше 1\nЭффект: Ветка \"Экзобиология\" +2, \nОбщество +1, ГМО +1, :жорик-сеть",
    "name": "Жорик-сеть",
    "req": [
      "n6"
    ],
    "next": [
      "n45",
      "n1"
    ],
    "title": null,
    "x": -74.96,
    "y": 177,
    "lvl": 2,
    "subtree": "Уникальные технологии"
  }
]