var DATA__PLANETS_TIMESTAMP = '2024-12-08T02:14:52.796Z'
var DATA__PLANETS_DATA = {
  'Беглецы': {},
  'Кошкодевочки Карины': {
    'Сметана': {
      stars: ['Сметана'],
      1: {
        name: 'Оладушек', 
      },
    }
  },
  'Юнитологическая федерация': {},
  'Инженеры': {},
  'Хоакин': {
    'Диалектика': {
      stars: ['Теория', 'Практика'],
      2: {
        name: 'Боливар',
        moons: ['Санкра','Грамши', null, 'Гевара']
      },
      3: {
        name: 'Ардор',
        moons: ['Тирадентис']
      },
      4: {
        name: 'Большое Астероидное облако - Теоретическая область',
      },
      5: {
        name: 'Большое Астероидное облако - Практическая область',
      },
      8: {
        name: 'Аврора',
        moons: ['Сабелла','Москва']
      },
      10: {
        name: 'Амаурот',
        moons: ['','Пазолини']
      },
      11: {
        name: 'Практический <br> пояс астероидов',
      },
    }
  },
  'Илоний Джобс': {
    '???': {
      2: {
        name: 'Джамбо',
      },
      7: {
        name: 'Чилли',
      },
      9: {
        name: 'Спарта',
      },
      10: {
        name: 'Дедал',
      },
    }
  },
  '-Пророк Ракель': {}
}