var DATA__PLAYERS_DATA = {
  "Беглецы": {
    "techTable": {
      "Military": [],
      "Sociology": [
        "Колониальная социология"
      ],
      "Biology": [],
      "Industry": [],
      "Science": [
        "Постземная астрономия"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "5",
      "Производство": "4",
      "Общество": "6",
      "Свободные кубы": "2",
      "Начальные параметры": "2/3/2"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Станция кибергорничных"
    ],
    "orbital": [],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета",
        "Психологическая адаптация"
      ],
      "Biology": [
        "Добыча образцов местной жизни",
        "Оценка внешней среды"
      ],
      "Industry": [
        "Экзометеорология"
      ],
      "Science": [
        "Умное окружение"
      ],
      "Specials": [
        "Планетарная разведка"
      ]
    }
  },
  "Кошкодевочки Карины": {
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия"
      ],
      "Science": [],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "3",
      "Производство": "4",
      "Общество": "8",
      "Свободные кубы": "0",
      "Начальные параметры": "2/1/3"
    },
    "buildings": [
      "Базовая электростанция (подз.)",
      "Базовое жильё (подз.)",
      "Космодром (чужое; сломано)",
      "Электростанции (чужое; сломано)",
      "Рекреационные зоны"
    ],
    "orbital": [
      "Гелиоприемник (чужое; сломано)"
    ],
    "localProjs": {
      "Military": [],
      "Sociology": [
        "Психологическая адаптация",
        "Подтверждение авторитета"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": [
        "Планетарная разведка"
      ]
    }
  },
  "Юнитологическая федерация": {
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [
        "Секвенирование ДНК",
        "Генное планирование"
      ],
      "Industry": [
        "Экзоминералогия"
      ],
      "Science": [
        "Колониальная сеть"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "3",
      "Производство": "3",
      "Общество": "4",
      "Свободные кубы": "3",
      "Начальные параметры": "2/2/2"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория"
    ],
    "orbital": [],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация"
      ],
      "Biology": [],
      "Industry": [
        "Георазведка"
      ],
      "Science": [],
      "Specials": []
    }
  },
  "Инженеры": {
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Импланты",
        "Постземная астрономия"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "8",
      "Производство": "6",
      "Общество": "2",
      "Свободные кубы": "1",
      "Начальные параметры": "3/2/1"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Институт физики пространства"
    ],
    "orbital": [],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": [
        "Шикарный ИФП (+1 куб к ветке \"Физика пространства”)"
      ]
    }
  }
}