var DATA__PLAYERS_TIMESTAMP = '2025-07-18T00:56:47.422Z'
var DATA__PLAYERS_TURN = 9
var DATA__PLAYERS_DATA = {
  "Беглецы": {
    "playerColor": "#FF8C00",
    "startingFeature": [
      [
        "Производство",
        "+6"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус",
        "Военная академия",
        "Внутренние войска",
        "Постземная военная тактика",
        "Массовое использование ионисторов",
        "Военные протезы"
      ],
      "Sociology": [
        "Колониальная социология",
        "Новые способы пропаганды",
        "Доктрина целеустремлённости",
        "Трудовой энтузиазм",
        "Колониальное управление",
        "Целевой отбор",
        "Мобилизация населения",
        "Общеколониальные программы",
        "Теория социальных отклонений",
        "Независимые исследователи",
        "Прикладная меметика",
        "Новое законодательство",
        "Постземная экономика",
        "Чуждый разум",
        "Спящие агенты",
        "Новый институт семьи"
      ],
      "Biology": [
        "Оценка биосферы",
        "Экзобиология",
        "Секвенирование ДНК",
        "Инопланетное сельское хозяйство",
        "Оценка свойств местных организмов",
        "Выращивание биополимеров",
        "Экзопочвоведение",
        "Генное планирование",
        "Генная модификация населения",
        "Роение",
        "Новые организмы",
        "Генетическая аристократия",
        "Прикладная метеорология",
        "Теория экстремофилии",
        "Ксеносимбиоз",
        "Аэропоника"
      ],
      "Industry": [
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "Экзоминералогия",
        "Пусковые технологии",
        "3D-печать",
        "Освоение орбиты",
        "Индивидуализация производства",
        "Масштабное производство",
        "Оборонная промышленность"
      ],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Новые типы компьютеров",
        "Анализ несоответствий",
        "Физика элементарных частиц",
        "Бионика",
        "Миниатюризация",
        "Импланты",
        "Самообучение",
        "Компактные квантовые процессоры",
        "Нейроинтерфейсы",
        "Физика бран",
        "Софогенез",
        "Нанокомпьютеры",
        "Автономность имплантатов",
        "Искусственные органы"
      ],
      "Unique": [
        "Быть Беглецами"
      ]
    },
    "planetParams": {
      "Тип планеты": 5,
      "Расстояние до звезды": 5,
      "Вода": 10,
      "Гористость": 2,
      "Ресурсы": 64,
      "Тип аномалии": 8,
      "Масштаб аномалии": 55,
      "Примечания": null
    },
    "starSystemParams": {
      "name": "Баш",
      "planetName": "Лисма",
      "x": 28,
      "y": 39,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 36,
      "generatorCode": "&1=ts00&2=at00&3=tt00&4=at00&5=tl00uucc&6=at00&8=gs01&9=gs02&rest=561363423544146111345212144666436645365235511666215&density=36"
    },
    "colonyParams": {
      "Наука": "43",
      "Производство": "35",
      "Общество": "34",
      "Свободный": "5",
      "Начальные кубы": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "1",
      "экзоты": "",
      "образцы": "4",
      "чуждая среда": "0",
      "непривычная среда": "3",
      "аномалия": "0",
      "рождаемость": "",
      "население": "0/0/50/0/0",
      "доверие": "0",
      "волнения": "3",
      "осуждение": "20"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Станция кибергорничных (сломано)",
      "Институт социологии",
      "Институт физики пространства",
      "Адаптивное производство",
      "Интеллектуальная энергосистема",
      "Рекреационные зоны",
      "Обсерватория",
      "Институт экзобиологии",
      "Ксенопитомник",
      "Ксенофермы",
      "Научная лаборатория",
      "Станции наблюдения",
      "Умное окружение",
      "Колониальная сеть",
      "Опорные пункты сил самообороны",
      "Средства массовой информации",
      "Банк генов",
      "Генная клиника",
      "Шахта",
      "Промышленные рудники",
      "Космодром",
      "Дополненная реальность",
      "Жорик-сеть",
      "Тренировочная база",
      "Ферма биополимеров",
      "Плавильный комбинат",
      "Завод наноматериалов",
      "Энергетические ресурсы",
      "Завод субатомных транзисторов",
      "Контекстная память"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Спутники связи",
      "Космические телескопы",
      "Милитаризация орбиты"
    ],
    "astroProjs": [],
    "prepared": [],
    "greatPeople": [
      {
        "name": "Денис Сухой",
        "lvl": 8,
        "effect": [
          [
            "Исследования (ветка \"Социология\")",
            "+8"
          ]
        ]
      },
      {
        "name": "Глыба",
        "lvl": 4,
        "effect": [
          [
            "Создание армий",
            "2"
          ],
          [
            "Исследования (ветка \"Государство\")",
            "+4/2"
          ]
        ]
      },
      {
        "name": "Химик Кудряш",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Генетика\")",
            "+4"
          ]
        ]
      },
      {
        "name": "Жаба",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Производство\")",
            "+4"
          ]
        ]
      },
      {
        "name": "Кипяток",
        "lvl": 2,
        "effect": [
          [
            "Полиция",
            "+2"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Сталь": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 1,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 1,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Адаптация",
        "+1"
      ],
      [
        "Вода",
        "+20"
      ],
      [
        "особое",
        "ищущие воду Жорикусы"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "земля с запахом аммиака"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Наука",
        "+2"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "легкий наркотик Хреногубки"
      ],
      [
        "Наука",
        "+1"
      ],
      [
        "Исследования (ветка \"Экзобиология\")",
        "+2"
      ],
      [
        "особое",
        "возможность расширения"
      ],
      [
        "Игнорирование критпровала (Генетика)",
        "+1"
      ],
      [
        "Адаптация",
        "+2"
      ],
      [
        "особое",
        "кожа колонистов отдает свекольно-красным"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Подтверждение авторитета (неактивно)",
      "Психологическая адаптация",
      "Добыча образцов местной жизни",
      "Оценка внешней среды",
      "Генная терапия",
      "Экзометеорология",
      "Разборка звездолёта (неактивно)",
      "Планетарная разведка",
      "Адаптация к местным условиям",
      "Георазведка",
      "Экстенсивная добыча",
      "Затмение Лисмы"
    ]
  },
  "Кошкодевочки Карины": {
    "playerColor": "#AFFADE",
    "startingFeature": [
      [
        "особое",
        "+2 к связанным с выживанием кубам"
      ]
    ],
    "techTable": {
      "Military": [
        "Военные протезы",
        "Разведывательный корпус",
        "Военная академия",
        "Внутренние войска"
      ],
      "Sociology": [
        "Мобилизация населения",
        "Целевой отбор",
        "Колониальная социология",
        "Колониальное управление",
        "Независимые исследователи",
        "Новые способы пропаганды",
        "Доктрина целеустремлённости"
      ],
      "Biology": [
        "Инопланетное сельское хозяйство",
        "Экзобиология",
        "Генное планирование",
        "Секвенирование ДНК",
        "Новые организмы",
        "Выращивание биополимеров",
        "Генная модификация населения",
        "Экзопочвоведение",
        "Теория экстремофилии"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "Энергетические ресурсы",
        "Пусковые технологии",
        "Министерство Ресурсов",
        "3D-печать",
        "Освоение орбиты",
        "Масштабное производство"
      ],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Анализ космических лучей",
        "Самообучение",
        "Импланты",
        "Миниатюризация",
        "Нейроинтерфейсы",
        "Компактные квантовые процессоры",
        "Анализ данных о межзвёздной среде",
        "Софогенез",
        "Анализ несоответствий",
        "Искусственные органы",
        "Физика элементарных частиц",
        "Ограниченный ИИ",
        "Многомерные вычисления"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 2,
      "Расстояние до звезды": 1,
      "Вода": 18,
      "Гористость": 2,
      "Ресурсы": 27,
      "Тип аномалии": 10,
      "Масштаб аномалии": 51,
      "Примечания": 0
    },
    "starSystemParams": {
      "name": "Сметана",
      "planetName": "Оладушек",
      "x": 21,
      "y": 13,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 61,
      "generatorCode": "&1=tt00uucc&2=at00&3=at00&4=gm05gtec&5=tm01&7=at00&8=gs06&9=gs06&10=at00&rest=51415332651441543315233536621153134513234216653632&density=61"
    },
    "colonyParams": {
      "Наука": "39",
      "Производство": "31",
      "Общество": "14",
      "Свободный": "10",
      "Начальные кубы": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "население": "0/0/50/0/0",
      "доверие": "3",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Космодром",
      "Электростанции",
      "Базовая электростанция",
      "Базовое жильё",
      "Рекреационные зоны",
      "Адаптивное производство",
      "Шахта",
      "Плавильный комбинат",
      "Промышленные рудники",
      "Станция кибергорничных",
      "Дополненная реальность",
      "Интеллектуальная энергосистема",
      "Научная лаборатория",
      "Обсерватория",
      "Колониальная сеть",
      "Умное окружение",
      "Совет колонии",
      "Ферма биополимеров",
      "Метеостанция",
      "Институт физики пространства",
      "Центр гражданской обороны",
      "Институт социологии",
      "Музей Старой Земли",
      "Музей ксеноцивилизаций",
      "Контекстная память",
      "Мануфактура",
      "Завод субатомных транзисторов",
      "Банк генов",
      "Опорные пункты сил самообороны",
      "Зенитные системы"
    ],
    "orbital": [
      "Гелиоприемник",
      "Первичная орбитальная группировка",
      "Космические телескопы (сломано)",
      "Милитаризация орбиты",
      "Бюро внепланетных ресурсов",
      "Спутники связи"
    ],
    "astroProjs": [],
    "prepared": [
      "бюро пропаганды +1"
    ],
    "greatPeople": [
      {
        "name": "Карина",
        "lvl": 7,
        "effect": [
          [
            "особое",
            "+7 к политическим взаимодействиям"
          ]
        ]
      },
      {
        "name": "Техник Фэй",
        "lvl": 1,
        "effect": []
      },
      {
        "name": "Астронавигатор Дженни",
        "lvl": 2,
        "effect": [
          [
            "Наука",
            "+2"
          ]
        ]
      },
      {
        "name": "Строитель Винди",
        "lvl": 1,
        "effect": [
          [
            "Производство",
            "+1"
          ]
        ]
      },
      {
        "name": "Инопланетный ИИ Пират",
        "lvl": 7,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+7"
          ],
          [
            "особое",
            "?"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Сталь": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 1,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Производство",
        "+1"
      ],
      [
        "особое",
        "жарища пиздец"
      ],
      [
        "Солнце",
        "+2"
      ],
      [
        "Производство",
        "+1"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Пропаганда",
        "+2"
      ],
      [
        "Свободный",
        "1"
      ],
      [
        "Исследования (ветка \"Производство\")",
        "+2"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Психологическая адаптация",
      "Подтверждение авторитета (неактивно)",
      "Оценка внешней среды",
      "Экзометеорология",
      "Разборка звездолёта",
      "Планетарная разведка",
      "Добыча образцов местной жизни (неактивно)",
      "Подземное строительство",
      "Генная терапия",
      "Экстенсивная добыча",
      "Обновление ракетной техники"
    ]
  },
  "Юнитологическая федерация": {
    "playerColor": "#FF0000",
    "startingFeature": [
      [
        "Игнорирование осуждения +4"
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска",
        "Разведывательный корпус",
        "Массовое использование ионисторов",
        "Авиакосмическая подготовка"
      ],
      "Sociology": [
        "Доктрина целеустремлённости",
        "Мобилизация населения",
        "Теория социальных отклонений",
        "Колониальное управление",
        "Целевой отбор",
        "Общеколониальные программы"
      ],
      "Biology": [
        "Секвенирование ДНК",
        "Генное планирование",
        "Генетическая аристократия",
        "Генная модификация населения",
        "Роение",
        "Новые организмы",
        "Экзобиология",
        "Теория экстремофилии",
        "Инопланетное сельское хозяйство",
        "Выращивание биополимеров",
        "Направленная эволюция",
        "Пантропия",
        "Экзопочвоведение",
        "Искусственные помощники",
        "Сверхчеловеческая адаптация",
        "Прикладная метеорология",
        "Живорастущие дома",
        "Аэропоника",
        "Тотальная перестройка генома",
        "Пустотная адаптация"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "Пусковые технологии",
        "Освоение орбиты",
        "3D-печать",
        "Теория досветовой колонизации",
        "Автономное производство",
        "Индивидуализация производства",
        "Масштабное производство",
        "Орбитальное производство"
      ],
      "Science": [
        "Колониальная сеть",
        "Новые типы компьютеров",
        "Миниатюризация",
        "Туманные вычисления",
        "Постземная астрономия",
        "Анализ космических лучей",
        "Самообучение",
        "Компактные квантовые процессоры",
        "Софогенез",
        "Бионика",
        "Анализ данных о межзвёздной среде",
        "Анализ несоответствий",
        "Импланты"
      ],
      "Unique": [
        "Быть Юнитологической федерацией",
        "Создание Некроморфов"
      ]
    },
    "planetParams": {
      "Тип планеты": 5,
      "Расстояние до звезды": 7,
      "Вода": 12,
      "Гористость": 4,
      "Ресурсы": 1,
      "Тип аномалии": 6,
      "Масштаб аномалии": 60,
      "Примечания": 0
    },
    "starSystemParams": {
      "name": "Энигма",
      "planetName": "Гидеон",
      "x": 29,
      "y": 14,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 37,
      "generatorCode": "&1=at00&2=ts00&3=tt00&4=tt00&7=tl01uucc&8=gm04gtec&9=gm04&rest=5324362631224256236316546164425514553636314215555114&density=37"
    },
    "colonyParams": {
      "Наука": "33",
      "Производство": "26",
      "Общество": "27",
      "Свободный": "7",
      "Начальные кубы": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "1",
      "непривычная среда": "0",
      "аномалия": "0",
      "население": "0/0/50/0/0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Дополненная реальность",
      "Адаптивное производство",
      "Генная клиника",
      "Обсерватория",
      "Рекреационные зоны",
      "Станция кибергорничных",
      "Умное окружение",
      "Шахта",
      "Промышленные рудники",
      "Интеллектуальная энергосистема",
      "Институт социологии",
      "Центр гражданской обороны",
      "Банк генов",
      "Институт экзобиологии",
      "Мануфактура",
      "Средства массовой информации",
      "Плавильный комбинат",
      "Ферма биополимеров",
      "Космодром"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Космические телескопы",
      "Звездолёт Рассеяния",
      "Спутники связи",
      "Лагранжевы телескопы",
      "Милитаризация орбиты"
    ],
    "astroProjs": [],
    "prepared": [
      "технология \"Энергетические ресурсы\" -1 (Проблемы с трансуранами)",
      " технология \"Прикладная меметика\" +1",
      " разово Наука +1"
    ],
    "greatPeople": [
      {
        "name": "Фил Спенсер",
        "lvl": 9,
        "effect": [
          [
            "Исследования (ветка \"Генетика\")",
            "+9"
          ]
        ]
      },
      {
        "name": " Рикки Спаркс",
        "lvl": 3,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+3"
          ],
          [
            "особое",
            "?гомункул"
          ]
        ]
      },
      {
        "name": "Нанитыч",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Добыча\")",
            "+4"
          ]
        ]
      },
      {
        "name": "Орбитальщик",
        "lvl": 1,
        "effect": [
          [
            "Орбита",
            "+2"
          ]
        ]
      },
      {
        "name": "Лиланд Койл",
        "lvl": 1,
        "effect": [
          [
            "Полиция",
            "+2"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Сталь": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 0,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "особое",
        "кожа колонистов серая и чешуйчатая"
      ],
      [
        "особое",
        "порий"
      ],
      [
        "Строительство",
        "+2"
      ],
      [
        "особое",
        "?вероятно горючий?"
      ],
      [
        "Ресурсы",
        "+26"
      ],
      [
        "особое",
        "маргинальная группа"
      ],
      [
        "Исследования (ветка \"Генетика\")",
        "+3"
      ],
      [
        "особое",
        "?стремятся к открытию \"Автоэволюции\""
      ],
      [
        "Наука",
        "-2"
      ],
      [
        "Исследования (ветка \"Генетика\")",
        "+4"
      ],
      [
        "особое",
        "?спасибо пермутаторам"
      ],
      [
        "Вода",
        "+20"
      ],
      [
        "особое",
        "Производство юнитов с меткой \"гигер\" +3"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Психологическая адаптация",
      "Подтверждение авторитета (неактивно)",
      "Генная терапия",
      "Оценка внешней среды",
      "Георазведка",
      "Экзометеорология",
      "Подземное строительство",
      "Адаптация к местным условиям",
      "Обновление ракетной техники",
      "Экстенсивная добыча",
      "Силикатные бактерии",
      "Адаптация земных микроорганизмов"
    ]
  },
  "Инженеры": {
    "playerColor": "#9900ff",
    "startingFeature": [
      [
        "разово",
        "+1 великий человек \"Компьютеры\""
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска",
        "Разведывательный корпус",
        "Военные протезы",
        "Военная академия",
        "Массовое использование ионисторов"
      ],
      "Sociology": [
        "Колониальная социология",
        "Целевой отбор",
        "Новые способы пропаганды",
        "Колониальное управление",
        "Мобилизация населения",
        "Двоемыслие",
        "Общеколониальные программы",
        "Новое законодательство",
        "Доктрина целеустремлённости",
        "Культура хрома",
        "Трудовой энтузиазм",
        "Теория социальных отклонений"
      ],
      "Biology": [
        "Экзобиология",
        "Секвенирование ДНК",
        "Генная модификация населения",
        "Генное планирование",
        "Инопланетное сельское хозяйство",
        "Новые организмы",
        "Генетическая аристократия"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "3D-печать",
        "Министерство Ресурсов",
        "Пусковые технологии"
      ],
      "Science": [
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Импланты",
        "Постземная астрономия",
        "Искусственные органы",
        "Нейроинтерфейсы",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Миниатюризация",
        "Самообучение",
        "Анализ несоответствий",
        "Компактные квантовые процессоры",
        "Софогенез",
        "Физика элементарных частиц",
        "Экранирование имплантов",
        "Мобилизация населения",
        "Автономность имплантатов",
        "Нанокомпьютеры",
        "Малоинвазивные методики",
        "Физика бран",
        "Нанороботы",
        "Медицинские наномашины",
        "Ограниченный ИИ"
      ],
      "Unique": [
        "Быть Инженерами",
        "Забор биоматериала",
        "Принудительное сервиторирование"
      ]
    },
    "planetParams": {
      "Тип планеты": 2,
      "Расстояние до звезды": 3,
      "Темп-ра": 0,
      "Вода": 49,
      "Гористость": 1,
      "Ресурсы": 5,
      "Тип аномалии": 9,
      "Масштаб аномалии": 58,
      "Примечания": null
    },
    "starSystemParams": {
      "name": "Доплер 17",
      "planetName": "Истваан 5",
      "x": 36,
      "y": 5,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 25,
      "generatorCode": "&2=ts00&3=ts00uucc&5=at00&6=at00&9=gs03&rest=6615565123144335314655534212251624544321653412246111215111453555321552221111352241&density=25"
    },
    "colonyParams": {
      "Наука": "34",
      "Производство": "30",
      "Общество": "26",
      "Свободный": "12",
      "Начальные кубы": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "1",
      "щит планеты": "",
      "защита колонии": "5",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "2",
      "непривычная среда": "2",
      "аномалия": "0",
      "население": "0/0/50/0/0",
      "доверие": "1",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Защитный купол",
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Институт физики пространства",
      "Дополненная реальность",
      "Станция кибергорничных",
      "Совет колонии",
      "Контекстная память",
      "Адаптивное производство",
      "Клиника имплантов",
      "Институт социологии",
      "Центр добровольного содействия",
      "Электростанции",
      "Обсерватория",
      "Интеллектуальная энергосистема",
      "Опорные пункты сил самообороны",
      "Рекреационные зоны",
      "Музей Старой Земли",
      "Реактор термоядерного синтеза",
      "Экзокортекс",
      "Колониальная сеть",
      "Умное окружение",
      "Когнитивные расширители",
      "Шахта",
      "Плавильный комбинат",
      "Зенитные системы",
      "Энергетические ресурсы",
      "Ускоритель частиц",
      "Завод субатомных транзисторов",
      "Завод наноматериалов",
      "Промышленные рудники",
      "Мануфактура",
      "Институт экзобиологии",
      "Станции наблюдения",
      "Бюро пропаганды"
    ],
    "orbital": [
      "Звездолёт Рассеяния",
      "Первичная орбитальная группировка",
      "Космические телескопы",
      "Спутники связи",
      "Гелиоприемник"
    ],
    "astroProjs": [],
    "prepared": [],
    "greatPeople": [
      {
        "name": "Скэсуед Анихам",
        "lvl": 11,
        "effect": [
          [
            "Исследования (ветка \"Импланты\")",
            "+11"
          ]
        ]
      },
      {
        "name": "Зачатки ИИ \"Инверсия\"",
        "lvl": 6,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+6"
          ]
        ]
      },
      {
        "name": "Свон",
        "lvl": 7,
        "effect": [
          [
            "Строительство",
            "+7"
          ]
        ]
      },
      {
        "name": "Аркадия",
        "lvl": 6,
        "effect": [
          [
            "Создание армий",
            "6"
          ]
        ]
      },
      {
        "name": "Ева МакКенна",
        "lvl": 4,
        "effect": [
          [
            "Пропаганда",
            "+4"
          ]
        ]
      },
      {
        "name": "Генерал Гривус",
        "lvl": 3,
        "effect": [
          [
            "Защита армий",
            "+3"
          ]
        ]
      },
      {
        "name": "Профессор Сахаров",
        "lvl": 4,
        "effect": []
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Сталь": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 1,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 1,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Сталь",
        "+1"
      ],
      [
        "Ресурсы",
        "+20"
      ],
      [
        "Общество",
        "+2"
      ],
      [
        "Наука",
        "-1"
      ],
      [
        "особое",
        "?пища"
      ],
      [
        "особое",
        "база бунтовщиков где-то ближе к дневной стороне"
      ],
      [
        "Защита колонии",
        "1"
      ],
      [
        "Сталь",
        "-1"
      ],
      [
        "особое",
        "?требуют немножко роботов в шахты"
      ],
      [
        "Исследования (ветка \"Добыча\")",
        "+4"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Подтверждение авторитета (неактивно)",
      "Психологическая адаптация",
      "Оценка внешней среды",
      "Подземное строительство",
      "Георазведка (неактивно)",
      "Экзометеорология",
      "Экстенсивная добыча",
      "Подкожные скафандры",
      ":Шикарный ИФП (+1 куб к ветке \"Физика пространства\")",
      "Генная терапия",
      "Оценка биосферы"
    ]
  },
  "Хоакин": {
    "playerColor": "#800000",
    "startingFeature": [
      [
        "Строительство",
        "+2"
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска",
        "Разведывательный корпус",
        "Военная академия"
      ],
      "Sociology": [
        "Целевой отбор",
        "Мобилизация населения",
        "Колониальная социология",
        "Колониальное управление",
        "Общеколониальные программы",
        "Новые способы пропаганды",
        "Новое законодательство",
        "Двоемыслие",
        "Независимые исследователи",
        "Доктрина целеустремлённости"
      ],
      "Biology": [
        "Секвенирование ДНК",
        "Экзобиология",
        "Генное планирование",
        "Генетическая аристократия",
        "Инопланетное сельское хозяйство"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "3D-печать",
        "Пусковые технологии",
        "Освоение орбиты",
        "Индивидуализация производства",
        "Масштабное производство",
        "Теория досветовой колонизации"
      ],
      "Science": [
        "Постземная астрономия",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Звёдные карты",
        "Миниатюризация",
        "Анализ несоответствий",
        "Бионика",
        "Физика элементарных частиц",
        "Компактные квантовые процессоры",
        "Самообучение",
        "Софогенез",
        "Импланты"
      ],
      "Unique": [
        "Быть Хоакином"
      ]
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 8,
      "Вода": 32,
      "Гористость": 4,
      "Ресурсы": 84,
      "Тип аномалии": 10,
      "Масштаб аномалии": 9,
      "Примечания": null
    },
    "starSystemParams": {
      "name": "Диалектика",
      "planetName": "Аврора",
      "x": 15,
      "y": 28,
      "Тип, масса и возраст звезды": "1.1/, Теория",
      "Плотность звёздной системы": 63,
      "generatorCode": "&2=gl06gtep&3=ts01&4=at00&5=at00&8=th05uucc&10=gs05&11=at00&rest=43646112334212131636244444362166631311121523356315&density=63"
    },
    "colonyParams": {
      "Наука": "29",
      "Производство": "19",
      "Общество": "20",
      "Свободный": "5",
      "Начальные кубы": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "1",
      "непривычная среда": "2",
      "аномалия": "0",
      "население": "0/0/50/0/0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "7"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Центр гражданской обороны",
      "Научная лаборатория",
      "Станция кибергорничных",
      "Рекреационные зоны",
      "Институт социологии",
      "Адаптивное производство",
      "Обсерватория",
      "Колониальная сеть",
      "Умное окружение",
      "Шахта",
      "Музей ксеноцивилизаций",
      "Музей Старой Земли",
      "Совет колонии",
      "Плавильный комбинат",
      "Промышленные рудники",
      "Дополненная реальность",
      "Средства массовой информации",
      "Институт экзобиологии",
      "Институт физики пространства",
      "Ускоритель частиц",
      "Опорные пункты сил самообороны",
      "Монумент двадцать первого века",
      "Центр добровольного содействия",
      "Банк генов",
      "Интеллектуальная энергосистема",
      "Завод наноматериалов"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Милитаризация орбиты",
      "Космические телескопы"
    ],
    "astroProjs": [
      "Летающая лаборатория \"Циолковский\""
    ],
    "prepared": [
      "Производство (6)",
      " Клонирование Людоящеров (2)"
    ],
    "greatPeople": [
      {
        "name": "Хоакин Паэс ",
        "lvl": 5,
        "effect": [
          [
            "Исследования (ветка \"Государство\")",
            "+5"
          ]
        ]
      },
      {
        "name": "Соломон Шошани",
        "lvl": 5,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+5"
          ]
        ]
      },
      {
        "name": "Оливер Ромеро",
        "lvl": 5,
        "effect": [
          [
            "Исследования (ветка \"Вооружение и защита\")",
            "+5"
          ]
        ]
      },
      {
        "name": " Юи Ватанабэ",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Война в космосе\")",
            "+1"
          ]
        ]
      },
      {
        "name": "Господин Э-С (Роршах)",
        "lvl": 3,
        "effect": [
          [
            "Исследования (ветка \"Социология\")",
            "+3"
          ]
        ]
      },
      {
        "name": "Нора Пенья",
        "lvl": 6,
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "+6"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Сталь": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 1,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 2,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Исследования (ветка \"Социология\")",
        "+1"
      ],
      [
        "Исследования (ветка \"Государство\")",
        "+2"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Аномалия",
        "+1"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Конверсия",
        "+1"
      ],
      [
        "Производство",
        "+2"
      ],
      [
        "Строительство",
        "+2"
      ],
      [
        "Исследования (ветка \"Физика пространства\")",
        "2"
      ],
      [
        "Исследования (ветка \"Экзобиология\")",
        "-1"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Подтверждение авторитета (неактивно)",
      "Психологическая адаптация",
      "Оценка внешней среды",
      "Генная терапия",
      "Экзометеорология",
      "Разборка звездолёта",
      "Экстенсивная добыча"
    ]
  },
  "Илоний Джобс": {
    "playerColor": "#FF00FF",
    "startingFeature": [
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "?улучшаемы"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус",
        "Милитаризация орбиты",
        "Внутренние войска",
        "Военные протезы",
        "Массовое использование ионисторов",
        "Авиакосмическая подготовка",
        "Удержание плазмы"
      ],
      "Sociology": [
        "Колониальная социология",
        "Новые способы пропаганды",
        "Мобилизация населения",
        "Доктрина целеустремлённости",
        "Колониальное управление"
      ],
      "Biology": [
        "Экзобиология",
        "Секвенирование ДНК",
        "Инопланетное сельское хозяйство",
        "Выращивание биополимеров",
        "Генная модификация населения",
        "Экзопочвоведение"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Пусковые технологии",
        "Освоение орбиты",
        "Энергетические ресурсы",
        "Теория досветовой колонизации",
        "Экзоскелеты",
        "Базовая автоматизация",
        "Орбитальное производство",
        "Индустриализация космоса",
        "3D-печать"
      ],
      "Science": [
        "Постземная астрономия",
        "Анализ космических лучей",
        "Бионика",
        "Туманные вычисления",
        "Импланты",
        "Новые типы компьютеров",
        "Искусственные органы",
        "Анализ данных о межзвёздной среде",
        "Анализ несоответствий",
        "Миниатюризация",
        "Автономность имплантатов",
        "Физика элементарных частиц"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 11,
      "Вода": 39,
      "Гористость": 3,
      "Ресурсы": 73,
      "Тип аномалии": 9,
      "Масштаб аномалии": 91,
      "Примечания": null
    },
    "starSystemParams": {
      "name": "???",
      "planetName": "Волт",
      "x": 12,
      "y": 39,
      "Тип, масса и возраст звезды": "G, 0.95, 2.6",
      "Плотность звёздной системы": 42,
      "generatorCode": "&2=tt00uu&3=ts01&7=tt00uu&8=ts00&9=tt00uu&10=at00uu&11=th04uucc&rest=15152666145616614542461153316611345453214523323432425562435311111321536321461265&density=42"
    },
    "colonyParams": {
      "Наука": "27",
      "Производство": "33",
      "Общество": "16",
      "Свободный": "5",
      "Начальные кубы": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "1",
      "экзоты": "1",
      "образцы": "2",
      "чуждая среда": "2",
      "непривычная среда": "2",
      "аномалия": "1",
      "население": "0/0/50/0/0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Институт социологии",
      "Космодром",
      "Умное окружение",
      "Шахта",
      "Плавильный комбинат",
      "Рекреационные зоны",
      "Совет колонии",
      "Институт физики пространства",
      "Колониальная сеть",
      "Адаптивное производство",
      "Обсерватория",
      "Опорные пункты сил самообороны",
      "Музей ксеноцивилизаций",
      "Генная клиника (сломано)",
      "Промышленные рудники",
      "Станция кибергорничных",
      "Интеллектуальная энергосистема",
      "Тренировочная база",
      "Мануфактура",
      "Ксенофермы",
      "Ферма биополимеров",
      "Ускоритель частиц",
      "Завод субатомных транзисторов"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Спутники связи",
      "Институт экзобиологии (орб.)",
      "Банк генов (орб.)",
      "Космические телескопы",
      "Лагранжевы телескопы"
    ],
    "astroProjs": [],
    "prepared": [
      "Сложность \"Теория социальных отклонений\" +1",
      " Свободный +8"
    ],
    "greatPeople": [
      {
        "name": "Илоний Джобс",
        "lvl": 5,
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "+5"
          ]
        ]
      },
      {
        "name": " Терри Рипли",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Генетика\")",
            "+1"
          ]
        ]
      },
      {
        "name": "Си Пи Тон",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Физика пространства\")",
            "+1"
          ]
        ]
      }
    ],
    "secondaryColonies": [
      {
        "lvl": "1",
        "specialty": "Космос",
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "+4"
          ],
          [
            "Производство",
            "+1"
          ]
        ]
      },
      {
        "lvl": "1",
        "specialty": "Космос",
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "+4"
          ],
          [
            "Производство",
            "+1"
          ]
        ]
      },
      {
        "lvl": "1",
        "specialty": "Война В Космосе",
        "effect": [
          [
            "Исследования (ветка \"Война В Космосе\")",
            "+4"
          ],
          [
            "Производство",
            "+1"
          ]
        ]
      },
      {
        "lvl": "1",
        "specialty": "Наземный Бой",
        "effect": [
          [
            "Исследования (ветка \"Наземный бой\")",
            "+4"
          ],
          [
            "Производство",
            "+1"
          ]
        ]
      }
    ],
    "materials": {
      "Сталь": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 4,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Трансураны",
        "+1"
      ],
      [
        "Исследования (ветка \"Вооружение и защита\")",
        "+2"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Трансураны",
        "+1"
      ],
      [
        "Производство",
        "+2"
      ],
      [
        "Строительство",
        "+6"
      ],
      [
        "Аномалия",
        "+1"
      ],
      [
        "Метеозащита",
        "+2"
      ],
      [
        "Исследования (ветка \"Физика пространства\")",
        "+3"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Экзоты",
        "+1"
      ],
      [
        "особое",
        "?"
      ],
      [
        "особое",
        "?изучите \"Самообучение\" или сделайте специальный проект стоимостью 3 \"Великая переустановка\" чтобы его задавить"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Психологическая адаптация",
      "Подтверждение авторитета (неактивно)",
      "Оценка внешней среды",
      "Добыча образцов местной жизни",
      "Георазведка",
      "Подземное строительство",
      "Экзометеорология",
      "Восстановление звездолёта",
      "Обновление ракетной техники",
      "Оценка биосферы",
      "Генная терапия",
      "Экстенсивная добыча",
      "Оценка свойств местных организмов"
    ]
  },
  "-Пророк Ракель": {
    "playerColor": "#D0F0C0",
    "startingFeature": [
      [
        "особое",
        "+1 свободный куб для проектов"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [
        "Экзобиология"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 1,
      "Вода": 89,
      "Гористость": 5,
      "Ресурсы": 98,
      "Тип аномалии": 9,
      "Масштаб аномалии": 77,
      "Примечания": null
    },
    "starSystemParams": {
      "name": "Хайбразил",
      "planetName": "Кухулин",
      "x": 36,
      "y": 13,
      "Тип, масса и возраст звезды": "G/1.0/2.5 ",
      "Плотность звёздной системы": 99,
      "generatorCode": "&1=th01uucc&2=ts03&3=ts04&4=tt00&5=at00&6=at00&7=gm09&8=gm05&9=gm10&10=at00&11=gs05&rest=32333263353245216415443133551436411121265352652&density=99"
    },
    "colonyParams": {
      "Наука": "6",
      "Производство": "5",
      "Общество": "11",
      "Свободный": "0",
      "Начальные кубы": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "3",
      "непривычная среда": "0",
      "аномалия": "0",
      "население": "0/0/50/0/0",
      "доверие": "1",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [],
    "orbital": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Колониальная сеть",
      "Шахта",
      "Звездолёт Рассеяния"
    ],
    "astroProjs": [],
    "prepared": [],
    "greatPeople": [
      {
        "name": " пророк Ракель",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+2"
          ]
        ]
      },
      {
        "name": "Ксенослизни",
        "lvl": 3,
        "effect": [
          [
            "особое",
            "ксенослизни 3 шт и +1 в ход"
          ],
          [
            "особое",
            "1d3 урона по Производству"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Сталь": 0,
      "Редкие металлы": 0,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 1,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Сталь",
        "-1"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Строительство",
        "-1"
      ],
      [
        "особое",
        "?устранение за Общество 1"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": [
      "Подтверждение авторитета (неактивно)",
      "Психологическая адаптация",
      "Оценка внешней среды",
      "Экзометеорология"
    ]
  }
}