var DATA__PLAYERS_TIMESTAMP = '2024-09-13T00:49:50.991Z'
var DATA__PLAYERS_DATA = {
  "Беглецы": {
    "playerColor": "#00FFFF",
    "startingFeature": [
      [
        "Производство",
        "+5"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус",
        "Военная академия",
        "Внутренние войска"
      ],
      "Sociology": [
        "Колониальная социология",
        "Новые способы пропаганды",
        "Доктрина целеустремлённости",
        "Трудовой энтузиазм",
        "Колониальное управление",
        "Целевой отбор",
        "Мобилизация населения",
        "Общеколониальные программы",
        "Теория социальных отклонений",
        "Независимые исследователи"
      ],
      "Biology": [
        "Оценка биосферы",
        "Экзобиология",
        "Секвенирование ДНК",
        "Инопланетное сельское хозяйство",
        "Оценка свойств местных организмов",
        "Выращивание биополимеров",
        "Экзопочвоведение",
        "Генное планирование",
        "Генная модификация населения"
      ],
      "Industry": [
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "Экзоминералогия",
        "Пусковые технологии",
        "3D-печать"
      ],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Новые типы компьютеров",
        "Анализ несоответствий",
        "Физика элементарных частиц",
        "Бионика",
        "Миниатюризация",
        "Импланты"
      ],
      "Unique": [
        "Быть Беглецами"
      ]
    },
    "planetParams": {
      "Тип планеты": 5,
      "Расстояние до звезды": 5,
      "Вода": 10,
      "Гористость": 2,
      "Ресурсы": 64,
      "Тип аномалии": 8,
      "Масштаб аномалии": 55,
      "Примечания": 0
    },
    "starSystemParams": {
      "x": 28,
      "y": 39,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 36,
      "generatorCode": "&1=ts00&2=at00&3=tt00&4=at00&5=tl00uucc&6=at00&8=gs01&9=gs02&rest=561363423544146111345212144666436645365235511666215&density=36"
    },
    "colonyParams": {
      "Наука": "21",
      "Производство": "19",
      "Общество": "23",
      "Свободный": "4",
      "Начальные кубы": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "1",
      "экзоты": "",
      "образцы": "4",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "1"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Станция кибергорничных",
      "Институт социологии",
      "Институт физики пространства",
      "Адаптивное производство",
      "Интеллектуальная энергосистема",
      "Рекреационные зоны",
      "Обсерватория",
      "Институт экзобиологии",
      "Ксенопитомник",
      "Ксенофермы",
      "Научная лаборатория",
      "Станции наблюдения",
      "Умное окружение",
      "Колониальная сеть",
      "Опорные пункты сил самообороны",
      "Средства массовой информации",
      "Банк генов",
      "Генная клиника",
      "Шахта",
      "Промышленные рудники",
      "Космодром",
      "Дополненная реальность"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Спутники связи"
    ],
    "astroProjs": [],
    "prepaired": [],
    "greatPeople": [
      {
        "name": "Денис Сухой",
        "lvl": 7,
        "effect": [
          [
            "Исследования (ветка \"Социология\")",
            "+7"
          ]
        ]
      },
      {
        "name": "Глыба",
        "lvl": 4,
        "effect": [
          [
            "?особое",
            "НЕАКТИВНО возможно перепрофилирование Создание армий +4"
          ]
        ]
      },
      {
        "name": "Жаба",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Производство\")",
            "+2"
          ]
        ]
      },
      {
        "name": "Генетик",
        "lvl": 2,
        "effect": []
      },
      {
        "name": "Философ",
        "lvl": 2,
        "effect": []
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Добыча": 3,
      "Редкие металлы": 0,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 0,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Адаптация",
        "+1"
      ],
      [
        "Вода",
        "20"
      ],
      [
        "особое",
        "ищущие воду Жорикусы"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "земля с запахом аммиака"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Наука",
        "+2"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "легкий наркотик Хреногубки"
      ],
      [
        "Наука",
        "+1"
      ],
      [
        "Исследования (ветка \"Экзобиология\")",
        "+2"
      ],
      [
        "особое",
        "возможность расширения"
      ],
      [
        "особое",
        "можно раз в ход считать критпровал в ветке Генетика обычным провалом"
      ],
      [
        "Адаптация",
        "+2"
      ],
      [
        "особое",
        "кожа колонистов отдает свекольно-красным"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Подтверждение авторитета (неактивно)",
      "Психологическая адаптация",
      "Добыча образцов местной жизни",
      "Оценка внешней среды",
      "Генная терапия",
      "Экзометеорология",
      "Разборка звездолёта (неактивно)",
      "Планетарная разведка",
      "Адаптация к местным условиям"
    ]
  },
  "-Кошкодевочки Карины": {
    "playerColor": "#AFFADE",
    "startingFeature": [
      [
        "особое",
        "+2 к связанным с выживанием кубам"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [
        "Мобилизация населения",
        "Целевой отбор",
        "Колониальная социология",
        "Колониальное управление"
      ],
      "Biology": [
        "Инопланетное сельское хозяйство",
        "Экзобиология",
        "Генное планирование",
        "Секвенирование ДНК"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "Энергетические ресурсы"
      ],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Анализ космических лучей",
        "Самообучение",
        "Импланты",
        "Миниатюризация",
        "Нейроинтерфейсы"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 2,
      "Расстояние до звезды": 1,
      "Вода": 18,
      "Гористость": 2,
      "Ресурсы": 27,
      "Тип аномалии": 10,
      "Масштаб аномалии": 51,
      "Примечания": 0
    },
    "starSystemParams": {
      "x": 21,
      "y": 13,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 61,
      "generatorCode": "&1=tt00uucc&2=at00&3=at00&4=gm05gtec&5=tm01&7=at00&8=gs06&9=gs06&10=at00&rest=51415332651441543315233536621153134513234216653632&density=61"
    },
    "colonyParams": {
      "Наука": "12",
      "Производство": "22",
      "Общество": "9",
      "Свободный": "4",
      "Начальные кубы": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "1",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Космодром (чужое; сломано)",
      "Электростанции (чужое)",
      "Базовая электростанция",
      "Базовое жильё",
      "Рекреационные зоны",
      "Адаптивное производство",
      "Шахта",
      "Плавильный комбинат",
      "Промышленные рудники",
      "Станция кибергорничных",
      "Дополненная реальность",
      "Интеллектуальная энергосистема",
      "Научная лаборатория",
      "Обсерватория",
      "Колониальная сеть",
      "Умное окружение",
      "Совет колонии"
    ],
    "orbital": [
      "Гелиоприемник (чужое; сломано)",
      "Первичная орбитальная группировка (чужое)"
    ],
    "astroProjs": [],
    "prepaired": [
      "Ветвь \"Генетика\" -1"
    ],
    "greatPeople": [
      {
        "name": "Карина",
        "lvl": 5,
        "effect": [
          [
            "особое",
            "+5 к политическим взаимодействиям"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Добыча": 2,
      "Редкие металлы": 1,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 1,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Производство",
        "+1"
      ],
      [
        "особое",
        "жарища пиздец"
      ],
      [
        "Солнце",
        "+2"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Пропаганда",
        "+2"
      ],
      [
        "Свободный",
        "1"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Психологическая адаптация",
      "Подтверждение авторитета (неактивно)",
      "Оценка внешней среды",
      "Экзометеорология",
      "Разборка звездолёта",
      "Планетарная разведка",
      "Добыча образцов местной жизни (неактивно)",
      "Подземное строительство"
    ]
  },
  "Юнитологическая федерация": {
    "playerColor": "#FF0000",
    "startingFeature": [
      [
        "особое",
        "население не производит осуждение при исследовании биотеха"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [
        "Доктрина целеустремлённости",
        "Мобилизация населения",
        "Теория социальных отклонений"
      ],
      "Biology": [
        "Секвенирование ДНК",
        "Генное планирование",
        "Генетическая аристократия",
        "Генная модификация населения",
        "Роение",
        "Новые организмы",
        "Экзобиология",
        "Теория экстремофилии",
        "Инопланетное сельское хозяйство",
        "Выращивание биополимеров",
        "Направленная эволюция",
        "Пантропия",
        "Экзопочвоведение"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "Пусковые технологии",
        "Освоение орбиты",
        "3D-печать"
      ],
      "Science": [
        "Колониальная сеть",
        "Новые типы компьютеров",
        "Миниатюризация",
        "Туманные вычисления",
        "Постземная астрономия",
        "Анализ космических лучей",
        "Самообучение",
        "Компактные квантовые процессоры",
        "Софогенез"
      ],
      "Unique": [
        "Быть Юнитологической федерацией"
      ]
    },
    "planetParams": {
      "Тип планеты": 5,
      "Расстояние до звезды": 7,
      "Вода": 12,
      "Гористость": 4,
      "Ресурсы": 1,
      "Тип аномалии": 6,
      "Масштаб аномалии": 60,
      "Примечания": 0
    },
    "starSystemParams": {
      "x": 29,
      "y": 14,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 37,
      "generatorCode": "&1=at00&2=ts00&3=tt00&4=tt00&7=tl01uucc&8=gm04gtec&9=gm04&rest=5324362631224256236316546164425514553636314215555114&density=37"
    },
    "colonyParams": {
      "Наука": "23",
      "Производство": "21",
      "Общество": "15",
      "Свободный": "5",
      "Начальные кубы": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "7"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Дополненная реальность",
      "Адаптивное производство",
      "Генная клиника",
      "Обсерватория",
      "Рекреационные зоны",
      "Станция кибергорничных",
      "Умное окружение",
      "Шахта",
      "Промышленные рудники",
      "Интеллектуальная энергосистема",
      "Плавильный комбинат",
      "Завод биополимеров",
      "Космодром"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Космические телескопы",
      "Звездолёт Рассеяния",
      "Спутники связи"
    ],
    "astroProjs": [],
    "prepaired": [],
    "greatPeople": [
      {
        "name": "Фил Спенсер",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Генетика\")",
            "+4"
          ]
        ]
      },
      {
        "name": " Рикки Спаркс",
        "lvl": 3,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+3"
          ]
        ]
      },
      {
        "name": "Нанитыч",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Добыча\")",
            "+2"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Добыча": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 0,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "особое",
        "кожа колонистов серая и чешуйчатая"
      ],
      [
        "Строительство",
        "+2"
      ],
      [
        "особое",
        "?вероятно горючий?"
      ],
      [
        "Ресурсы",
        "26"
      ],
      [
        "особое",
        "маргинальная группа"
      ],
      [
        "Исследования (ветка \"Генетика\")",
        "+3"
      ],
      [
        "особое",
        "?стремятся к открытию \"Автоэволюции\""
      ],
      [
        "Наука",
        "-1"
      ],
      [
        "Исследования (ветка \"Генетика\")",
        "+2"
      ],
      [
        "особое",
        "?спасибо пермутаторам"
      ],
      [
        "особое",
        "?спасибо пермутаторам"
      ],
      [
        "особое",
        "?пока нет эффекта"
      ],
      [
        "Вода",
        "20"
      ],
      [
        "особое",
        "Производство юнитов с меткой \"гигер\" +3"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Психологическая адаптация",
      "Подтверждение авторитета (неактивно)",
      "Генная терапия",
      "Оценка внешней среды",
      "Георазведка",
      "Экзометеорология",
      "Подземное строительство",
      "Адаптация к местным условиям",
      "Обновление ракетной техники",
      "Экстенсивная добыча"
    ]
  },
  "Инженеры": {
    "playerColor": "#9900ff",
    "startingFeature": [
      [
        "Великий человек (\"Компьютеры\")",
        "1"
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска",
        "Разведывательный корпус",
        "Военные протезы",
        "Военная академия",
        "Массовое использование ионисторов"
      ],
      "Sociology": [
        "Колониальная социология",
        "Целевой отбор",
        "Новые способы пропаганды",
        "Колониальное управление",
        "Мобилизация населения",
        "Двоемыслие",
        "Общеколониальные программы"
      ],
      "Biology": [
        "Экзобиология",
        "Секвенирование ДНК"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация"
      ],
      "Science": [
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Импланты",
        "Постземная астрономия",
        "Искусственные органы",
        "Нейроинтерфейсы",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Миниатюризация",
        "Самообучение",
        "Анализ несоответствий",
        "Компактные квантовые процессоры",
        "Софогенез",
        "Физика элементарных частиц",
        "Экранирование имплантов",
        "Мобилизация населения",
        "Автономность имплантатов"
      ],
      "Unique": [
        "Быть Инженерами"
      ]
    },
    "planetParams": {
      "Тип планеты": 2,
      "Расстояние до звезды": 3,
      "Темп-ра": 0,
      "Вода": 49,
      "Гористость": 1,
      "Ресурсы": 5,
      "Тип аномалии": 9,
      "Масштаб аномалии": 58,
      "Примечания": null
    },
    "starSystemParams": {
      "x": 36,
      "y": 5,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 25,
      "generatorCode": "&2=ts00&3=ts00uucc&5=at00&6=at00&9=gs03&rest=6615565123144335314655534212251624544321653412246111215111453555321552221111352241&density=25"
    },
    "colonyParams": {
      "Наука": "23",
      "Производство": "16",
      "Общество": "8",
      "Свободный": "4",
      "Начальные кубы": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "1",
      "щит планеты": "",
      "защита колонии": "3",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "2",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Институт физики пространства",
      "Дополненная реальность (сломано)",
      "Станция кибергорничных (сломано)",
      "Совет колонии",
      "Контекстная память (сломано)",
      "Адаптивное производство",
      "Клиника имплантов (сломано)",
      "Институт социологии",
      "Центр добровольного содействия",
      "Электростанции (сломано)",
      "Обсерватория",
      "Интеллектуальная энергосистема (сломано)",
      "Опорные пункты сил самообороны",
      "Рекреационные зоны",
      "Музей Старой Земли",
      "Реактор термоядерного синтеза",
      "Экзокортекс",
      "Колониальная сеть",
      "Умное окружение",
      "Когнитивные расширители",
      "Шахта",
      "Плавильный комбинат",
      "Зенитные системы",
      "Энергетические ресурсы",
      "Ускоритель частиц",
      "Завод субатомных транзисторов (сломано)"
    ],
    "orbital": [
      "Звездолёт Рассеяния",
      "Первичная орбитальная группировка",
      "Космические телескопы"
    ],
    "astroProjs": [],
    "prepaired": [
      "Генератор антиматерии (2)"
    ],
    "greatPeople": [
      {
        "name": "Скэсуед Анихам",
        "lvl": 8,
        "effect": [
          [
            "Исследования (ветка \"Импланты\")",
            "+8"
          ]
        ]
      },
      {
        "name": "Зачатки ИИ \"Инверсия\"",
        "lvl": 3,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+3"
          ]
        ]
      },
      {
        "name": "Свон",
        "lvl": 4,
        "effect": [
          [
            "Строительство",
            "+4"
          ]
        ]
      },
      {
        "name": "Аркадия",
        "lvl": 4,
        "effect": [
          [
            "Создание армий",
            "4"
          ]
        ]
      },
      {
        "name": "Ева МакКенна",
        "lvl": 2,
        "effect": [
          [
            "Пропаганда",
            "+2"
          ]
        ]
      },
      {
        "name": "Генерал Гривус",
        "lvl": 2,
        "effect": [
          [
            "Защита армий",
            "+2"
          ]
        ]
      },
      {
        "name": "Профессор Сахаров",
        "lvl": 2,
        "effect": []
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Добыча": 1,
      "Редкие металлы": 1,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 1,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Добыча",
        "+1"
      ],
      [
        "Ресурсы",
        "20"
      ],
      [
        "Общество",
        "-1"
      ],
      [
        "особое",
        "база бунтовщиков где-то ближе к дневной стороне"
      ],
      [
        "Защита колонии",
        "1"
      ],
      [
        "Добыча",
        "-1"
      ],
      [
        "Производство",
        "-1"
      ],
      [
        "особое",
        "?требуют немножко роботов в шахты и повысить социалку"
      ],
      [
        "особое",
        "?проект от Индустрии/Добычи/Устранения последствий 2 чтобы погасить"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Подтверждение авторитета (неактивно)",
      "Психологическая адаптация",
      "Оценка внешней среды",
      "Подземное строительство",
      "Георазведка (неактивно)",
      "Экзометеорология",
      "Экстенсивная добыча",
      "Подкожные скафандры",
      ":Шикарный ИФП (+1 куб к ветке \"Физика пространства\")"
    ]
  },
  "Хоакин": {
    "playerColor": "#800000",
    "startingFeature": [
      [
        "Строительство",
        "+2"
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска",
        "Разведывательный корпус",
        "Военная академия"
      ],
      "Sociology": [
        "Целевой отбор",
        "Мобилизация населения",
        "Колониальная социология",
        "Колониальное управление",
        "Общеколониальные программы",
        "Новые способы пропаганды"
      ],
      "Biology": [
        "Секвенирование ДНК",
        "Экзобиология",
        "Генное планирование",
        "Генетическая аристократия"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "3D-печать",
        "Пусковые технологии",
        "Освоение орбиты",
        "Индивидуализация производства"
      ],
      "Science": [
        "Постземная астрономия",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Звёдные карты",
        "Миниатюризация",
        "Анализ несоответствий",
        "Бионика",
        "Физика элементарных частиц",
        "Компактные квантовые процессоры",
        "Самообучение"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 8,
      "Вода": 32,
      "Гористость": 4,
      "Ресурсы": 84,
      "Тип аномалии": 10,
      "Масштаб аномалии": 9,
      "Примечания": null
    },
    "starSystemParams": {
      "x": 15,
      "y": 28,
      "Тип, масса и возраст звезды": "1.1/, Теория",
      "Плотность звёздной системы": 63,
      "generatorCode": "&2=gl06gtep&3=ts01&4=at00&5=at00&8=th05uucc&10=gs05&11=at00&rest=43646112334212131636244444362166631311121523356315&density=63"
    },
    "colonyParams": {
      "Наука": "19",
      "Производство": "20",
      "Общество": "17",
      "Свободный": "4",
      "Начальные кубы": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "1",
      "непривычная среда": "2",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "3"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Центр гражданской обороны",
      "Научная лаборатория",
      "Станция кибергорничных",
      "Рекреационные зоны",
      "Институт социологии",
      "Адаптивное производство",
      "Обсерватория",
      "Колониальная сеть",
      "Умное окружение",
      "Шахта",
      "Музей ксеноцивилизаций",
      "Музей Старой Земли",
      "Совет колонии",
      "Плавильный комбинат",
      "Промышленные рудники",
      "Дополненная реальность",
      "Средства массовой информации",
      "Институт экзобиологии",
      "Институт физики пространства",
      "Ускоритель частиц"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Звездолёт Рассеяния"
    ],
    "astroProjs": [],
    "prepaired": [],
    "greatPeople": [
      {
        "name": "Хоакин Паэс ",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Государство\")",
            "+4"
          ]
        ]
      },
      {
        "name": "Соломон Шошани",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+4"
          ]
        ]
      },
      {
        "name": "Господин Э-С (Роршах)",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Социология\")",
            "+2"
          ]
        ]
      },
      {
        "name": "Нора Пенья",
        "lvl": 5,
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "+5"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Добыча": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 2,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Исследования (ветка \"Социология\")",
        "+1"
      ],
      [
        "Исследования (ветка \"Государство\")",
        "+2"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Аномалия",
        "+1"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Конверсия",
        "+1"
      ],
      [
        "Производство",
        "+2"
      ],
      [
        "Строительство",
        "+2"
      ],
      [
        "Исследования (ветка \"Физика пространства\")",
        "2"
      ],
      [
        "Исследования (ветка \"Экзобиология\")",
        "-1"
      ],
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Подтверждение авторитета (неактивно)",
      "Психологическая адаптация",
      "Оценка внешней среды",
      "Генная терапия",
      "Экзометеорология",
      "Разборка звездолёта"
    ]
  },
  "Илоний Джобс": {
    "playerColor": "#FF00FF",
    "startingFeature": [
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "?улучшаемы"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус",
        "Милитаризация орбиты",
        "Внутренние войска",
        "Военные протезы"
      ],
      "Sociology": [
        "Колониальная социология",
        "Новые способы пропаганды"
      ],
      "Biology": [
        "Экзобиология",
        "Секвенирование ДНК",
        "Инопланетное сельское хозяйство"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Пусковые технологии",
        "Освоение орбиты",
        "Энергетические ресурсы",
        "Теория досветовой колонизации",
        "Экзоскелеты",
        "Базовая автоматизация"
      ],
      "Science": [
        "Постземная астрономия",
        "Анализ космических лучей",
        "Бионика",
        "Туманные вычисления",
        "Импланты",
        "Новые типы компьютеров",
        "Искусственные органы",
        "Анализ данных о межзвёздной среде"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 11,
      "Вода": 39,
      "Гористость": 3,
      "Ресурсы": 73,
      "Тип аномалии": 9,
      "Масштаб аномалии": 91,
      "Примечания": null
    },
    "starSystemParams": {
      "x": 12,
      "y": 39,
      "Тип, масса и возраст звезды": "G, 0.95, 2.6",
      "Плотность звёздной системы": 42,
      "generatorCode": "&2=tt00&3=ts01&7=tt00&8=ts00&9=tt00&10=at00&11=th04uucc&rest=15152666145616614542461153316611345453214523323432425562435311111321536321461265&density=42"
    },
    "colonyParams": {
      "Наука": "14",
      "Производство": "15",
      "Общество": "12",
      "Свободный": "3",
      "Начальные кубы": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "1",
      "экзоты": "",
      "образцы": "2",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "1",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Институт социологии",
      "Космодром (сломано)",
      "Умное окружение (сломано)",
      "Шахта",
      "Плавильный комбинат",
      "Рекреационные зоны",
      "Совет колонии",
      "Институт физики пространства",
      "Колониальная сеть",
      "Адаптивное производство",
      "Обсерватория",
      "Опорные пункты сил самообороны",
      "Музей ксеноцивилизаций",
      "Генная клиника",
      "Промышленные рудники",
      "Станция кибергорничных",
      "Интеллектуальная энергосистема"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Спутники связи",
      "Институт экзобиологии (орб.)",
      "Банк генов (орб.)"
    ],
    "astroProjs": [],
    "prepaired": [
      "Колониальная база (1)"
    ],
    "greatPeople": [
      {
        "name": "Илоний Джобс",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "+4"
          ]
        ]
      }
    ],
    "secondaryColonies": [
      {
        "lvl": "1",
        "speciality": "Космос",
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "+2"
          ]
        ]
      },
      {
        "lvl": "1",
        "speciality": "Космос",
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "+2"
          ]
        ]
      }
    ],
    "materials": {
      "Добыча": 3,
      "Редкие металлы": 1,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 4,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Трансураны",
        "+1"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Трансураны",
        "+1"
      ],
      [
        "Аномалия",
        "+1"
      ],
      [
        "особое",
        "?"
      ],
      [
        "особое",
        "?"
      ],
      [
        "особое",
        "?изучите \"Самообучение\" или сделайте специальный проект стоимостью 2 \"Великая переустановка\" чтобы его задавить"
      ],
      [
        "особое",
        "? председатель Терри Рипли"
      ],
      [
        ""
      ],
      [
        ""
      ],
      [
        ""
      ],
      [
        ""
      ]
    ],
    "localProjs": [
      "Para bellum",
      "Психологическая адаптация",
      "Подтверждение авторитета (неактивно)",
      "Оценка внешней среды",
      "Добыча образцов местной жизни",
      "Георазведка",
      "Подземное строительство",
      "Экзометеорология",
      "Восстановление звездолёта",
      "Обновление ракетной техники",
      "Оценка биосферы",
      "Генная терапия",
      "Экстенсивная добыча"
    ]
  },
  "-Пророк Ракель": {
    "playerColor": "#D0F0C0",
    "startingFeature": [
      [
        "особое",
        "+1 свободный куб для проектов"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [
        "Экзобиология"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 1,
      "Вода": 89,
      "Гористость": 5,
      "Ресурсы": 98,
      "Тип аномалии": 9,
      "Масштаб аномалии": 77,
      "Примечания": null
    },
    "starSystemParams": {
      "x": 36,
      "y": 13,
      "Тип, масса и возраст звезды": "G/1.0/2.5 ",
      "Плотность звёздной системы": 99,
      "generatorCode": "&1=th01uucc&2=ts03&3=ts04&4=tt00&5=at00&6=at00&7=gm09&8=gm05&9=gm10&10=at00&11=gs05&rest=32333263353245216415443133551436411121265352652&density=99"
    },
    "colonyParams": {
      "Наука": "6",
      "Производство": "5",
      "Общество": "11",
      "Свободный": "0",
      "Начальные кубы": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "щит планеты": "",
      "защита колонии": "",
      "экзоты": "",
      "образцы": "",
      "чуждая среда": "3",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "1",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [],
    "orbital": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Колониальная сеть",
      "Шахта",
      "Звездолёт Рассеяния"
    ],
    "astroProjs": [],
    "prepaired": [],
    "greatPeople": [
      {
        "name": " пророк Ракель",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "+2"
          ]
        ]
      },
      {
        "name": "Ксенослизни",
        "lvl": 3,
        "effect": [
          [
            "особое",
            "ксенослизни 3 шт и +1 в ход"
          ],
          [
            "особое",
            "1d3 урона по Производству"
          ]
        ]
      }
    ],
    "secondaryColonies": [],
    "materials": {
      "Добыча": 0,
      "Редкие металлы": 0,
      "Наноматериалы": 0,
      "Стазокерамика": 0,
      "Нейтроний": 0,
      "Трансураны": 1,
      "Антиматерия": 0,
      "Экзотматерия": 0,
      "Гиперплазма": 0
    },
    "uniqueResources": [
      [
        "Добыча",
        "-1"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Строительство",
        "-1"
      ],
      [
        "особое",
        "?устранение за Общество 1"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": [
      "Подтверждение авторитета (неактивно)",
      "Психологическая адаптация",
      "Оценка внешней среды",
      "Экзометеорология"
    ]
  }
}