var DATA__PLAYERS_TIMESTAMP = '2023-02-25T00:17:42.344Z'
var DATA__PLAYERS_DATA = {
  "Беглецы": {
    "startingFeature": [
      [
        "Производство",
        "+1"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус"
      ],
      "Sociology": [
        "Колониальная социология"
      ],
      "Biology": [
        "Оценка биосферы"
      ],
      "Industry": [],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "6",
      "Производство": "6",
      "Общество": "7",
      "Свободные кубы": "2",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "3"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Станция кибергорничных",
      "Институт социологии",
      "Институт физики пространства",
      "Военная академия",
      "Адаптивное производство",
      "Интеллектуальная энергосистема"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Денис Сухой",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Социология\")",
            "1"
          ]
        ]
      },
      {
        "name": "Глыба",
        "lvl": 1,
        "effect": [
          [
            "Создание армий",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Вода",
        "20"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "земля с запахом аммиака"
      ],
      [
        "особое",
        "НЕАКТИВНО Общество +1"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета",
        "Психологическая адаптация"
      ],
      "Biology": [
        "Добыча образцов местной жизни",
        "Оценка внешней среды"
      ],
      "Industry": [
        "Экзометеорология"
      ],
      "Science": [
        "Умное окружение",
        "Колониальная сеть"
      ],
      "Specials": [
        "Планетарная разведка"
      ]
    }
  },
  "Кошкодевочки Карины": {
    "startingFeature": [
      [
        "особое",
        "+2 к связанным с выживанием кубам"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия"
      ],
      "Science": [
        "Постземная астрономия"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "5",
      "Производство": "4",
      "Общество": "8",
      "Свободные кубы": "1",
      "Начальные параметры": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция (подз.)",
      "Базовое жильё (подз.)",
      "Космодром (чужое; сломано)",
      "Электростанции (чужое; сломано)",
      "Рекреационные зоны"
    ],
    "orbital": [
      "Гелиоприемник (чужое; сломано)"
    ],
    "greatPeople": [
      {
        "name": "Карина",
        "lvl": 1,
        "effect": [
          [
            "особое",
            "+1 к политическим взаимодействиям"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Производство",
        "+1"
      ],
      [
        "особое",
        "жарища пиздец"
      ],
      [
        "Солнце",
        "+2"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация",
        "Подтверждение авторитета"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [
        "Экзометеорология"
      ],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": [
        "Планетарная разведка"
      ]
    }
  },
  "Юнитологическая федерация": {
    "startingFeature": [
      [
        "особое",
        "население не производит осуждение при исследовании биотеха"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [
        "Секвенирование ДНК",
        "Генное планирование",
        "Генетическая аристократия"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [
        "Колониальная сеть",
        "Новые типы компьютеров"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "5",
      "Производство": "5",
      "Общество": "5",
      "Свободные кубы": "3",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Фил Спенсер",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Генетика\")",
            "1"
          ]
        ]
      },
      {
        "name": "",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Строительство",
        "+1"
      ],
      [
        "особое",
        "вероятно горючий?"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация"
      ],
      "Biology": [
        "Генная терапия"
      ],
      "Industry": [
        "Георазведка",
        "Экзометеорология"
      ],
      "Science": [
        "Умное окружение"
      ],
      "Specials": []
    }
  },
  "Инженеры": {
    "startingFeature": [
      [
        "Великий человек (\"Компьютеры\")",
        "1"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Импланты",
        "Постземная астрономия",
        "Искусственные органы",
        "Нейроинтерфейсы",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Миниатюризация"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "9",
      "Производство": "7",
      "Общество": "3",
      "Свободные кубы": "2",
      "Начальные параметры": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "1"
    },
    "buildings": [
      "Базовая электростанция (подз.)",
      "Базовое жильё (подз.)",
      "Научная лаборатория (сломано)",
      "Институт физики пространства",
      "Дополненная реальность",
      "Станция кибергорничных",
      "Военная академия"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Скэсуед Анихам",
        "lvl": 3,
        "effect": [
          [
            "Исследования (ветка \"Импланты\")",
            "3"
          ]
        ]
      },
      {
        "name": "Зачатки ИИ “Инверсия”",
        "lvl": 3,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "3"
          ]
        ]
      },
      {
        "name": "Свон",
        "lvl": 1,
        "effect": [
          [
            "Строительство",
            "+1"
          ]
        ]
      },
      {
        "name": "Аркадия",
        "lvl": 1,
        "effect": [
          [
            "Создание армий",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Добыча",
        "1"
      ],
      [
        "Ресурсы",
        "20"
      ],
      [
        "Общество",
        "-1"
      ],
      [
        "особое",
        "база бунтовщиков где-то ближе к дневной стороне"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": [
        "Шикарный ИФП (+1 куб к ветке \"Физика пространства”)"
      ]
    }
  },
  "ЭНГЕЛЬС-1": {
    "startingFeature": [
      [
        "Строительство",
        "+2"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [],
      "Science": [],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "2",
      "Производство": "1",
      "Общество": "3",
      "Свободные кубы": "0 (однократно +15)",
      "Начальные параметры": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Хоакин Паэс ",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Государство\")",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [],
      "Science": [],
      "Specials": []
    }
  },
  "Илоний Джобс": {
    "startingFeature": [
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "улучшаемы"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [],
      "Science": [],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "2",
      "Производство": "2",
      "Общество": "3",
      "Свободные кубы": "0 (однократно +15)",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Илоний Джобс",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "особое",
        "?"
      ],
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [],
      "Science": [],
      "Specials": []
    }
  }
}