var DATA__PLAYERS_TIMESTAMP = '2023-02-12T21:34:47.298Z'
var DATA__PLAYERS_DATA = {
  "Беглецы": {
    "startingFeature": [
      [
        "Производство",
        "+1"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус"
      ],
      "Sociology": [
        "Колониальная социология"
      ],
      "Biology": [
        "Оценка биосферы"
      ],
      "Industry": [],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "6",
      "Производство": "6",
      "Общество": "7",
      "Свободные кубы": "2",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "снабж. отряды": "0/0",
      "волнения": "0",
      "осуждение": "3"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Станция кибергорничных",
      "Институт социологии",
      "Институт физики пространства",
      "Военная академия",
      "Адаптивное производство",
      "Интеллектуальная энергосистема"
    ],
    "orbital": [],
    "uniqueResources": [
      [
        "Вода",
        "20"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета",
        "Психологическая адаптация"
      ],
      "Biology": [
        "Добыча образцов местной жизни",
        "Оценка внешней среды"
      ],
      "Industry": [
        "Экзометеорология"
      ],
      "Science": [
        "Умное окружение",
        "Колониальная сеть"
      ],
      "Specials": [
        "Планетарная разведка"
      ]
    }
  },
  "Кошкодевочки Карины": {
    "startingFeature": [
      [
        "особое",
        "+2 к связанным с выживанием кубам"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия"
      ],
      "Science": [],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "3",
      "Производство": "4",
      "Общество": "8",
      "Свободные кубы": "0",
      "Начальные параметры": "2/1/3"
    },
    "additionalParams": {
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "снабж. отряды": "0/0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция (подз.)",
      "Базовое жильё (подз.)",
      "Космодром (чужое; сломано)",
      "Электростанции (чужое; сломано)",
      "Рекреационные зоны"
    ],
    "orbital": [
      "Гелиоприемник (чужое; сломано)"
    ],
    "uniqueResources": [
      [
        "Производство",
        "+1"
      ],
      [
        "особое",
        "жарища пиздец"
      ],
      [
        "особое",
        "любые гелиотехнологии будут эффективнее"
      ]
    ],
    "localProjs": {
      "Military": [],
      "Sociology": [
        "Психологическая адаптация",
        "Подтверждение авторитета"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": [
        "Планетарная разведка"
      ]
    }
  },
  "Юнитологическая федерация": {
    "startingFeature": [
      [
        "особое",
        "население не производит осуждение при исследовании биотеха"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [
        "Секвенирование ДНК",
        "Генное планирование"
      ],
      "Industry": [
        "Экзоминералогия"
      ],
      "Science": [
        "Колониальная сеть"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "3",
      "Производство": "3",
      "Общество": "4",
      "Свободные кубы": "3",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "снабж. отряды": "0/0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория"
    ],
    "orbital": [],
    "uniqueResources": [
      [
        "Строительство",
        "+1"
      ],
      [
        "особое",
        "вероятно горючий?"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация"
      ],
      "Biology": [],
      "Industry": [
        "Георазведка"
      ],
      "Science": [],
      "Specials": []
    }
  },
  "Инженеры": {
    "startingFeature": [
      [
        "особое",
        "второй великий человек"
      ],
      [
        "Исследования (ветка \"Компьютеры\")",
        "1"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Импланты",
        "Постземная астрономия",
        "Искусственные органы",
        "Нейроинтерфейсы",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Миниатюризация"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "9",
      "Производство": "7",
      "Общество": "3",
      "Свободные кубы": "2",
      "Начальные параметры": "3/2/1"
    },
    "additionalParams": {
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "снабж. отряды": "0/0",
      "волнения": "0",
      "осуждение": "1"
    },
    "buildings": [
      "Базовая электростанция (подз.)",
      "Базовое жильё (подз.)",
      "Научная лаборатория (сломано)",
      "Институт физики пространства",
      "Дополненная реальность",
      "Станция кибергорничных",
      "Военная академия"
    ],
    "orbital": [],
    "uniqueResources": [
      [
        "Добыча",
        "1"
      ],
      [
        "Ресурсы",
        "20"
      ],
      [
        "Общество",
        "-1"
      ],
      [
        "особое",
        "база бунтовщиков где-то ближе к дневной стороне"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": [
        "Шикарный ИФП (+1 куб к ветке \"Физика пространства”)"
      ]
    }
  },
  "ЭНГЕЛЬС-1": {
    "startingFeature": [
      [
        "Строительство",
        "+2"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [],
      "Science": [],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "2",
      "Производство": "1",
      "Общество": "3",
      "Свободные кубы": "0",
      "Начальные параметры": "2/1/3"
    },
    "additionalParams": {
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "снабж. отряды": "0/0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё"
    ],
    "orbital": [],
    "uniqueResources": null,
    "localProjs": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [],
      "Science": [],
      "Specials": []
    }
  }
}