var DATA__PLAYERS_TIMESTAMP = '2023-03-30T01:20:18.599Z'
var DATA__PLAYERS_DATA = {
  "Беглецы": {
    "startingFeature": [
      [
        "Производство",
        "+1"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус"
      ],
      "Sociology": [
        "Колониальная социология",
        "Новые способы пропаганды"
      ],
      "Biology": [
        "Оценка биосферы",
        "Экзобиология"
      ],
      "Industry": [
        "Адаптация промышленности",
        "Экзоскелеты"
      ],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления",
        "Анализ космических лучей"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "10",
      "Производство": "7",
      "Общество": "9",
      "Свободные кубы": "2",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "2",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Станция кибергорничных",
      "Институт социологии",
      "Институт физики пространства",
      "Военная академия",
      "Адаптивное производство",
      "Интеллектуальная энергосистема",
      "Рекреационные зоны",
      "Обсерватория"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Денис Сухой",
        "lvl": 3,
        "effect": [
          [
            "Исследования (ветка \"Социология\")",
            "3"
          ]
        ]
      },
      {
        "name": "Глыба",
        "lvl": 1,
        "effect": [
          [
            "Создание армий",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Вода",
        "20"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "земля с запахом аммиака"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "?НЕАКТИВНО Наука +2 Цена Общество 3"
      ],
      [
        "Общество",
        "+1"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета (неактивно)",
        "Психологическая адаптация"
      ],
      "Biology": [
        "Добыча образцов местной жизни",
        "Оценка внешней среды"
      ],
      "Industry": [
        "Экзометеорология"
      ],
      "Science": [
        "Умное окружение",
        "Колониальная сеть"
      ],
      "Specials": [
        "Планетарная разведка"
      ]
    }
  },
  "Кошкодевочки Карины": {
    "startingFeature": [
      [
        "особое",
        "+2 к связанным с выживанием кубам"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзодобыча"
      ],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Анализ космических лучей",
        "Самообучение",
        "Импланты"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "8",
      "Производство": "8",
      "Общество": "7",
      "Свободные кубы": "1",
      "Начальные параметры": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Космодром (чужое; сломано)",
      "Электростанции (чужое; сломано)",
      "Базовая электростанция",
      "Базовое жильё",
      "Рекреационные зоны",
      "Адаптивное производство"
    ],
    "orbital": [
      "Гелиоприемник (чужое; сломано)"
    ],
    "greatPeople": [
      {
        "name": "Карина",
        "lvl": 3,
        "effect": [
          [
            "особое",
            "+3 к политическим взаимодействиям"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Производство",
        "+1"
      ],
      [
        "особое",
        "жарища пиздец"
      ],
      [
        "Солнце",
        "+2"
      ],
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация",
        "Подтверждение авторитета (неактивно)",
        "Мобилизация населения"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [
        "Экзометеорология"
      ],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": [
        "Планетарная разведка"
      ]
    }
  },
  "Юнитологическая федерация": {
    "startingFeature": [
      [
        "особое",
        "население не производит осуждение при исследовании биотеха"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [
        "Секвенирование ДНК",
        "Генное планирование",
        "Генетическая аристократия",
        "Генная модификация населения"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [
        "Колониальная сеть",
        "Новые типы компьютеров",
        "Миниатюризация",
        "Туманные вычисления",
        "Постземная астрономия"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "9",
      "Производство": "7",
      "Общество": "8",
      "Свободные кубы": "3",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Дополненная реальность",
      "Адаптивное производство",
      "Генная клиника",
      "Обсерватория"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Фил Спенсер",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Генетика\")",
            "2"
          ]
        ]
      },
      {
        "name": " Рикки Спаркс",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Строительство",
        "+1"
      ],
      [
        "особое",
        "?вероятно горючий?"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация",
        "Подтверждение авторитета"
      ],
      "Biology": [
        "Генная терапия"
      ],
      "Industry": [
        "Георазведка",
        "Экзометеорология"
      ],
      "Science": [
        "Умное окружение"
      ],
      "Specials": []
    }
  },
  "Инженеры": {
    "startingFeature": [
      [
        "Великий человек (\"Компьютеры\")",
        "1"
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска"
      ],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты"
      ],
      "Science": [
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Импланты",
        "Постземная астрономия",
        "Искусственные органы",
        "Нейроинтерфейсы",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Миниатюризация",
        "Самообучение",
        "Анализ несоответствий",
        "Компактные квантовые процессоры"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "11",
      "Производство": "8",
      "Общество": "7",
      "Свободные кубы": "2",
      "Начальные параметры": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "1",
      "планетарный щит": "",
      "защита колонии": "1",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "1"
    },
    "buildings": [
      "Базовая электростанция (подз.)",
      "Базовое жильё (подз.)",
      "Научная лаборатория (подз.)",
      "Институт физики пространства (подз.)",
      "Дополненная реальность (подз.)",
      "Станция кибергорничных (подз.)",
      "Военная академия (подз.)",
      "Совет колонии (подз.)",
      "Контекстная память (подз.)",
      "Адаптивное производство (подз.)",
      "Клиника имплантов (подз.)"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Скэсуед Анихам",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Импланты\")",
            "4"
          ]
        ]
      },
      {
        "name": "Зачатки ИИ “Инверсия”",
        "lvl": 4,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "4"
          ]
        ]
      },
      {
        "name": "Свон",
        "lvl": 2,
        "effect": [
          [
            "Строительство",
            "+2"
          ]
        ]
      },
      {
        "name": "Аркадия",
        "lvl": 1,
        "effect": [
          [
            "Создание армий",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Добыча",
        "1"
      ],
      [
        "Ресурсы",
        "20"
      ],
      [
        "Общество",
        "-1"
      ],
      [
        "особое",
        "база бунтовщиков где-то ближе к дневной стороне"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета",
        "Психологическая адаптация",
        "Мобилизация населения"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [
        "Подземное строительство"
      ],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": [
        "Шикарный ИФП (+1 куб к ветке \"Физика пространства”)"
      ]
    }
  },
  "ЭНГЕЛЬС-1": {
    "startingFeature": [
      [
        "Строительство",
        "+2"
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска"
      ],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия",
        "Экзодобыча",
        "Адаптация промышленности",
        "Экзоскелеты"
      ],
      "Science": [
        "Постземная астрономия",
        "Анализ космических лучей"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "6",
      "Производство": "6",
      "Общество": "9",
      "Свободные кубы": "2",
      "Начальные параметры": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Центр гражданской обороны",
      "Научная лаборатория",
      "Станция кибергорничных"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Хоакин Паэс ",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Государство\")",
            "2"
          ]
        ]
      },
      {
        "name": "Соломон Шошани",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "особое",
        "?"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Конверсия",
        "+1"
      ],
      [
        "Производство",
        "+1"
      ],
      [
        "Строительство",
        "+1"
      ],
      [
        "Исследования (ветка \"Физика пространства\")",
        "2"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета",
        "Мобилизация населения",
        "Психологическая адаптация"
      ],
      "Biology": [],
      "Industry": [
        "Экзометеорология"
      ],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Specials": []
    }
  },
  "Илоний Джобс": {
    "startingFeature": [
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "?улучшаемы"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [
        "Экзобиология"
      ],
      "Industry": [
        "Экзоминералогия",
        "Экзодобыча",
        "Адаптация промышленности",
        "Пусковые технологии",
        "Освоение орбиты"
      ],
      "Science": [
        "Постземная астрономия",
        "Анализ космических лучей"
      ],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "8",
      "Производство": "7",
      "Общество": "5",
      "Свободные кубы": "1",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "1",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Спутники связи"
    ],
    "greatPeople": [
      {
        "name": "Илоний Джобс",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "особое",
        "?"
      ],
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация"
      ],
      "Biology": [
        "Оценка внешней среды",
        "Добыча образцов местной жизни"
      ],
      "Industry": [
        "Обработка руд",
        "Георазведка",
        "Подземное строительство",
        "Экзометеорология"
      ],
      "Science": [
        "Умное окружение"
      ],
      "Specials": []
    }
  },
  "Пророк Ракель": {
    "startingFeature": [
      [
        "особое",
        "+1 свободный куб для проектов"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [],
      "Science": [],
      "Specials": []
    },
    "colonyParams": {
      "Наука": "0",
      "Производство": "0",
      "Общество": "0",
      "Свободные кубы": "0",
      "Начальные параметры": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё"
    ],
    "orbital": [],
    "greatPeople": [],
    "uniqueResources": null,
    "localProjs": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [],
      "Science": [],
      "Specials": []
    }
  }
}