var DATA__PLAYERS_TIMESTAMP = '2023-08-16T02:21:35.188Z'
var DATA__PLAYERS_DATA = {
  "Беглецы": {
    "startingFeature": [
      [
        "Производство",
        "+2"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус",
        "Военная академия",
        "Внутренние войска"
      ],
      "Sociology": [
        "Колониальная социология",
        "Новые способы пропаганды",
        "Доктрина целеустремлённости",
        "Трудовой энтузиазм",
        "Колониальное управление",
        "Целевой отбор"
      ],
      "Biology": [
        "Оценка биосферы",
        "Экзобиология",
        "Секвенирование ДНК",
        "Инопланетное сельское хозяйство",
        "Оценка свойств местных организмов",
        "Выращивание биополимеров"
      ],
      "Industry": [
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация",
        "Экзоминералогия"
      ],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Новые типы компьютеров",
        "Анализ несоответствий",
        "Физика элементарных частиц",
        "Бионика"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 5,
      "Расстояние до звезды": 5,
      "Вода": 10,
      "Гористость": 2,
      "Ресурсы": 64,
      "Тип аномалии": 8,
      "Масштаб аномалии": 55,
      "Примечания": 0
    },
    "starSystemParams": {
      "x": 28,
      "y": 39,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 36,
      "generatorCode": "&1=ts00&2=at00&3=tt00&4=at00&5=tl00uucc&6=at00&8=gs01&9=gs02&rest=561363423544146111345212144666436645365235511666215&density=36"
    },
    "colonyParams": {
      "Наука": "16",
      "Производство": "11",
      "Общество": "14",
      "Свободный": "2",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "2",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии",
      "Станция кибергорничных",
      "Институт социологии",
      "Институт физики пространства",
      "Адаптивное производство",
      "Интеллектуальная энергосистема",
      "Рекреационные зоны",
      "Обсерватория",
      "Институт экзобиологии",
      "Ксенопитомник",
      "Ксенофермы",
      "Научная лаборатория",
      "Станции наблюдения",
      "Первичная орбитальная группировка"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Денис Сухой",
        "lvl": 5,
        "effect": [
          [
            "Исследования (ветка \"Социология\")",
            "5"
          ]
        ]
      },
      {
        "name": "Глыба",
        "lvl": 2,
        "effect": [
          [
            "?особое",
            "НЕАКТИВНО надо успех д10 Создание армий +2"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Адаптация",
        "+1"
      ],
      [
        "Вода",
        "20"
      ],
      [
        "особое",
        "ищущие воду Жорикусы"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "земля с запахом аммиака"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Наука",
        "+2"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "легкий наркотик Хреногубки"
      ],
      [
        "Наука",
        "+1"
      ],
      [
        "Исследования (ветка \"Экзобиология\")",
        "2"
      ],
      [
        "особое",
        "возможность расширения"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета (неактивно)",
        "Психологическая адаптация",
        "Мобилизация населения"
      ],
      "Biology": [
        "Добыча образцов местной жизни",
        "Оценка внешней среды",
        "Генная терапия"
      ],
      "Industry": [
        "Экзометеорология",
        "Разборка звездолёта (неактивно)"
      ],
      "Science": [
        "Умное окружение",
        "Колониальная сеть"
      ],
      "Unique": [
        "Планетарная разведка"
      ]
    }
  },
  "Кошкодевочки Карины": {
    "startingFeature": [
      [
        "особое",
        "+2 к связанным с выживанием кубам"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзодобыча",
        "Экзоскелеты"
      ],
      "Science": [
        "Постземная астрономия",
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Анализ космических лучей",
        "Самообучение",
        "Импланты",
        "Миниатюризация"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 2,
      "Расстояние до звезды": 1,
      "Вода": 18,
      "Гористость": 2,
      "Ресурсы": 27,
      "Тип аномалии": 10,
      "Масштаб аномалии": 51,
      "Примечания": 0
    },
    "starSystemParams": {
      "x": 21,
      "y": 13,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 61,
      "generatorCode": "&1=tt00uucc&2=at00&3=at00&4=gm05gtec&5=tm01&7=at00&8=gs06&9=gs06&10=at00&rest=51415332651441543315233536621153134513234216653632&density=61"
    },
    "colonyParams": {
      "Наука": "11",
      "Производство": "16",
      "Общество": "7",
      "Свободный": "3",
      "Начальные параметры": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "1"
    },
    "buildings": [
      "Космодром (чужое; сломано)",
      "Электростанции (чужое; сломано)",
      "Базовая электростанция",
      "Базовое жильё",
      "Рекреационные зоны",
      "Адаптивное производство",
      "Шахты",
      "Станция кибергорничных",
      "Дополненная реальность",
      "Интеллектуальная энергосистема",
      "Научная лаборатория",
      "Обсерватория"
    ],
    "orbital": [
      "Гелиоприемник (чужое; сломано)"
    ],
    "greatPeople": [
      {
        "name": "Карина",
        "lvl": 4,
        "effect": [
          [
            "особое",
            "+4 к политическим взаимодействиям"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Производство",
        "+1"
      ],
      [
        "особое",
        "жарища пиздец"
      ],
      [
        "Солнце",
        "+2"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Пропаганда",
        "+2"
      ],
      [
        "Свободный",
        "1"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация",
        "Подтверждение авторитета (неактивно)",
        "Мобилизация населения"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [
        "Экзометеорология",
        "Обработка руд",
        "Разборка звездолёта"
      ],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Unique": [
        "Планетарная разведка"
      ]
    }
  },
  "Юнитологическая федерация": {
    "startingFeature": [
      [
        "особое",
        "население не производит осуждение при исследовании биотеха"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [
        "Доктрина целеустремлённости"
      ],
      "Biology": [
        "Секвенирование ДНК",
        "Генное планирование",
        "Генетическая аристократия",
        "Генная модификация населения",
        "Роение",
        "Новые организмы"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [
        "Колониальная сеть",
        "Новые типы компьютеров",
        "Миниатюризация",
        "Туманные вычисления",
        "Постземная астрономия",
        "Анализ космических лучей",
        "Самообучение"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 5,
      "Расстояние до звезды": 7,
      "Вода": 12,
      "Гористость": 4,
      "Ресурсы": 1,
      "Тип аномалии": 6,
      "Масштаб аномалии": 60,
      "Примечания": 0
    },
    "starSystemParams": {
      "x": 29,
      "y": 14,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 37,
      "generatorCode": "&1=at00&2=ts00&3=tt00&4=tt00&7=tl01uucc&8=gm04gtec&9=gm04&rest=5324362631224256236316546164425514553636314215555114&density=37"
    },
    "colonyParams": {
      "Наука": "12",
      "Производство": "9",
      "Общество": "15",
      "Свободный": "4",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Дополненная реальность",
      "Адаптивное производство",
      "Генная клиника",
      "Обсерватория",
      "Рекреационные зоны",
      "Станция кибергорничных"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Фил Спенсер",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Генетика\")",
            "2"
          ]
        ]
      },
      {
        "name": " Рикки Спаркс",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "2"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Строительство",
        "+1"
      ],
      [
        "особое",
        "?вероятно горючий?"
      ],
      [
        "Ресурсы",
        "26"
      ],
      [
        "особое",
        "маргинальная группа"
      ],
      [
        "Исследования (ветка \"Генетика\")",
        "1"
      ],
      [
        "особое",
        "стремятся к открытию “Автоэволюции”"
      ],
      [
        "Вода",
        "20"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация",
        "Подтверждение авторитета",
        "Мобилизация населения"
      ],
      "Biology": [
        "Генная терапия",
        "Оценка внешней среды"
      ],
      "Industry": [
        "Георазведка",
        "Экзометеорология",
        "Экзодобыча"
      ],
      "Science": [
        "Умное окружение"
      ],
      "Unique": []
    }
  },
  "Инженеры": {
    "startingFeature": [
      [
        "Великий человек (\"Компьютеры\")",
        "1"
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска",
        "Разведывательный корпус",
        "Военные протезы",
        "Военная академия"
      ],
      "Sociology": [
        "Колониальная социология",
        "Целевой отбор"
      ],
      "Biology": [],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности",
        "Экзоскелеты"
      ],
      "Science": [
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Бионика",
        "Импланты",
        "Постземная астрономия",
        "Искусственные органы",
        "Нейроинтерфейсы",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Миниатюризация",
        "Самообучение",
        "Анализ несоответствий",
        "Компактные квантовые процессоры",
        "Софогенез",
        "Физика элементарных частиц"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 2,
      "Расстояние до звезды": 3,
      "Темп-ра": 0,
      "Вода": 49,
      "Гористость": 1,
      "Ресурсы": 5,
      "Тип аномалии": 9,
      "Масштаб аномалии": 58,
      "Примечания": 0
    },
    "starSystemParams": {
      "x": 36,
      "y": 5,
      "Тип, масса и возраст звезды": "",
      "Плотность звёздной системы": 25,
      "generatorCode": "&2=ts00&3=ts00uucc&5=at00&6=at00&9=gs03&rest=6615565123144335314655534212251624544321653412246111215111453555321552221111352241&density=25"
    },
    "colonyParams": {
      "Наука": "14",
      "Производство": "11",
      "Общество": "5",
      "Свободный": "3",
      "Начальные параметры": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "1",
      "планетарный щит": "",
      "защита колонии": "2",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Институт физики пространства",
      "Дополненная реальность",
      "Станция кибергорничных",
      "Совет колонии",
      "Контекстная память",
      "Адаптивное производство",
      "Клиника имплантов",
      "Институт социологии",
      "Центр добровольного содействия",
      "Электростанции",
      "Обсерватория",
      "Интеллектуальная энергосистема"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Скэсуед Анихам",
        "lvl": 7,
        "effect": [
          [
            "Исследования (ветка \"Импланты\")",
            "7"
          ]
        ]
      },
      {
        "name": "Зачатки ИИ “Инверсия”",
        "lvl": 3,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "3"
          ]
        ]
      },
      {
        "name": "Свон",
        "lvl": 3,
        "effect": [
          [
            "Строительство",
            "+3"
          ]
        ]
      },
      {
        "name": "Аркадия",
        "lvl": 3,
        "effect": [
          [
            "Создание армий",
            "3"
          ]
        ]
      },
      {
        "name": "Ева МакКенна",
        "lvl": 1,
        "effect": [
          [
            "Пропаганда",
            "+1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Добыча",
        "+1"
      ],
      [
        "Ресурсы",
        "20"
      ],
      [
        "Общество",
        "-1"
      ],
      [
        "особое",
        "база бунтовщиков где-то ближе к дневной стороне"
      ],
      [
        "Защита колонии",
        "1"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета (неактивно)",
        "Психологическая адаптация",
        "Мобилизация населения"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [
        "Подземное строительство",
        "Экзодобыча"
      ],
      "Science": [
        "Колониальная сеть",
        "Умное окружение",
        "Когнитивные расширители"
      ],
      "Unique": [
        "Шикарный ИФП (+1 куб к ветке \"Физика пространства”)"
      ]
    }
  },
  "ЭНГЕЛЬС-1": {
    "startingFeature": [
      [
        "Строительство",
        "+2"
      ]
    ],
    "techTable": {
      "Military": [
        "Внутренние войска",
        "Разведывательный корпус"
      ],
      "Sociology": [
        "Целевой отбор"
      ],
      "Biology": [
        "Секвенирование ДНК"
      ],
      "Industry": [
        "Экзоминералогия",
        "Экзодобыча",
        "Адаптация промышленности",
        "Экзоскелеты",
        "Базовая автоматизация"
      ],
      "Science": [
        "Постземная астрономия",
        "Анализ космических лучей",
        "Анализ данных о межзвёздной среде",
        "Туманные вычисления",
        "Новые типы компьютеров",
        "Звёдные карты"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 8,
      "Вода": 32,
      "Гористость": 4,
      "Ресурсы": 84,
      "Тип аномалии": 10,
      "Масштаб аномалии": 9,
      "Примечания": null
    },
    "starSystemParams": {
      "x": 15,
      "y": 28,
      "Тип, масса и возраст звезды": "1.1/, Теория",
      "Плотность звёздной системы": 63,
      "generatorCode": "&2=gl06gtep&3=ts01&4=at00&5=at00&8=th05uucc&10=gs05&11=at00&rest=43646112334212131636244444362166631311121523356315&density=63"
    },
    "colonyParams": {
      "Наука": "10",
      "Производство": "8",
      "Общество": "13",
      "Свободный": "2",
      "Начальные параметры": "2/1/3"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "1",
      "непривычная среда": "2",
      "аномалия": "0",
      "доверие": "2",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Центр гражданской обороны",
      "Научная лаборатория",
      "Станция кибергорничных",
      "Рекреационные зоны",
      "Институт социологии",
      "Адаптивное производство",
      "Обсерватория"
    ],
    "orbital": [],
    "greatPeople": [
      {
        "name": "Хоакин Паэс ",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Государство\")",
            "2"
          ]
        ]
      },
      {
        "name": "Соломон Шошани",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "2"
          ]
        ]
      },
      {
        "name": "Нора Пенья",
        "lvl": 1,
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "1"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "особое",
        "?"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "Конверсия",
        "+1"
      ],
      [
        "Производство",
        "+1"
      ],
      [
        "Строительство",
        "+1"
      ],
      [
        "Исследования (ветка \"Физика пространства\")",
        "2"
      ],
      [
        "особое",
        "?-1 куб к ветке \"Экзобиология\""
      ],
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Подтверждение авторитета(неактивно)",
        "Мобилизация населения",
        "Психологическая адаптация"
      ],
      "Biology": [
        "Оценка внешней среды",
        "Генная терапия"
      ],
      "Industry": [
        "Экзометеорология"
      ],
      "Science": [
        "Колониальная сеть",
        "Умное окружение"
      ],
      "Unique": []
    }
  },
  "Илоний Джобс": {
    "startingFeature": [
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "?улучшаемы"
      ]
    ],
    "techTable": {
      "Military": [
        "Разведывательный корпус",
        "Милитаризация орбиты"
      ],
      "Sociology": [],
      "Biology": [
        "Экзобиология",
        "Секвенирование ДНК"
      ],
      "Industry": [
        "Экзоминералогия",
        "Экзодобыча",
        "Адаптация промышленности",
        "Пусковые технологии",
        "Освоение орбиты"
      ],
      "Science": [
        "Постземная астрономия",
        "Анализ космических лучей",
        "Бионика",
        "Туманные вычисления"
      ],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 11,
      "Вода": 39,
      "Гористость": 3,
      "Ресурсы": 73,
      "Тип аномалии": 9,
      "Масштаб аномалии": 91,
      "Примечания": null
    },
    "starSystemParams": {
      "x": 12,
      "y": 39,
      "Тип, масса и возраст звезды": "G, 0.95, 2.6",
      "Плотность звёздной системы": 42,
      "generatorCode": "&2=tt00&3=ts01&7=tt00&8=ts00&9=tt00&10=at00&11=th04uucc&rest=15152666145616614542461153316611345453214523323432425562435311111321536321461265&density=42"
    },
    "colonyParams": {
      "Наука": "9",
      "Производство": "7",
      "Общество": "11",
      "Свободный": "1",
      "Начальные параметры": "2/2/2"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "1",
      "чуждая среда": "0",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "0",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [
      "Базовая электростанция",
      "Базовое жильё",
      "Научная лаборатория",
      "Институт социологии",
      "Космодром"
    ],
    "orbital": [
      "Первичная орбитальная группировка",
      "Спутники связи"
    ],
    "greatPeople": [
      {
        "name": "Илоний Джобс",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Космос\")",
            "2"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "особое",
        "?"
      ],
      [
        "особое",
        "?"
      ],
      [
        ""
      ],
      [
        ""
      ],
      [
        ""
      ],
      [
        ""
      ],
      [
        ""
      ]
    ],
    "localProjs": {
      "Military": [
        "Para bellum"
      ],
      "Sociology": [
        "Психологическая адаптация",
        "Подтверждение авторитета"
      ],
      "Biology": [
        "Оценка внешней среды",
        "Добыча образцов местной жизни"
      ],
      "Industry": [
        "Обработка руд",
        "Георазведка",
        "Подземное строительство",
        "Экзометеорология",
        "Восстановление звездолёта"
      ],
      "Science": [
        "Умное окружение"
      ],
      "Unique": []
    }
  },
  "Пророк Ракель": {
    "startingFeature": [
      [
        "особое",
        "+1 свободный куб для проектов"
      ]
    ],
    "techTable": {
      "Military": [],
      "Sociology": [],
      "Biology": [
        "Экзобиология"
      ],
      "Industry": [
        "Экзоминералогия",
        "Адаптация промышленности"
      ],
      "Science": [],
      "Unique": []
    },
    "planetParams": {
      "Тип планеты": 6,
      "Расстояние до звезды": 1,
      "Вода": 89,
      "Гористость": 5,
      "Ресурсы": 98,
      "Тип аномалии": 9,
      "Масштаб аномалии": 77,
      "Примечания": null
    },
    "starSystemParams": {
      "x": 36,
      "y": 13,
      "Тип, масса и возраст звезды": "G/1.0/2.5 ",
      "Плотность звёздной системы": 99,
      "generatorCode": "&1=th01uucc&2=ts03&3=ts04&4=tt00&5=at00&6=at00&7=gm09&8=gm05&9=gm10&10=at00&11=gs05&rest=32333263353245216415443133551436411121265352652&density=99"
    },
    "colonyParams": {
      "Наука": "6",
      "Производство": "5",
      "Общество": "11",
      "Свободный": "0",
      "Начальные параметры": "3/2/1"
    },
    "additionalParams": {
      "снабж. отряды": "0",
      "планетарный щит": "",
      "защита колонии": "",
      "чуждая среда": "3",
      "непривычная среда": "0",
      "аномалия": "0",
      "доверие": "1",
      "волнения": "0",
      "осуждение": "0"
    },
    "buildings": [],
    "orbital": [
      "Базовая электростанция",
      "Базовое жильё",
      "Совет колонии"
    ],
    "greatPeople": [
      {
        "name": " пророк Ракель",
        "lvl": 2,
        "effect": [
          [
            "Исследования (ветка \"Компьютеры\")",
            "2"
          ]
        ]
      },
      {
        "name": "Ксенослизни",
        "lvl": 3,
        "effect": [
          [
            "особое",
            "ксенослизни 3 шт и +1 в ход"
          ],
          [
            "особое",
            "1d3 урона по Производству"
          ]
        ]
      }
    ],
    "uniqueResources": [
      [
        "Добыча",
        "-1"
      ],
      [
        "особое",
        "?"
      ],
      [
        "Строительство",
        "-1"
      ],
      [
        "особое",
        "?устранение за Общество 1"
      ],
      [
        "Общество",
        "+1"
      ],
      [
        "особое",
        "?"
      ]
    ],
    "localProjs": {
      "Military": [],
      "Sociology": [
        "Подтверждение авторитета",
        "Психологическая адаптация"
      ],
      "Biology": [
        "Оценка внешней среды"
      ],
      "Industry": [
        "Экзометеорология",
        "Экзодобыча"
      ],
      "Science": [
        "Колониальная сеть"
      ],
      "Unique": []
    }
  }
}