// eslint-disable-next-line no-unused-vars
var DATA__TECH_TRESHOLDS = {
  // just in case
  meta: {},
  data: {
    /*
      Рекомендации:
      - Слово "колонии" писать только в первом по очереди блоке
      - Точки в конце не надо
      - Избегать слов-воды типа:
        этот
     */
    "Military": {
      "НАЗЕМНЫЙ БОЙ": [
        ['BASE','Наземные "вооруженные силы" колонии состоят из десятка человек с пистолетами'],
        ['Разведывательный корпус','В колонии прослеживаются первые признаки возникновения армейских структур'],
        ['Опорные пункты сил самообороны','Обучены и вооружены силы самообороны, способные отогнать от колонии хищников или устранить последствия небольшой катастрофы'],
        ['',''],
      ],
      "ВООРУЖЕНИЕ И ЗАЩИТА": [
        ['BASE',''],
        ['Внутренние войска','Созданы внутренние войска - самые ценные для государства при условии отсутствия внешних угроз'],
        ['',''],
      ],
      "ВОЙНА В КОСМОСЕ": [
        ['BASE',''],
        ['Милитаризация орбиты','Появились первые военные в форме воздушно-космических сил и небольшая группировка чисто военных спутников на орбите'],
        ['',''],
      ],
    },
    "Sociology": {
      ГОСУДАРСТВО: [
        ['BASE', 'Управление колонией держится на авторитете руководителя и его ближайших помощников, правительства нет'],
        ['Колониальное управление', 'Взаимодействие между службами формализуется, внутри них возникает иерархия, но экономика всё ещё на ручном управлении'],
        ['Новое законодательство','Общество колонии всё больше напоминает настоящее государство; возникает законодательство и отчуждение правящих от управляемых'],
        ['',''],
        ['',''],
      ],
      СОЦИОЛОГИЯ: [
        ['BASE','Социология и СМИ опираются на энтузиазм десятка человек и кофеин'],
        ['Новые способы пропаганды','Доступна некоторая информация по социальным процессам; появились государственные СМИ, НЕ похожие на стенгазеты'],
        ['Теория социальных отклонений','Социологи наконец адаптировали идеи пропагандистов 21 века. Кое-какой мониторинг состояния общества ведется непрерывно'],
        ['',''],
      ],
    },
    "Biology": {
      ЭКЗОБИОЛОГИЯ: [
        ['BASE','Биологи колонии почти не имеют о планете данных. Пища в колонии не производится'],
        ['Оценка внешней среды','Биологи колонии имеют о планете только самые общие данные. Пища в колонии производится экспериментально в крайне малых объемах'],
        ['Экзобиология','Выполнен общий анализ планетарной экологии. Пища производится, но всё еще в недостаточном для отмены нормирования объеме'],
        ['Инопланетное сельское хозяйство','Благодаря работе биологов земные методы хозяйствования адаптированы под местные условия'],
        ['',''],
        ['',''],
      ],
      ГЕНЕТИКА: [
        ['BASE',''],
        ['Секвенирование ДНК','Созданы первые генетические лаборатории, при необходимости возможно выполнение избирательного анализа и модификации ДНК колонистов'],
        ['Генная терапия','Проведена умеренная, но массовая генная терапия для адаптации колонистов к местным условиям'],
        ['Генная модификация населения','Создана инфраструктура для массовой и разноплановой генной модификации населения'],
        ['',''],
      ],
      other: [
        ['Инопланетное сельское хозяйство','Колония обеспечивает себя пищей'],
        ['Ксенопитомник','Местные формы жизни достаточно плотно используются колонистами и вполне для них привычны'],
        ['',''],
      ]
    },
    "Industry": {
      ДОБЫЧА: [
        ['BASE','Ресурсы в колонии, за исключением электричества, не вырабатываются'],
        ['Экзоминералогия','Проведена георазведка, месторождения наиболее необходимых колонии ресурсов примерно определены; ведется их экспериментальная добыча'],
        ['Экзодобыча','В колонии развернута добыча наиболее необходимых промышленности ресурсов'],
        ['Обработка руд','В колонии добываются базовые ресурсы, редкоземельные металлы для электроники и радиоактивные руды. Развернуто первое сталелитейное производство'],
        ['Энергетические ресурсы','В колонии идет полномасштабная добыча и переработка всех ресурсов, необходимых промышленности. Создан завод по обогащению урана'],
        ['',''],
        ['',''],
      ],
      ПРОИЗВОДСТВО: [
        ['BASE','Промышленность колонии состоит из привезенных с колониального корабля роботов и пары 3D-принтеров'],
        ['Адаптация промышленности','Земные средства производства адаптированы под местные условия, созданы первые полукустарные мастерские'],
        ['Базовая автоматизация','Мастерские колонии обладают серьезными мощностями и вынесены в отдельные здания'],
        ['Масштабное производство','Производительность заводов колонии приближается к производительности промышленного мегаполиса 21 века'],
        ['',''],
      ],
      КОСМОС: [
        ['BASE',''],
        ['Первичная орбитальная группировка','Над колонией летают простейшие спутники для съемки поверхности и сбора метеоданных'],
        ['Освоение орбиты','На орбите кружит несколько группировок научных спутников и первый автоматический завод; проведена оценка ресурсов других планет звездной системы'],
        ['',''],
        ['',''],
      ],
      other: [
        ['Метеостанция','У колонистов есть ежедневные прогнозы погоды'],
        ['Базовая автоматизация','В обществе появляется прослойка рабочих'],
        ['',''],
      ],
    },
    "Science": {
      "ФИЗИКА ПРОСТРАНСТВА": [
        ['BASE',''],
        ['Постземная астрономия','Колонисты установили состав своей звездной системы и восстановили базовую экспертизу в области астрономии и физики в целом'],
        ['Анализ данных о межзвёздной среде','Физики колонии восстановили и уточнили научную информацию из корабельных банков данных'],
        ['Анализ несоответствий','Колония сделала первый маленький шаг за пределы классической земной физики'],
        ['Физика элементарных частиц','Колониальные физики овладели всей полнотой земных знаний, а в некоторых областях их даже превзошли'],
        ['',''],
      ],
      КОМПЬЮТЕРЫ: [
        ['BASE',''],
        ['Колониальная сеть','В колонии создан интранет'],
        ['Самообучение','Создан первый суперкомпьютерный центр, разработаны алгоритмы, способные к самообучению и самоконтролю в очень широких пределах'],
        ['',''],
      ],
      ИМПЛАНТЫ: [
        ['BASE',''],
        ['Бионика','В колонии налажены производство и установка наиболее простых и важных имплантов'],
        ['Импланты','Базовые импланты  доступны, при желании, всем жителям'],
        ['Искусственные органы','Импланты используются достаточно широко. Созданы эффективные аналоги очень многих внутренних органов'],
        ['Автономность имплантатов','Производимые импланты обладают высоким качеством и долговечностью и очень облегчают повседневную жизнь'],
        ['',''],
        ['',''],
      ],
      other: [
        ['Обсерватория','Составлены карты ближайшего звездного окружения'],
        ['Реактор термоядерного синтеза','В колонии воссоздано одно из главных чудес прародины - реактор холодного термоядерного синтеза'],
        ['Физика элементарных частиц','Сформировано научное сообщество, располагающее серьезными даже по земным меркам мощностями и возможностями'],
        ['Колониальная сеть','У каждого из колонистов есть личный компьютерный терминал'],
        ['Станция кибергорничных','По колонии бегают кибергорничные'],
        ['Дополненная реальность','Дополненная реальность прочно вошла в быт'],
        ['Малоинвазивные методики','Почти каждый житель обладает широким набором имплантов'],
        ['',''],
      ],
    },
  }
}